package com.example.recipe;

import android.content.Intent;
import android.net.Uri;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.support.v7.widget.Toolbar;
import android.view.Menu;
import android.view.MenuItem;
import android.view.View;
import android.view.Window;
import android.view.WindowManager;
import android.widget.ImageView;
import android.widget.TextView;

import com.github.clans.fab.FloatingActionButton;
import com.github.clans.fab.FloatingActionMenu;



public class subhome extends AppCompatActivity {

    FloatingActionMenu fab;
    FloatingActionButton fab_1, fab_2, fab_3;

    String txt,txt2;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.share);

        Window window = this.getWindow();
        window.clearFlags(WindowManager.LayoutParams.FLAG_TRANSLUCENT_STATUS);
        window.addFlags(WindowManager.LayoutParams.FLAG_DRAWS_SYSTEM_BAR_BACKGROUNDS);
        window.setStatusBarColor(this.getResources().getColor(R.color.mycolor));


        Toolbar toolbar = (Toolbar) findViewById(R.id.tool);
        setSupportActionBar(toolbar);

        if (getSupportActionBar() != null) {

            getSupportActionBar().setDisplayHomeAsUpEnabled(true);
            getSupportActionBar().setDisplayShowHomeEnabled(true);
        }

        String Text = getIntent().getStringExtra("home");
        String Text2 = getIntent().getStringExtra("my_txt");
        int Text3 = getIntent().getIntExtra("int", 0);

        final TextView textView1 = (TextView) findViewById(R.id.content);
        final TextView textView2 = (TextView) findViewById(R.id.content2);
        ImageView img = (ImageView) findViewById(R.id.hawa);
        TextView textView3=(TextView)findViewById(R.id.txtview);


        switch (Text) {
            case "Nasta Receipes": {
                switch (Text3)
                {
                    case 0: {
                        textView3.setText(Text2);
                         img.setImageResource(R.drawable.n1);
//                       txt = getResources().getString(R.string.delete);
//                        txt2 = getResources().getString(R.string.delete2);
                        txt = ("• जीरा 1 चम्मच\n• राई 1 चम्मच\n• कड़ी पत्ता 4-5\n•हरी मिर्च 2\n•प्याज 2\n•हल्दी पाउडर 1/2 चम्मच\n•चूड़ा 2 कप \n•नारियल कप 1/2 (कसा हुआ )\n• चीनी 1/2 चम्मच\n•तेल  1 चम्मच\n•हरी धनिया 2 चम्मच\n•नमक स्वाद अनुसार");
                        textView1.setText(txt);
                       txt2 = ("•एक पैन मे तेल गरम करे, उसके बाद उसमे राई, जीरा और कड़ी पत्ते के साथ सीजन करे\n\n•उसके बाद उसमे कटी हुई हरी मिर्च और कटे प्याज दाल कर 5 मिनट के लिए फ्राई करे\n\n•उसके बाद पोहा,नमक,हल्दी और चीनी डालकर ढक्कन को कवर करे और 5 मिनट तक के लिए हल्की आंच पर पकाए\n\n•इसके बाद आखिर मे घिसा हुआ नारियल और हरी धनिया डाल  कर फिर से 3-4 मिनट के लिए हल्की आंच पर ढक कर पकाए लीजिये तैयार हो गया आपके कांदे पोहे\n\n");
                        textView2.setText(txt2);
                        break;

                    }
                    case 1: {
                        textView3.setText(Text2);
                       img.setImageResource(R.drawable.n2);
//                       txt = getResources().getString(R.string.delete2);
                      txt = ("• पोहा -2  कप\n•आलू- 2 उबलते हुए\n•प्याज - 1\n•अदरक पेस्ट -1/2  चम्मच\n•चीनी - 1 चम्मच\n•नमक स्वाद अनुसार\n• नींबू का  रस-1 चम्मच\n•राई -1 चम्मच\n•हींग चुटकी भर\n•धनिया पत्ती -2 चम्मच\n•तेल -1  चम्मच");
                        txt2 = ("•पोहे को धोकर कुछ समय तक पानी निथार कर रख दे\n\n•पैन में तेल गरम करे और उसमे राई और हींग डाले\n\n•जैसे ही राई तड़कने लगे तभी कटी हुई प्याज दाल कर उसे 5 मिनट तक पकने दे\n\n •फिर उसमे अदरक और हरी मिर्च पेस्ट डाले\n\n•इसे कुछ मिनट  पकाने के बाद इसमें उबले आलू डालिये और मध्यम आंच पर 4-5  मिनट तक पकाएं  \n\n•अब इसमें पोहा,नमक,निम्बू और चीनी डाले\n\n•मिक्सम कर के पांच मिनट तक पकाएं और कटी हरी धनिया छिड़के\n\n•आंच बंद कर दे और गरमा गरम पोहा सर्व करे\n\n");
                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.n3);
                        txt = ("•बड़ी गार्लिक ब्रेड\n•अदरक -लहसून का पेस्ट-एक छोटा चम्मच\n•टमाटर कटे -एक कप\n•खीरा कटा- एक कप\n• प्याज कटा- एक कप\n•गाजर कटी 1/2 कप\n•बेबी कॉर्न 1/ 2  कप\n•लाल मिर्च 1 /2 छोटा चम्मच\n•काली मिर्च 1/2 छोटा चम्मच\n•धनिया पाउडर एक छोटा चम्मच\n•राई 1 /2  छोटा चम्मच\n•जीरा भुना -1/2 छोटा चम्मच\n•हल्दी 1 /2  छोटा चम्मच\n•टमाटर सॉस 2छोटा चम्मच\n•चाट मसाला एक छोटा चम्मच\n•नमक स्वादानुसार\n•तेल या -घी एक छोटा चम्मच");
                        txt2 = ("•गार्लिक ब्रेड काट ले और एक तरफ रख दे एक कढ़ाई मैं तेल डाले और उसमे राई डाले अदरक लहसून का पेस्ट डाले और थोड़ा भुने फिर प्याज डालकर भुने | सब्जियों और चाट मसाले को छोड़कर सभी मसाले,नमक डाले और पांच  मिनट धीमे आंच पर पकने दे\n\n•गैस बंद कर दे और गार्लिक ब्रेड के पीस पर मक्खन लगा कर यह मसाला लगा दे और ऊपर  से चाट मसाले को छोड़ कर सभी मसाले,नमक डाले और पांच मिनट धीमे आंच पर पकने दे\n\n•गैस बंद कर दे और गार्लिक ब्रेड के पीस पर मक्खन लगा कर यह मसाला लगा दे और उप्पर से चाट डालकर ओवन  मे 180 सेंटीग्रेड पर दस मिनट  के लिए पका ले यदि ओवन नहीं है तो गैस तंदूर या तवे पर भी सेक सकती है आप इसके ऊपर चीज़ भी दाल सकती है\n\n");
                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 3: {
                        
                        textView3.setText(Text2);img.setImageResource(R.drawable.n4);
                        txt = ("•आलू- 500 ग्राम (8-10 आलू)\n•ब्रैड - 4 (आप चाहें तो ब्रैड की जगह एक चौथाई कप अरारोट भी प्रयोग कर सकते हैं)\n•हरी मटर के दाने - 1 कप\n•धनिया पाउडर - आधी छोटी चम्मच\n•अमचूर पाउडर - एक चौथाई छोटी चम्मच\n•गरम मसाला - एक चौथाई छोटी चम्मच\n•लाल मिर्च - एक चौथाई छोटी चम्मच (यदि जाए सीखा खाते हैं सो)\n• नमक - स्वादानुसार (एक छोटी चम्मच)\n•रिफाईड तेल या देसी घी - 3-4 टेबल स्पून ");
                        txt2 = ("•आलू को  अच्छी तरह धो कर कूकर में उबाल लीजिये और मटर के दानों को मिक्सी में दरादरा पीस लीजिये। अब कढाई में एक टेबल स्पून तेल डाल कर गर्म कीजिये और उसमें धनिया पाउडर डाल कर भून लीजिये। उसके बाद इसमें पिसी हुई मटर, नमक, अमचूर पाउडर, लाल मिर्च और गरम मसाला डालिये और कलछी से चला कर 2-3 मिनट तक भूनिये । टिक्की के अंदर भरने के लिये पिट्ठी तैयार हैं\n\n•आलुओं को ठंडा करके छीलिये और  कद्दूकस कर नमक मिला लीजिये। ब्रेड को मिक्सी में पीस कर पाउडर कर लीजिये और आलू में मिलाकर आटे की तरह गूथ लीजिये।  गुंथे हुए आलू 8 बराबर के टुकडे तोडिये और आलू के अंदर भरने वानी पिट्ठी को भी 8 बराबर भागों में बाट लीजिये \n\n•अब आलू के मिश्रण का एक टुकडा लीजिये और उंगलियों से उसके बीच में एक गडूढा बना कर उसके अंदर पिंट्ठी भर दीजिये। आलू को चारों और से उठा कर पिंट्ठी को अंदर बंद कर दीजिये और आलू  को गोल कर हथेली से दबाकर चपटा कर लीजिये। सभी टुकडों को इसी तरह बना लीजिये \n\n• अब गैस पर तवा गर्म कीजिये और उस पर एक टेबल स्पून तेल डाल कर तवे पर  चारों और फैला दीजिये। जितनी  टिक्किया एक बार में तवे पर  आ जाएं उतनी रख कर सेक लीजिये। चम्मच से थोडा सा तेल टिक्कियों के ऊपर डाल कर धीमी गैस पर कलछी से पलट-पलट कर दोनों और से ब्राउन होने तक सेक लीजिये। आलू  की टिक्कियाँ तैयार हैं ।\n\n• आलू की 1 -2 टिचकी प्लेट में रख कर ऊपर से हरी चटनी,मीठी चटनी, चाट मसाला और फेंटीं हुई दही डाल कर परोसिये और खाइये ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 4: {
                        
                        textView3.setText(Text2);img.setImageResource(R.drawable.n5);
                       txt = ("•बाउन सैंडविच ब्रेड 8 पीस\n•गाजर 1 मध्यम आकार  को\n•शिंमला मिर्च 1 छोटा\n•आलू 2 मध्यम आकार \n•प्याज़ 1 आकार  का\n• काली मिर्च पाउडर एक चौथाई छोटा चम्मच \n•हरा धनिया 1 चम्मच बारीक कटा हुआ\n• नमक स्वादानुसार\n•बटर या घी सैंडविच पर  लगाने के लिए");
                        txt2 = ("•गाज़र का कहूकस करके उसका सारा पानी  निचोड के निकाल दे. शिमला मिर्च और प्याज क्रो बारीक काट ले,आलू क्रो उबाल के मैस कर ले, फिर सारी सब्जियों क्रो अच्छे से  ले उसमें नमक और काली मिर्च और हरा धनिया \n\n•ब्रेड के बीच में रख के दोनों तरफ से हल्का सा बटर या घीभी लगा दे सैंडविच मेकर या फिर तवे के ऊपर  रन्द्रवष्करदोनों तरफ से नारा होने तक स्नेक ले.\n\n•वेज़ सैंडविच हैं सोस के साथ गरमागरम सैंडविचसुबह के नाश्ते में खिलाये या चन्टचो के लंच बॉक्स में दे उन्हें बहुत पसंद जायेगा.\n\n");

                        textView1.setText(txt);

                        textView2.setText(txt2);
                        break;
                    }

                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.n6);
                       txt = ("•6 सैंडविच ब्रेड (ब्राउन या वाइट)\n•-1३ कप उबले हुए स्वीट कॉर्न\n•1 कटा हुआ शिमला मिर्च\n•1८८ कप एमीर छोटे टुकडो में कटा हुआ\n•1 प्याज बारीक कटा हुआ\n• 1 टमाटर बीज निकाल के कटा हुआ\n• 4-5 चम्मच बटर\n•1 कप मोऱब्रेरेला चीज़ कहूकस करा हुआ\n• 1८८ चम्मच काली मिर्च पाउडर\n• 5-6 चम्मच टोमैटो सोस या पिड़जा सोस\n•नमक स्वादानुसार");
                        txt2 = ("• सबसे पहले  ब्रेड स्लाइसेस  एर बटर और सोस लगा दे\n\n• उसके बाद सारी को हुआ  और पनीर  ब्रेड स्लाइसेस  के ऊपर फैला दे.\n\n•उसके उसमे  नमक और काली मिर्च छिड़क दे.\n\n•उसके बाद कहूकस को हुई मोज़रेला चीज़ ब्रेड के ऊपर फैला दे.\n\n•अब एक नॉन स्टिक तवे पर  गरम को उसके ऊपर थोडा बटर डाले और ब्रेड के स्लाइसेस  तवे एर रख दे ऊपर से किसी प्लेट से ढक के धीमी आंच एर चीज़ के गलने या और ब्रेड के कुरकुरे  होने तक पकाये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.n7);
                       txt = ("•1 /4 कप तेल\n•2 सूखी लाल मिर्च\n• 2 चम्मच काजू\n• 1 चम्मच उरद दाल\n• 1 चम्मच चना दाल\n• 1 चम्मच राई\n• 1 चुटकी हींग \n• 3 हरी मिर्च\n •1 डंठल ताजी कडी \n•1 टमाटर, कटा हु\n•1 चम्मच पिसी अदरक\n•नमक\n•2 कप सूजी\n•3 चम्मच  ताजा नींबू रस");
                        txt2 = ("•एक कढाई में तेल गरम करें,  उसमें लाल मिर्च , काजू उरद दाल, चना दाल और राई क्रो 5 मिनट तक भून लें ।\n\n• फिर ऊपर से हींग पाउडर डालें, फिर को प्याज, हरी मिर्च  डाल कर पकाये  ।\n\n• कढाई में पानी  उन्हें इसके साथ ही को हुए टमाटर,अदरक घेस्टी और नमक डाल कर उबालें ।\n\n• धीरे धीरे सूजी डालती रहें और दूसरे हाथों से मिलाती रहैं ।अगर जाए इसे लगातार नहीं चलाएँगी या फिर इसे एकझटके में डाल देंगी तो यह जम जाएगी ।\n\n•गैस को आंच धीमी कर दें और इसे ढंक दें । फिर 1 0 से 15 मिनट तक एकाएं \n\n• मिश्रण में निम्बू का रस और घी डालें और कढाई क्रो गैस सेउतार लें । 10 मिनट सेट हो जाने के बाद इसे सर्व करें\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.n8);
                       txt = ("•2 कप भूनी सेवई\n•एक चौथाई कप मटर\n•2-3 हरी मिर्च प्याज बारीक कटा हुआ \n• गाज़र बारीक कटी  हुई\n•आधा  कप गोभी के टुकडे मध्यम आकार  के\n•एक चौथाई चम्मच सरसों  \n•टमाटर बारीक कटा हुआ \n•2चम्मच हरा धनिया बारीक कटा हुआ \n•२ बडे चम्मच तेल\n•बडा चम्मच सोस \n•नमक स्वादानुसार");
                        txt2 = ("• एक पैन  में तेल गरम करके  सरसों दाना डाले फिर बारीक कटा हुआ प्याज डाले, प्याज गुलाबी होने एर, टमाटर डाले टमाटर गलने तक भूने, हरी मिर्च, मटर, गाज़र, गोभी, डालकर आधा पका ले, इसमें नमक मिला दे।\n\n• कुछ देर भूने, एक कप पानी और सोस मिला दे, धीमी आंच पर  पानी सूखने तक उठाए ।\n\n•हरी धनिया से सजा के परोसे।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.n9);
                       txt = ("•सादा बना हुआ दलिया - 1 कप दलिया बनाया गया\n•तेल - 2 टेबल स्पून \n•हींग -1 -2 पिंच\n•जीरा - आधा  छोटी चम्मच\n•हरी मिर्च - 2 ( बारीक कटी हुई )\n• अदरक - 1 इंच लम्बा टुकडा ( बारीक काटा हुआ )\n•मटर - आधा  कप ( छिल हुये दाने )\n• फूल गोभी - आधा  कप ( बारीक कटा हुआ )\n• गाजर - आधा  कप ( बारीक कटी हुई )\n•शिंमला मिर्च - आधा  कप (छोटी छोटी कटी)\n• टमाटर - आधा  कप ( बारीक कटे हुए )\n•नमक- स्वादानुसार\n•हरा धनियां - एक टेबल स्पून  ( बारीक कटा हुआ )");
                        txt2 = ("•कढाईं में तेल डालकर गरम दिजिये ।\n\n•तेल में हींग  और जीरा डाल दीजिये । जीरा भूनने के बाद हरी मिर्च, अदरक डालकर हल्का सा चमचे से चलाकर भूमिये. हरे मटर के दाने, गोभी, गाजर, शिमला मिर्च डालकर 2 - 3 मिनिट तक सब्जियों क्रो क्रंची  रहने तक भून लीजिये, नमक डाल कर मिला दीजिये ।\n\n•अव इन सब्जियों में दलिया और साधा हरा धनियां डालकर अच्छी  तरह मिला दीजिये ।  दलिया पुलाव तैयार हैं ।\n\n •दलिया पुलाव क्रो प्याले में निकालिये और बचा हुआ हरा धनिया ऊपर से डालकर सजाइये1\n\n•गरभा गरम दलिया पुलाव, चटनी या दही के साथ परोसिये  ओर खाइये ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.n10);
                       txt = ("•चाचल - 3 कप\n•उरद को धुली दाल - 1 कप\n•बेकिंग सोडा - 1/2 छोटी चम्मच\n •नमक - स्वादानुसार\n•तेल - इडली है-ड क्रो चिकना करने के लिये");
                        txt2 = ("•उरद की  दाल ओर चावल को साफ कीजिये, धोइये ओर 4 घंटे या रात भर के लिये पानी में भिगो।\n\n•उरद दाल से अतिरिक्त पानी  निकल दीजिये और कम पानी  का प्रयोग करते हुये एक दम बारीक पीस लीजिये, चावल से भी अतिरिक्त पानी  निकाल दीजिये और कम पानी  का प्रयोग करते हुये थोडा सा मोटा पीसिये, दोनों क्रो मिलाइये तथा इतना गाढा घोल तैयार कीजिये कि चमचे से गिराने एर एकदम धार के रूप में नही गिरना चाहिये ।\n\n•मिश्रण क्रो फर्मेंट  करने के लिये स्वादानुसार नमक और बैकिंग सोडा, 12- 14 घंटे के लिये रख दीजिये, फरमेन्ट क्रिया हुआ मिश्रण पहले  को अपेक्षा दोगुना हो जाता हैं । इडली बनाने के लिये मिश्रण तैयार है ।\n\n•इडली बनाइये:\n\n मिश्रण क्रो चमचे से चलाइये, यदि बहुत अघिक गाढा लग रहा है तो थोडा पानी  मिला लीजिये यदि आपके पास इडली बनाने का  बर्तन हैं तो बहुत ही अच्छा है. नहीं तो आप  इडली मेकर ओर प्रेशर कुकर में भी इडली बना सकते हैं । इडली प्रेशर कुकरमें ही बनाती हूं.\n\nप्रेशर कुकर में 2 छोटे गिलास पानी (500 ग्राम पानी)डालकर गरम करने के लिये गैस एर रखिये ।\n\nइडली स्टैंड  निकालिये साफ कीजिये, इडली के खानों में तेल लगाकर चिकना दिजिये ।\n\n चमचे से इडली स्टैंड  के खानों में बराबर बराबर मिश्रण भरिये, सारे खाने भर कर इन्हें इडली स्टैंड  में लगा लीजिये. इडली पकने के लिये स्टैन्ड क्रो कुकर में रखिये.कुकर का ढबकन बन्द कर दीजिये, दक्खन के ऊपर सीटी मत लगाइये ।\n\nतैज गैस क्लेम पर 9-10 मिनिट तक इडली पकने दीजिये.गैस बन्द कर दीजिये इडली पक गयीं हैं ।\n\nप्रेशर कुकर खीलिये, इडली स्टैंड निकलिये, खांचे अलग कीजिये, ठंडा दिजिये और चाकू की  सहायता से इडली निकाल कर प्लेट में लगाइये ।\n\nलीजिये  इडलिंयां तैयार हैं, गरमा गरम इडली गरमा गरम सांबर और नारियल को चटनी और मूंगफली को चटनी के साथ परोसिये ओर खाइये ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.n11);
                       txt = ("•चार लोगों के लिये.\n•रवा (सूजी) … 200 ग्राम या 1/2 कप\n•दही … 300 ग्राम या 1/2 कप\n•पानी… 50 ग्राम या 1/4 कप\n नमक … स्वादानुसार या 3/4 छोटी चम्मच\n•ईंनो साल्ट … आधा  छोटी चम्मच\n•तेल … एक बड़ी  चम्मच ( इडली है-ड क्रो चिकना करने के लिये)");
                        txt2 = ("•सबसे पहले दही क्रो फैट लीजिये. अब एक बर्तन में सूती लीजिये और उसमें दही डाल कर अच्छी  तरह मिला लीजिये।\n\n•इसमेँ पानी और नमक डाल कर और फैट लीजिये. अब मिश्रण क्रो 20 मिनिट के लिये रख दीजिये. 20 मिनट बाद मिश्रण में सोडा डाल कर अच्छी  तरह मिला लीजिये।\n\n•मिश्रण अधिक गाढा और अधिक पतला न हो ।\n\n•क्रुकर में 2 छोटे गिलास पानी डालकर गैस एर रख दीजिये यानी क्रो गरम होने दीजिये. इडली  क्रो थोडा तेल लग कर चिकना कर लीजिये । मिश्रण क्रो चमचे की  सहायता से इडली के प्रत्येक खाने में भर दीजिये. एक बार में 12 या 18 इडली बन जाती हे. यह इडली है-ड के साइज एर निर्भर है।\n\n•इडली स्टैन्ड को  जमा कर कुकर में रख दीजिये और दक्खन  लगा दीजिये लेकिन ढवकन पर से सीटी हटा लीजिये ।\n\n•8 या 10 मिनिट में इडली पक जाती है ।\n\n•क्रुकर का ढवकन खोलिये  इडली क्रो कुकर से निकालिये , ठंडा होने एर चाकू को सहायता से है-ड से इडली निकाल कर प्लेट में रख लीजिये ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.n12);
                       txt = ("•उरद दाल- 1 /4 कप\n• चना दाल- 1 /4 चम्मच\n•दही- 1 /8 कप\n•काजू- 100 ग्राम\n•हरी मिर्च… 2\n•नारियल- 1 7(2 कप\n•अदरक- 1 /4 चम्मच\n•मिर्च पाउडर- 1 /2 चम्ममच\n•नमक-\n•कडी पत्ते से\n•तेल- 3 चम्मच\n•घी- 1 चम्मच\n•उरद दाल और चावल क्रो पानी  में 4 घंटे के लिये धोकर पानी  में भिगो दीजिये।\n• अब चना दाल क्रो अलग से पानी  में भिगोइये ।");
                        txt2 = ("उरद दाल और चावल क्रो पानी  से निकाल कर मिक्सी में पीस लें ।\n\n•अब इन्हें  एक साथ किसी गर्म जगह एर करीब 8 घंटों के लिये रख दें जिससे कि उसमें खमीर बन जाए ।\n\n •अब इस मिश्रण में दही, काजू हरी मिर्च, घिसी गरी, अदरक, मिर्च पाउडर, कडी पत्तीत, जी, नमक और भिगो चना दाल मिक्स करें ।\n\n•अब  सांचे में घी लगाइये और उस में इस इडली के मिश्रण को भरिये ।\n\n•10 से 12 मिनट तक इडली को भाप में पकाइये और फिर सर्व कीजिये\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.n13);
                       txt = ("•2 कप इडली रवा\n• 1/4 कप पोहा\n•1/2 कप उड़द दाल\n•नमक स्वादअनुसार\n•तेल चुपड़ने के लिए");
                        txt2 = ("•इडली रवा और पोहा क्रो साफ कर लें,धो लें और पानी में कम से कम २ घंटे के लिए भिगो दें ।\n\n•साफ  उड़द दाल क्रो अच्छी तरह धो लें और पानी  में कम से कम २ घंटे के लिए भिगो दें ।\n\n•इडली रवा और चावल क्रो छान लें और मिलकर मिक्सर में पीसकर मुलायम घोल बना लें ।\n\n• उड़द दाल क्रो अलग से छानकर थोडे पानी के साथ मिक्सर में पीसकर मुलायम पेस्ट बना लें ।\n\n•  घोल क्रो एक बाउल में मिला लें नमक डालकर अच्छी  तरह मिला लें । ढककर खमीर  के लिए  2 घंटे के लिए एक तरफ रख दें ।\n\n•तेल से चुपड़े इडली के साँचे में चम्मच भर घोल डालें और स्टीमर में 2 मिनट तक स्टीम कर लें .\n\n•बचे हुए घोल का प्रयोग कर ओर इडली बना लें ।\n\n•गरमा   गरम परीसें\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.n14);
                       txt = ("•उड़द धुली दाल - 1 कप\n•चावल - 3 कप\n•चना दाल - 1 /4 कप\n•मेथी दाना - 1 टेबलस्युन\n•नमक स्वादानुसार\n•तेल डोसे सेंकने के लिए");
                        txt2 = ("•उड़द दाल और चावल क्रो धोकर अलग अलग 6 घंटे या पूरी रात के लिए पानी  में भिगो दे ।\n\n•चना दाल और मेथी दाना क्रो भी धोकर पूरी रात या 6 घंटे के लिए एक साथ पानी  में भिगो दे ।\n\n•चावल और दाल से पानी  निकाल दे उड़द दाल  के साथ मिक्सर में बारीक पीस ले चावल क्रो भी थोडे पानी के साथ मिक्सर में बारीक पीस ले चना दाल और मेथी दाना से भी पानी निकाल दे और थोडे पानी के साथ मिक्सर में बारीक पीस ले ।\n\n•चावल और दाल के घोल क्रो आपस में अच्छी  तरह मिला ले अब इस घोल क्रो ढककर गरम जगह एर खमीर उठाने के लिए 12 से 14 घंटे के लिए रख दे ।\n\n•डोसे का घोल चीलें के घोल को तरह होना चाहिए जब घोल में खमीर उठ जाए तो उसमे नमक मिला दे डोसे का घोल तैयार हैं ।\n\n•नान स्टिक तवा गरम को उसमे थोडे पानी  के छोटे देकर उसको कपडे से पोंछ दे ।\n\n•अब तवे एर एक बडे चम्मचे या कटोरी से घोल डाले और उसे चम्मचे से बढाते हुए 8 से 9 इंच गोलाई का डोसा बनाए\n\n•डोसे के किनारों एर तेल लगाए डोसे क्रो पलटे नही डोसे क्रो तेज आँच एर 1 मिनट तक या ब्राउन होने तक रोते डोसे क्रो कलछी को सहायता से मोड़ते हुए रोल कर ले उसे प्लेट में निकल ले इसी तरह सारे डोसे बना ले ।\n\n•गरमागरम पेपर डोसा तैयार हैं ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.n15);
                       txt = ("•चावल … 3 कटोरी\n•उड़द दाल … 1 कटोरी\n•चना दाल  … 1 छोटी चम्मच\n• मैथी दाना … 1 छोटी चम्मच\n•नमक … स्वादानुसार\n•ब्रेकिंग सोडा  छोटी चम्मच सब्जियाँ मसाला डोसा एर डालने के लिए\n• प्याज … आधा  बारिक कटा हुआ\n• हल्दी … आधी छोटी चम्मच\n• लाल मिर्च पाउडर … 1 /2 छोटो चम्मच\n•नमक … स्वादानुसार\n•आलू … उबले कटे  3 से 4\n•टमाटर … 2 बारिक कटे  हुए\n•हरा धनिया … आधी छोटी कटोरी\n•हरी मिर्च … 2 बारिक कटे \n• अमचूर … 1 छोटी चम्मच\n•राई … 1 छोटी चम्मच\n•तेल … 4 छोटो चम्मच\n•कडी पत्ता … 10 से 15");
                        txt2 = ("•डोसा में भरने के लिए मसाला बनाने के लिए-\n\n•कड़ाही में दो चम्मच तेल डाल लीजिये जब तेल गरम हो जाएगा तब उसमें राई, कढी पत्ता डाल दीजिये जब राई चटक जाए तब उसमें हरी मिर्च, प्याज, डाल कर हल्का भूरा कर लीजिये फिर उसमें लाल मिर्च, हल्दी, अमचूर, टमाटर डाल दीजिये, और तब तक पका  लीजिये जब तक टमाटर नरम नहीं हो जाते  ।\n\n• फिर आलू डाल कर गैस क्रो 2 से 3 मिनट के लिए पका  लीजिये। फिर उस एर हरा धनिया डाल दीजिये।\n\n•डोसा में भरने के लिए मसाला बन कर तैयार है ।\n\n• डोसा बनाने के लिए …\n\n•दाल, मैथी, चना दाल और चावल क्रो 12 घंटे तक पानी  में भिगो दीजिये। दाल और चावल में से अतरिक्त पानी  निकाल लीजिये और थोडा पानी  डाल कर मिक्सी में दरदरी पीस लीजिये। फिर पेस्ट में से खमीर उठाने के लिए उसमें ब्रेकिंग सोडा डाल कर पेस्ट ,क्रो गरम जगह एर 12 घंटे के लिए रख दीजिये। पेस्ट में नमक डाल लीजिये।\n\n•लोहे के तवे क्रो गरम करने के बाद उसे गीले मोटे कपडे से पोछ कर उस एर 1 छोटी चम्मच नेल डाल लीजिये और नेल क्रो तवे एर फैलाने के बाद एक छोटी कटोरी पेस्ट डाल कर 14 से 15 इंच  गोल गोल आकार  में बिल्कुल पतला फैला लीजिये, उस पर  2 छोटे चम्मच नेल लेकर उसे डोसा के चारों तरफ डाल दीजिये और गाआं । जब डोसा ऊपर से सिखा हुआ दिखाई देने लगे तब उस एर 2 से चम्मच मसाला डाल दीजिये और चम्मच से किनारी को तरफ से मोड़ लीजिये।\n\nदूसरा डोसा बनाने के लिए तवे क्रो गीले कपडे से पोछ लीजिये ताकि तवा ज़यादा गरम ना रहे अगर तवा गरम रहेगा तो दूसरे डोसे क्रो फैला नहीं पाएंगे । एक कटोरी पेस्ट लेकर तवे एर डाल कर चारों तरफ डाल कर गोल आकार  में फैला लीजिये और मीडियम आँच एर सेख लीजिये पाले वाले डोसे को तरह ।\n\nडोसा बन कर तैयार हैं जाए इसे सांभर और मूँगफली या नारियल को चटनी के साथ खा सकते है ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                }
                break;
            }

            case "Paratha Receipes": {

                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p1);
                       txt = ("•आटा लगाने के लिये:\n•गेहूं का आटा … 400 ग्राम ( 4 कप )\n•तेल - 1 टेबल स्पून स्पून  \n•सटफिंग के लिये:\n•आलू … 400 ग्राम ( 6-7 मध्यम आकार  के)\n•धनियाँ पाउडर … एक छोटी चम्मच\n•लाल मिर्च पाउडर … एक  चौथाई छोटी चम्मच\n•गरम मसाला … एक चौथाई छोटी चम्मच\n•अमचूर पाउडर … एक चौथाई छोटी चम्मच\n•हरी मिर्च … 2\n•अदरक - 1 इंच टुचड़ा\n•हरा धनियाँ … 2 -3 टेबल रथून बारीक हुआ\n• नमक … स्वादानुसार (एक छोटी चम्मच)\n•रिफाइन्ड तेल या देशी घी … परांठे में लगाने के लिये");
                        txt2 = ("•सबसे पहले आलुओं क्रो उबालते हैं, कुकर में आलू  और एक गिलास पानी  डालकर गैस एर रखिये और एक सीटी आने  के बाद 1-2 मिनिट धीमी आग  पर  आलू उबलने दीजिये, गैस बन्द दिजिये और कुकर का प्रेशर यत्म होने के बाद कुकर से आलू निकाल लेंगे.\n\n•आटे में 2 छोटी चम्मच घी या तेल डालिये और नमक एक चौथाई छोटी चम्मच डालकर मिला लीजिये. पानी को सहायता से नरम आटा गूथिये . गुंथे आटे  क्रो सैट होने के लिये 15-20 मिनिट के ढककर रख दीजिये.\n\n•उबलते हुए आलूओ क्रो ठंडा करके छिलऐ और उन्हें बारीक तोड़ लीजिये. इसमें नमक,लाल मिर्च, गरम मसाला, अमचूर पाउडर, धनियाँ पाउडर, हरी मिर्च, अदरक और हरा धनियाँ डाल लीजिये. मसाले क्रो अच्छी  तरह आलूओ में मिला लीजिये. यह आलू क्री पिट्ठी  पराँठे में भरने के लिये तैयार हैं. इस पिट्ठी क्रो 1 2 बराबर भागों में बाँट लीजिये\n\n• आटे  के बराबर के 12 गोले बना लीजिये. प्रत्येक गोले क्रो बेलन को सहायता से बेलिये, बेले गये परांठे के ऊपर थोडा सा तेल डाल कर लगाइये और उसमें एक भाग आलू  रक दीजिये, परांठे क्रो चारों और से उठाकर बन्द कर दीजिये.उँगलियों से दबाकर चपटा कर लीजिये. उसे बेलन को सहायता से हल्का दबाव देते हुये 8 -9 इंच के व्यास में बेल  लीजिये. गैस एर तवा रखिये, तवा गरम होने एर, तवे एर थोडा सा तेल लगाइये और अब बेल  हुआ पराँठा गरम तवे एर डालिये, पराठा नीचे से सिकने पलटिये , दूसरी तरफ से सिकने  एर ऊपर को और तेल लगाइये और परांठे क्रो पलट कर दूसरी और भी तेल लगाइये. चमचे या कलछी चमचे या कलछी से चारों और हल्कऱ दबाव देते हुये परांठे क्रो दोनों तरफ खस्तऱ, ब्राउन चित्ती जाने तक रोकिये. इसी तरह से सारे पराँठे स्नेक लीजिये. पराँठे तैयार हैं.\n\n• ये पराँठे जाए मक्खन, हरे धनिये को चटनी, मटर के झोल या दही के साथ पराँसिये और खाइये.जाता लगाने के लिये\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p2);
                       txt = ("•गुंथा हुआ आटा\n•बारीक कटी  हुए प्याज\n•नमक्रीन\n•हरा धनिया\n•नमक\n• लाल मिर्च\n•गरम मसाला\n•बारीक़ कटी  हुई हरी मिर्च\n• सौंफ");
                        txt2 = ("•पराठे बनाने के लिए हम गूथा हुआ आटा लेंगे।\n\n•इसके साथ एक बाउल में को हुए प्याज लेंगे उसमें बारीक को हुई हरी मिर्च , हरा धनिया , नमकीन , नमक,लाल मिर्च ,गरम मसाला और सौंफ डाल कर मिलाएंगे।\n\n•गुथे हुए जाते को लोइया बना कर उसे थोडा ब्रेल लेंगे उसके बाद उसमें पराठे को तैयार फिलिंग क्रो भर देंगे । अब हम उसे हलके हाथ से खेल लेंगे ।\n\n• इसके बाद इसे गरम तवे एर डालकर घी या तेल से दोनों तरफ से स्नेक लेंगे ।\n\n•इस तरह हमारा प्याज का पराठा तैयार है ।\n\n•आटा दस्पे टवी सॉस ओर धनिया न्टान्ननी के साथ सर्व कर सकते है \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p3);
                       txt = ("•गोभी - 350 गाम\n•गेहूं का आटा - 400 ग्राम या चार छोटी कटोरी\n•जीरा - एक चौथाई छोटी चम्मच\n• धनियाँ पाउडर - एक चम्मच\n•मिर्च पाउडर - एक चौथाई छोटी चम्मच\n•गरम मसाला --------- -- एक चौथाई छोटी चम्मच\n•हरी मिर्च ---------- -- 2 या 3 बारीक कटी हुई \n• अदरक ---------- -- बारीक कटी हुई \n•हरा धनियाँ - एक टेबिल स्मृन ( बारीक कटा हुआ )\n• नमक - स्वादानुसार\n•तेल या घी - परांठे सेकने के लिये ( 100 ग्राम )");
                        txt2 = ("•सचसे पहले आटे में एक  स्पून  तेल ओर आधी छोटी चम्मच नमक मिला दीजिये. इन्हें अच्छी  तरह मिलाइये और पानी की  सहायता से नरम आटा  गूथ लीजिये. गूथे हुये आटे  को आधा  घंटे के लिये ढक कर रख दीजिये.\n\n•फूल गोभी के पत्ते हटा कर गोभी के बडे टुकडे करके अच्छी  तरह धो लीजिये. धोने  के बाद इन डुकडों क्रो कहूकस कर कीजिये. आप  इसे फूड प्रोसेसर को सहायता से भी बारीक चूरा बना सकते हैं.आटे  से लोई तोड़िये   और करीब 4 इंच व्यास में बेल  लीजिये. एक बड़ी  चम्मच  गोभी उस एर रखिये उसे चारों और से मोड़कर बन्द कर दीजिये. अब इस पिट्ठी की भरी हुई लोई लो क्रो हथेली से सहायता से दबाकर चपटा करके थोडा सा बडा कर लें. ( अगर ऐसा  नहीं करेंगे तो खेलते वक्त आपका परांठा फट सकता है ) . अब बेलन को सहायता से 6 या 7 इंच व्यास में परांठा बेल  लीजिये. इस बेले हुये परांठे क्रो तबे एर डाल कर दोनों और से तेल लगाकर ब्राउन होने तक खस्ता सेखिये. इसी तरह से सारे पराठे बना लीजिये.\n\n• आपके गोभी के पराठे तैयार हैं. गरमा गरम गोभी के परांठे, आलू मटर की सब्जी , दही, चटनी और मक्खन के साथ परोसिये एवं खाइये\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p4);
                       txt = ("•गेहू का आटा -300 ग्राम\n• पनीर  - 200 ग्राम\n•हरी मिर्च - 2 ( बारीक कतरी हुई)\n• अदरक - 1 इंच लम्बा टुकडा (कदूकस क्रिया हुआ )\n•हरा धनियां - एक बडा चम्मच( बारीक कतरी हुदा)\n•धनियां पाउडर - एक छोटी चम्मच nलाल मिर्च पाउडर - एक चौथाई छोटी चम्मच से भी साधा\n•नमक - स्वादानुसार\n•तेल या घी");
                        txt2 = ("•आटे  क्रो छान कर एक बर्तन में निकाल लीजिये. आटे में आधा छोटी चम्मच नमक, और 2 छोटी चम्मच तेल डाल गुनगुने यानी को सहायता से नरम आटा  गूथ ली लीजिये \n\n• पनीर  क्रो कहूकस कर लीजिये. हरी मिर्च, अदरक, हरा धनियां, धनियां पाउडर, लालमिर्च पाउडर और नमक मिला दीजिये. यह पनीर की पिट्ठी मे में भरने के लिये तैयार हैं.\n\n•तवा गैस पर  रख कर गरम करिये. जाते से थोडा सा आटा  छोडिये, (एक नीब्रू के बराबर) गोल करके लोई बनाइये.लोई क्रो सूरब्रे आटा  (परोथन) में लगाकर 3 इंच व्यास में गोल बेल लीजिये.\n\n• 2 छोटे चम्मच पनीर की  पिट्ठी से निकाल कर खेल गये परांठे पर रखिये. परांठे क्रो चारों आर से उठा कर पनीर की पिट्ठी मे बन्द कर दीजिये. इस पनीर भरे हुये गोले क्रो हथेली और उगलियाँ को सहायता से बडा लीजिये, इसे चकलोई बनाना कहते हैं. चकलोईं क्रो परोथन को सहायता से 6-7 इंच के व्यास में गोल खेल लीजिये. खेल हुये परांठे क्रो गरम तवे पर डालिये. दोनों और घी लगा व्य, पलट पलट कर ब्राउन होने तक सेकिये . परांठे क्रो तवे से उठा कर प्लेट में किचन नैपकिन घेपर बिछा कर रखिये. सारे परांठे इसी तरह तैयार कर लीजिये.\n\n•पनीर के गरमा गरम  परांठे, आइये  मटर को सटजी, रायता, चटनी और अपने मन पसन्द सटजी के साथ परोसिये और खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p5);
                       txt = ("•२ कप कसा हुआ एमीर\n• हु २ कप्र बारीक को हुई हरी प्याज (सफेद भाग औरण )० ३ /४ कप गेहूं का जाता\n• है /२ टीं-रयून हरी मिर्च का पेस्ट\n• नमक और ताजी पिसी काली मिर्च स्वादअनुसार\n• गेहूं का जाता , बेलने के लिए\n• २ टीं-म्पून तेल , उठाने के लिए");
                        txt2 = ("• सभी सामग्री क्रो एक गहरे बाउल में मिलाकर, ज़रुरत हो उतने पानी  का प्रयोग कर नरम आटा  गूँथ लें ।\n\n• आटे  क्रो ८ बराबर भाग में बत्गुत्श्चि, थोडे सूरब्रे जाते का प्रयोग व्य, प्रत्येक भाग क्रो है २ प मिमी  व्यास के गोल जाकर में खेल ले ।\n\n• एक संनि-ष्टित्प्त तवा गरम करें और प्रत्येक प्रराठे को, है /४टी-ररदुट्टा तेल का प्रयोग व्य, दोनो तरफ से सुनहरा होने तक एका ।\n\n• प्रराठों क्रो पुरी तरह ठंडा कर लें और एल्यूमिनियम फॉयल में लपेटकर टिफिन बॉक्समेँ डाल दें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p6);
                       txt = ("•पिक्तंजा परांठे के लिये जाता लगाने के लिये:\n•मैदा - 2 कप\n•नमक - 1 /2 छोटा चम्मच\nतेल - 2 टेबल म्पून\n•चीनी - 1 छोटी चम्मच\n• ड्राई एक्टिव यीस्ट - 1 छोटी चम्मच स्टफिग के लिये:\nबन्द गोभी - 1 व्य, बारीक कटा हुआ\n•शिंमला मिर्च - 1 (बारीक कटा हुदा)\n•बेबी कार्न - 2-3 बारीक को हुये\n•हरा धनियां -2- 3 टेबल स्मृन\n•मोजेरिला चीज - 50 ग्राम (कहूकस क्रिया हुआ 3/4 व्य)\n• काली मिर्च - 1 /4 छोटी चम्मच से कम\n• नमक - 1 /4 छोटी चम्मच (स्वादानुसार)\n• अदरक - साधा इंच कडा, घेस्ट बना लीजिये\n•हरी मिर्च - 1 छोटी , बीज हटा कर बारीक काट लीजिये(यदि जाए चाहें)हैं.;\n•  घी… 2-3 टेबल म्पून, पिजजा परांठे एर लगाने के ");
                        txt2 = ("•मैदा क्रो किसी बर्तन में निकल लीजिये, नमक, चीनी, तेल और एक्टिव डाई यीस्ट डालकर मिक्स होने तक मिला लीजिये. गुनगुने यानी को सहायता से एकदम नरम चपाती के जाते जैसा जाता गूथिये, गुंथे जाते क्रो 5-6 मिनिट तक मसल मसल कर एकदम चिकना होने तक गूथ लीजिये, इतना जाता गूथने में 3/4 कप यानी लगा हैं. थे जाते एर नेल लगाकर ढककर 2 घंटे के लिये रख  जाता उबल जाकर में फूल कर तैयार हो जायेगा.\n\n•पिक्तंजा परांठे के लिये स्टफिग तैयार कर लीजिये-किसी बडे प्याले में बारीक कटा हुआ पत्ता गोभी, बारीक को शिमला मिर्च, बारीक को बेबी कार्न, और मोजेरिला चीज क्रो कहूकस मिक्स कर लीजिये, सारे दुनिदुहूँपेभी मिला कर सारी चीजें मिक्स करने तक मिला\n\n•पिक्तंजा परांठा बनाना शुरु करने हैं;-पिक्तंजा परांठे बनाने के लिये, स्टफिग क्रो 2 भागों में बांट लीजिय.आटे क्रो पंच करके, थोडा मसल लीजिये, अबजाते को 2 भागों में बांट लीजिये. आटे के 1 भाग क्रो सूखे आटे में लणेट व्य, 4-5 इंच के व्यास में बडा कर लीजिये.स्टफिग का 1 आप खेल गये परांठे के ऊपर रख लीजियेतवे क्रो गैस एर गरम होने के लिये रख दीजिये, तवा गरम हो गया है, तवे एर थोडा सा तेल लगाकर चारों और फैला लीजिये. बेला गया परांठा तवे एर डालिये और धीमी जाग एर परांठे क्रो 2 मिनिट तक नीचली सतह एर स्नेक लीजिये, ऊपर को सतह एर तेल लगा दीजिये और परांठे क्रो पलट दीजिये. इस सतह एर तेल थोडा सा तेल डालकर चारों और फैला दीजिये. पिजजा परांठे क्रो धीमी जाग पर दोंनो और ब्राउन चित्रों जाने तक पलट पलट व्य, स्नेक लीजिये.पिजजा परांठा बीच से ब्रेड को तरह सांज और दोनों और से क्रिस्प हो कर तैयार है. दोंनो परांठे इसी तरह स्नेक कर तैयार कर लीजिये.\n\n•बहुत ही स्वादिष्ट पिक्तंजा परांठे तैयार हैं. पिक्तंजा परांठे क्रो टमाटो सास, मस्टर्ड सास औम या चटनी के साथ परोसिये और खाइये.बन्टचों के लिये जि-प्रजा परांठा प्रन में बना कर दीजिये उन्हें ये परांठा अपने टिफिन में बहुत पसन्द जायेगा\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p7);
                       txt = ("• बाजरे का आटा-1 कप\n•गेहूं का आटा - आधा कप \n•पालक  - 1 कप (बारीक कटा  हुआ )\n•तेल - 2-3 टेबल स्पून \n• नमक - 1 की छोटी चम्मच (स्वादानुसार)\n•हरी मिर्च - 1 बारीक कटी हुई\n•अदरक - आधा  इंच टुकडा (कद्दूकस  क्किया हुआ  )\n•जीरा या अजवायन … 1 /4 छोटी चम्मच\n•हरा धनियां - 2 टेबल स्पून  (बारीक कटा हुआ)");
                        txt2 = ("•किसी डोंगे में बाजरे का आटा  और गेहूं का आटा छान कर निकाल लीजिये,\n\n• आटा में 2 छोटे चम्मच तेल, नमक, हरी मिर्च, पालक, हरा धनिया , अदरक और जीरा कस करके डालकर अच्छी  तरह मिलाइये.\n\n•गरम पानी को सहायता से नरम आटा गूंथ कर तैयार कर लीजिये, इतना आटा गूथने में आधा  कप से थोडा अघिक पानी  लगा है गुंथे आटे  क्रो ढककर आधा घंटे के लिये रख देंगे ताकि आटा फूल कर सैट हो जाय.परांठे बनाने के लिये आटा तैयार हे. तबा गैस पर रखकर गरम कीजिये. गुंथे हुये आटे  से थोडा सा आटा  तोड़ कर गोल लोई तैयार दिजिये, लोई क्रो सूखे आटे मे लपेटिये  और 4-5 इंच के व्यास में बेल  लीजिये, बेले हुये परांठे पर  थोडा सा तेल डाल कर चारों ओर  फैला लीजिये परांठा क्रो आधा  मोड़ लीजिये और थोडा सा तेल डालकर सारी सतह पर फैला दीजिये, परांठे क्रो फिर से आधा  मोड़कर त्रिभुजाकार कर लीजिये, हाथ से दबाकर सूखे  आटे  में लपेट  कर त्रिभुजाकार परांठा बेलिये, परांठे क्रो थोडा मोटा ही रखेंगे, परांठा पतला होने एर टूट सकता हैं.\n\n•गरम तवे एर एक छोटी चम्मच तेल डालकर चारों और फैलाइये. बेला हुआ परांठा साबधानी से उठाकर गरम तवे पर डालिये, परांठे क्रो निचली सतह सिलने एर पलिटिये और दूसरी सतह सिलने एर इस सतह पर भी  थोडा सा तेल डालकर चारों और फैलाइये, परांठे क्रो पलटिये  और दूसरी सतह एर भी तेल डालकर फैलाइये, परांठे क्रो पलट पलट कर दोनों ओर ब्राउन होने तक सेकिये .\n\n•सिका हुआ पराठा  तवे से उतार कर किसी प्लेट में प्याली रखकर या फोइल बिछाकर रखिये. सारे परांठे इसी तरह सेक  कर तैयार कर लीजिये. इतने आटे  से 6 परांठे बनकर तैयार हो जायेगे\n\n•बाजरां के परांठे किसी गाढी दाल या अपनी  मन पसन्द सटजी, चटनी अचार के साथ परोसिये और खाइये\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p8);
                       txt = ("•2 कप गेहूं का आटा\n•1/2 वम्मव जीरा\n• 2 चम्मचव तेल\n•नमक- स्वामदअनुसार\n•1/2 चम्मच लाल मिर्च पाउडर\n•यानीभरने के लिये सामग्री---\n•4 उबले आलू\n•1/2 कप घिसी चीज\\n•4 हरी मिर्च, बारीक कटी\n•1 /2 चम्मच हल्दीक पावडर\n• 1 /2 चम्मच गरम मसाला पावडर\n•2 चम्मच ताजी हरी धनिया\n•नमक- स्वामदअनुसार");
                        txt2 = ("• एक बड़े  कटोरे में आटे की  सारी सामग्री क्रो मिक्से कर के उसे पानी मिला कर गूथ लीजिये। फिर आटे क्रो किनारे रख दीजिये। अब  एक ओर चीज क्रो घिस कर रख लीजिये।\n\n• आलू क्रो छील कर मैश कर के अलग कटोरे में रखें ।\n\n• कटोरे में नमक, हरी मिर्च, हल्दीक और गरम मसाला पावडर मिक्सर करे ।अव पराठा बनाने को तैयारी करे।\n\n• आटे  से छोटी लोई ले कर उसे थोडा सा बेलें और उसके अदंर 1 चम्मच  आलू भरें ।\n\n• उप्पर  से घिसी हुई चीज डाल कर आटे को सील कर दें ।\n\n• जब तवे क्रो गरम करे, उसमें बेले गए पराठे को डालें और तेल लगा कर सेके।\n\n•पराठे  क्रो अच्छी तरह से दोनों और गोल  ब्राउन होने तक सेके  \n\n•आपका आलू  चीज पराठा तैयार हैं \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p9);
                       txt = ("•गेहूं का आटा - 2 कप\n• धुली मूंग दाल - आधा  कप\n•नमक - आधा छोटी चम्मच\n•धनियां पाउडर - आधा छोटी चम्मच\n•लाल मिर्च पाउडर … 1 /4 छोटी चम्मच\n• अदरक - 1 इंच टूकड़ा, कद्दूकस क्रिया हुआ\n•जीरा - आधा छोटी चम्मच\n•हींग  - 1 -2 पिंच\n•गरम मसाला … 1 /4 छोटी चम्मच\n•हरा धनियां - 2-3 टेबल स्पून \n•तेल परांठे में तेल डालने के लिये और आटे में डालकर गूंथने के लिए ");
                        txt2 = ("•मूंग की  दाल धोकर, 2 घंटे पहले  भिगो दीजिये. दाल से अतिरिक्त पानी हटा कर दाल क्रो हल्की दरदरी पीस लीजिये .\n\n• आटे क्रो किसी डोंगे में निकालिये, मूंग को पिसी दाल आटे में डालिये, नमक, धनियां पाउडर, लाल मिर्च पाउडर, अदरक, जीरा, हींग, गरम मसाला, हरा धनियां और 2 छोटे चम्मच तेल डालिये और सबके मिलने तक हाथ से मिला लीजिये. आटे क्रो लगाने के लिये बहुत ही कम पानी  को  आवश्यकता होगी, पानी  की  सहायता से नरम आटा  गूथ कर तैयार कीजिये. गुंथे आटे  क्रो सैट होने के लिये 20 मिनिट के लिये ढककर रख दीजिये\n\n• अब हाथ एर थोडा सा तेल लगाकर आटे  क्रो मल मल कर चिकना कीजिये, परांठे बनाने के लिये आटा  तैयार है.\n\n•तवा गैस पर  रख कर गरम कीजिये गुंथे आटे  से एक मीडियम आकार  के अमरूद के बराबर आटा  निकालिये और गोल लोई बनाइये. लोई क्रो सूखे  आटे  में लपेटिये  और प्याले पर  बेलन की  सहायता से गोल 7-8 इंच के व्यास में बोलिये, बेले  गये पराँठे के ऊपर थोडा सा तेल डालकर फैलाइये, परांठे क्रो आधा  मोड़ते हुये मोडिये. आधे मुड़े परांठे एर थोडा तेल डालकर सारे तरफ फैलाइये और फिर से साधा मोड़कर डबल कर दीजिये, इस तरह त्रिभुज आकार  को लोई बना  कर तैयार हो जाती  हैं, लोई क्रो परोथन में लपटिये  और त्रिभुज आकार बना  का परांठा बना लीजिये.\n\n•बेले गये परांठे क्रो तवे पर  डालिये और दोनों ओर तेल लगाकर,पलट कर , अच्छी  ब्राउन चित्ती जाने तक स्नेकिये.सारे परांठे इसी तरह सेक  कर तैयार कर लीजिये.\n\n•मूंगदाल मसाला परांठे तैयार है, गरमा गरम मूंग दाला मसाला परांठे को दही चटनी के साथ परोसिये \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p10);
                       txt = ("•गेहूँ का आटा 2 कप\n•4 छोटी मूलियाँ कदूकस कटी हुई\n• 2 छोटी हरी मिर्च बारीक कटी हुई\n• 1 बडा चम्मच हरा धनिया बारीक कतरा हुआ\n• 1 चुटकी चाट मसाला\n• नमक स्वादानुसार\n• आधा  कटोरी तेल या घी");
                        txt2 = ("•एक बड़ी थाली में आटा ले उसमें नमक, एक चम्मच तेल डालकर नर्म गूँथे और गीले कपडे से ढ़क  कर आधे घंटे के लिए रख दे.\n\n•मूली को कदूकस कर ले कदूकस की  हुई मूली को दबा दबा कर सारा यानी निकल दें\n\n•अब मूली में धनिया, नमक हरी मिर्च ओर चाट मसाला मिलाएँ\n\n• आटे को छोटी छोटी लोइयाँ बनाएं ओर मूली को भी उसी हिसाब से बराबर भागी में बाट ले.\n\n•लोई को फैलाएँ उसमें मूली बाला मसाला भरें ओर हाथों से हल्का दबाकर मूली वाले मसाले को लोई में बराबर फैलाते हुए उसे चपटा कर लें\n\n•हल्के हाथ से गोल रोटी के आकार का बेलें\n\n•गरम तवे पर डाले और दोनों तरफ से तेल या घी लगाते हुए गुलाबी सेके\\n\n•चटनी ,अचार या रायते के साथ गरमा गरम परोसे \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p11);
                       txt = ("•पालक की पत्तियाँ 2 कप\n•हरी मिर्च बारीक कटी  2-3\n•गेहूं का आटा 4 कप \n•हींग 1 चुटकी\n•तेल या घी आधी कटोरी\n•स्वादानुसार नमक");
                        txt2 = ("•पालक क्रो साफ करके धो ले, नमक मिले यानी में डाल कर 2 मिनट तक उबालै\n\n•पानी से पालक क्रो निकाल कर ठंडा होने दे, पालक क्रो मिक्सर में डाल कर प्योर बना लें\n\n• एक बड़ी  थाली में आटा  ले उसमें पालक , हींग, नमक, दो चम्मच तेल या घी और बारीक  कटी हरी मिर्च  मिला दे\n\n•सारी सामग्री मिला कर आटा मूंध लें च ढक कर दस मिनट के लिए रख दें\n\n•तवा गरम करें तैयार आटे की  लोई बनाये पराठे के आकार का बेलकर , गरम तवे एर घी या तेल लगाकर दोनों तरफ से सेक ले .\n\n•आप चाहे  तो इसकी पूरी भी बना सकते हैं, पूरी को कढाई  मे तेल गरम करके छोटी छोटी पूरी के जाकर को बना के सेक ले .\n\n• गरमागरम पूरी या पराठा दही, आचार च चटनी के साथ परोसिये \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p12);
                       txt = ("•1 कप आटा\n•1 कप बेसन\n•1 बडा चम्मच कसूरी मेथी\n•2 बडे चम्मच हरा धनिया\n•1 छोटा चम्मच अजवायन\n•1 चम्मच अदरक का पेस्ट\n•1 छोटा चम्मच लाल मिर्च पाउडर\n•1 चुटक्री हींग -1/2 छोटा चम्मच जीरा\n•1 बडा चम्मच तेल \n•स्वादानुसार नमक\n•तेल पराठे सेकने के लिए");
                        txt2 = ("•किसी बड़ी आटा गूथने की थाली में आटा और बेसन मिला के छान ले पराठे रोकने का तेल  के सारी सामग्री मिला के मुलायम आटा गूँथ ले. आटे क्रो ढक के आधे घंटे के लिए रख दे जिससे आटा फूल के सेट हो जायेगा.\n\n• आटा से बराबर को 10-12 लोई बना ले \n\n•हर लोई में तेल लगा के मोड़ के पराठे को लोइया तैयार कर ले. फिर तिकोना या गोल जैसा भी चाहे पराठा बेल  ले.\n\n•तवा गरम कर और पराठा डाल के दोनों तरफ से तेल लगा के करारा  और सुनहरा होने तक सेक  ले.\n\n•इसी तरह से सारे पराठे सेक  ले, अचार या फिर दही के साथ पराठे खाए और खिलाये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p13);
                       txt = ("•गेहूं का आटा 2 कप\n•मकईं के दाने उबले हुए एक कप\n•प्याज एक बारीक कटा\n•हरी मिर्च 2 बारीक कटी हुई\n•स्वादानुसार नमक\n•हींग एक चुटकी\n•जीरा- 1 /2 चम्मच\n•चाट मसाला 1 /2 चम्मच\n•गरम मसाला 1 /2 चम्मच\n•तेल 1 /4 कप");
                        txt2 = ("•उबले हुए मकई के दानों क्रो मिक्सी मे बारीक पीस ले .\n\n•कढ़ाई  में एक चम्मच तेल गर्म करें, हींग  और जीरा डाले जीरा पकने के के बाद\n\n•बारीक कटा प्याज डाले, दो मिनट भूनने के बाद, हरी मिर्च और पिसा हुआ मकई का पेस्ट  डाल कर सूखा होने तक भूने\n\n•फिर चाट मसाला, गरम मसाला नमक भी मिला दे\n\n•आंच से उतार के ठंडा होने दे\n\n•आटे में नमक और 2 चम्मच नेल मिलकर गूंथ लें । आधा  घंटे के लिए गीले कपडे से ढक के रख दे\\n\n•इसक्री लोइयां बनाकर, मकई का भरावन  भरकर गोल रोटी के आकार  का बेले.\n\n•त्तवे कम गरम करके दोनों संस्था तैल लगाकर गुलाबी होने तक सेंके\n\n•इसे दही एवं अचार के साथ गरमा-गरम परोसे  \n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p14);
                       txt = ("•1/2 कप गेहूं का आटा\n•थोडा सा नमक… आटे में मिलाने के लिये\n•1/2 चम्मच  तेल\n भरावन वाली  सामग्री -\n•1/2 कप लो फैट पनीर \n•3/4 को टमाटर\n•1/4 कप पीली शिमला मिर्च\n•1 चम्मच कटी  हरी मिर्च\n•2 चम्मच धनिया\n•नमक- स्वादानुसार");
                        txt2 = ("सबसे पहले  पराठे के लिये आटा गूथेगें ।\n\n•सभी सामग्री को मिला कर आटे क्रो गूथ लें और 15 मिनट के लिये उसे ढ़क  कर रख दें ।\n\n•उसके बाद हथेलियों एर थोडा सा तेल लगाएं ओर फिर से आटे को मुलायम गूथ लें ।\n\n•भरावन को सभी सामग्रियों को एक साथ मिक्स कर के तैयार करें ।\n\n•फिर आटे  से 10 लोइयां काट कर किनारे रखें ।\n\n•फिर एक एक कर के मराठे बनाएं ।\n\n•पराठे  के अंदर केवल 1 या 2 चम्मच   ही पनीर  का मिश्रण भरें, नहीं तो वे फट जाएंगे ।\n\n•पराठे क्रो दोनों तरफ तेल लगा कर सेंके  ।\n\n•इसी तरह से सभी पराठे तैयार कर लें ओर गरमा गरम परोसे ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.p15);
                       txt = ("•चार कप (500 ग्राम) गेहूं का आटा\n• एक कप बेसन\n• बारीक को हुई 2 कप मेथी\n•लहसुन को कलियां 6 से 7 बारीक को कटी \n•3 हरी मिर्च बारीक कटी हुई\n•एक चम्मच अदरक बारीक कटा हुआ\n•एक छोटा चम्मच अजवायन\n•स्वादानुसार नमक\n•तेल");
                        txt2 = ("एक बर्तन में आटा और बेसन छान लें.\n\n•मेथी में अदरक, लहसुन और हरी मिर्च डालकर मिक्सर में पीसकर पेस्ट  तैयार कर लें.\n\n•अब आटे व बेसन में मेथी का पेस्ट और अजवायन डालकर नर्म मूंदें. आप  चाहें तो इसमें बारीक कटी हुई मेथी भी डाल सकते हैं.\n\n•इसके बाद आटे  से लोई बना कर तिकोने या गोल आकार  में परांठे बेल  लें.\n\n•गैस पर तवा  गर्म करें. फिर तेल डालकर तबा चिकना करें.अब इस पर परांठा सेके . परांठे क्रो पलटकर  उस पर तेल लगाएं और दूसरी तरफ से भी सेंक लें.\n\n•इसी तरह सारे परांठे सेक  लें. अब गर्मागर्म मेथी के परांठे चटनी, दही या आलू क्री सब्जी  के साथ परीसें.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                }

                break;
            }

            case "Chatni Receipes": {

                switch (Text3) {

                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c1);
                       txt = ("•कच्चे टमाटर - 4 (200 ग्राम  )\n•ताजा नारियल - 1/2 कप कदूकस किया हुआ\n•मूंगफली - 1/4 कप (भूनी हुई)\n•हरा धनिया - 1/2 कप (बारीक कटा हुआ)\n•तेल - 2 छोटी चम्मच\n•अदरक - 1 इंच\n•लाल मिर्च - 1\n•हरी मिर्च - 1\n•करी पत्ता - 7-8\n•उड़द दाल - 1/2 छोटी चम्मच\n•सरसों के दाने - 1 /2 छोटी चम्मच\n•लाल मिर्च पाउडर-1 पिंच\n•नमक - 1 छोटी चम्मच से कम या स्वादानुसार");
                        txt2 = ("•एक पैन में तेल लें, उसमें राई, कढ़ीपत्ता, लहसुन और अदरक डालकर भूनें।\n\n•टमाटर डालकर एक गाढ़ा पेस्ट तैयार कर लें।\n\n•लाल मिर्च पाउडर, काली मिर्च, नमक, चीनी और सिरका डालें।\n\n•अच्छे से भूनें, आपकी चटनी तैयार है।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c2);
                       txt = ("•कच्चे आम  - 500 ग्राम\n•चीनी - 500 ग्राम\n•अदरक पाउडर (सोंठ पाउडर) - 1 छोटी चम्मच\n•काला नमक - 1 /2 छोटी चम्मच\n•सादा नमक - 1 /2 छोटी चम्मच (स्वादानुसार)\n•गरम मसाला - आधा छोटी चम्मच\n•किशमिश - 1 टेबल स्पून ");
                        txt2 = ("•आम को धोइये, पानी सुखा कर छीलिय ,आम के गूदे को बडे बडे टुकडे काट लीजिये.\n\n•आम के टुकडे और आधा कप पानी डाल कर धीमी आग पर उबलने के लिये रखिये, जब आम के टुकडे नरम हो जाये तब आम को चमचे से मैस करके, चीनी और काला नमक,सादा नमक और अदरक पाउडर डाल कर पकाइये, चीनी पूरी तरह धुल जाय. आम और चीनी का गाड़ मिश्रण जैसा जाय तब तक चटनी को पकाइये, यदि चटनी गाडी लग रही हो तो आवश्य्कतानुसार पानी डालकर अच्छी तरह पका लीजिये, आग बन्द कर दीजिये. चटनी में गरम मसाला मिला दीजिये. अगर आपको चटनी में आम के रेशे दिखाईं दे रहे हों तो उसे मोटी छलनी में छान लीजिये  चटनी मे किसमिस डाल कर  मिलाइये किसमिस  1-2 घंटे मे फूल कर मोटे हो जाते है जो खाने मे बहुत ही स्वादिष्ट लगते है.\n\n•चटनी के ठंडा होने पर सूखे और साफ डिब्बे में भर कर रख लीजिये यह चटनी महीने से भी ज्यादा दिन तक रख कर प्रयोग में लायी  जा  सकती है आप इस चटनी को फ्रीजर में रख कर प्रयोग में लाए तोः साल भर बी ख़राब नहीं होगी.\n\n•जाम के टुकडे और साधा कप यानी डाल कर धीमी जाग एर उबलने के लिये रखिये, जब जाम के टुकडे नरम हो जांय तब जाम क्रो चमचे से मैस कर जाम और चीनी का गाडा मिश्रण जैसा जाय तब तक चटनी क्रो पकद्भाइये, यदि चटनी गाडी लग रही हो तो जादश्यवभीग्रनुसार यानी डालकर अन्टछी तरह एका लीजिये, जाग बन्द कर दीजिये. चटनी में गरम मसाला मिला दीजिये. अगर आपको चटनी में जाम के रेशे दिखाई दे रहे हों तो उसे मोटी छलनी में छान लीजिये. चटनी में किशमिश डाल कर मिलाइये. किशमिश 1 -2 घंटे में फूल कर मोटे हो जाते हैं जो खाने में बहुत ही स्वादिष्ट लगते हैं.\n\n•चटनी के ठंडा होने एर सूखे और साफ डिब्बे में भर कर रख लीजिये, यह चटनी महिने से भी ज्यादा दिन तक रख कर प्रयोग में लाई जा सकती हे. जाए इस चटनी क्रो फ्रीजर में रख कर प्रयोग में लाये तो साल भर भी खराब नही होगी.\n\n•जब भी आप आलू भल्ले दही बडे या कोई भी चाट बनाये  मीठी  चटनी ले साथ खाये \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c3);
                       txt = ("•आंवला - 250 ग्राम\n•गुड़ - 250 ग्राम\n• नमक - 1/2 छोटी चम्मच\n•काला नमक - 1 छोटी चम्मच\n•इलायची पाउडर - 1/2 छोटी चम्मच\n•लाल मिर्च पाउडर - 1/4छोटी चम्मच\n•गरम मसाला - 1 छोटी चम्मच");
                        txt2 = ("•किसी बर्तन में आंवले ओर 1/2 कप पानी डालकर उबलने के लिए गैस पर रख दीजिए आंवले को नरम होने तक पकाए.\n\n•आंवले 10-15 मिनिट में उबल कर तैयार हो जाते है, गैस बंद कर दिजिए और इन्हें प्याले में निकल लीजिए.आंवले के बीज हटा दीजिए और इन्हें मिक्सर जार में डालकर घेस्ट बना लीजिए.\n\n पिसे हुये आंवले को पैन में डाल दीजिए, गैस आन कर लीजिए, गुड़, नमक, काला नमक, इलायची पाउडर, लाल मिर्च पाउडर और गरम मसाला डाल कर मिला दीजिए और मिश्रण को धीमी आंच पर पकने दीजिए .इसे बीच बीच में चलाते रहे और अच्छा गाढ़ा होने तक पकाए.\n\n•चटनी बनकर तैयार हैं इसे चैक करने के लिए थोड़ी सी चटनी को प्याली में निकल कर देखें की वो बहे नहीं, सेट रहे. अगर सैट हैं तो चटनी बनकर तैयार हैं.\n\n•गैस बंद कर दीजिए और इसे प्याले में निकाल लीजिए.आंवले की मीठी स्वादिष्ट चटनी बनकर तैयार है, आप इसे परांठे, पूरी या ब्रेड पर जैम की तरह लगा कर के खा सकते\n\n• आंवला मीठी चटनी को जाए फ्रिज में रख कर के 3-4महीने तक खा सकते हैं और फ्रिज से बाहर रख कर के 1 माह तक खाने के लिए उपयोग कर सकते हैं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c4);

                       txt = ("•मूली - 2 (कद्दूकश कर लीजिये)\n•लाल मिर्च - 2\n•साबुत धनियां - 2 छोटी चम्मच \nराई - 2 छोटी चम्मच\n•जीरा - एक छोटी चम्मच\n•मैथी दाना - एक चौथाई छोटी चम्मच\n•करीं पत्ता - 18-20 पत्ते\n•इमली का पेस्ट - 2 छोटी चम्मच\n•तेल - 2 टेबल स्पून \n• नमक - स्वादानुसार ");
                        txt2 = ("•कढाई में एक छोटी चम्मच तेल डाल कर साबुत धनियां,एक छोटी चम्मच राई, जीरा, मैथी और को पत्ता को हल्का होने तक भूनिये ओर किसी प्याली में निकाल कर रखे \n\n•अब कढाई में एक छोटी चम्मच तेल डालिये ओर कद्दूकश की गई मूली डालकर 5 मिनिट तक भून कर पका लीजिये \n\n भूने मसाले ओर लाल मिर्च को मिक्सर में डाल कर बिना पानी डाले बारीक पीस लीजिये. इसी मसाले में मूली, इमली का पेस्ट ओर नमक डालिये और  आवश्यतानुसार पानी मिलाकर बारीक़ पीस  लीजिये  \n\n कढ़ाई में  बचा  हुआ  तेल डालिये  राई तड़कने के बाद  पिसी हुई चटनी डालिये और जब  तक पकाइये कि चटनी  के ऊपर  तेल  के तैरने दिखाई देने लगे \n\n लीजिये  दक्षिणी भारत में खाई जाने वाली मूली कि चटनी तैयार है \n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c5);
                       txt = ("•पुदीने के पत्ते - एक कप /nहरी मिर्च-2-3\n• दही या कच्चे आम के टुकडे - आधा कप\n• भूना हुआ जीरा - आधी छोटी चम्मच\n• काला नमक - आधा छोटी चम्मच\n•नमक - स्वादानुसार( आधा छोटी चम्मच)");
                        txt2 = ("•सबसे पहले पुदीने के पत्ते अच्छी तरह साफ करके धो लीजिये साथ ही साथ हरी मिर्च धोकर, उसके डंठल तोड़कर टुकडे कर लीजिये।\n\n•अब एक मिक्सर में पुदीने के पत्ते, हरी मिर्च, नमक, भूना हुआ जीरा ओर दही डालकर बारीक पीस लीजिये।\n\n•यदिं आप इस चटनी को कच्चे आम की खटाई के साथ बनाना चाहते हैं तो एक कच्चे आम को छील कर उसके टुकडे कर लीजिये और ये आम के टुकडे, पुदीना, हरी मिर्च,जीरा और नमक सभी को मिक्सर में डाल कर बारीक पीस लीजिये और फिर चटनी को मिक्सर में से प्याले में निकाल लीजिये ।\n\n•स्वादिष्ट पुदीना चटनी तैयार है । इस पुदीने की चटनी को आप लंच या डिनर या फिर समोसे, कचौडी या किसी के भी साथ परोसिये और खाईये । इस चटनी को आप फ्रिज में रखकर एक सप्ताह तक खा सकते हैं\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c6);
                       txt = ("•खजूर 1 कप बीज निकालके \n•लाल मिर्च पाउडरा 1चम्मच\n•गुड 1 चम्मच\n•धनिया पाउडर 1 चम्मच\n•जीरा पाउडरा 1 छोटा-चम्मच\n•काला नमक 1/2 छोटा-चम्मच\n•नमक स्वाद अनुसार");
                        txt2 = ("•खजूर को अच्छे से धोकर उनके बीज निकल दीजिये. इस रेसिपी के लिए मैंने बीज बिना के खजूर का उपयोग किया \n\n•इमली को भी धोकर बीज निकालले.\n\n•प्रेसर कुकर में खजूर इमली ले कर उसमें आधा कप पानी डालकर 5 मिनिट (2 सीटी) के लिए पका ले.\n\n•उबले हुए खजूर और इमली को मिक्सर ग्राइंडर में लेकर अच्छे से पीस ले .\n\nपिसे हुए खजूर इमली को छन्नी में निकलकर छान ले.\n\n•एक पतीले में छाने हुए खजूर इमली को लेकर 5 मिनिट तक थोडा पानी  डालकर पकने दे.\n\n•उबलते मिश्रण में मसाले डाल ले: लाल मिर्च पाउडर,धनिया पाउडर, जीरा पाउडर, काला नमक, गुड़ और स्वाद अनुसार नमक.\n\n•चटनी को और 5 मिनिट तक पकने दे.\n\n•खट्टी मीठी खजूर इमली की चटनी तैयार हैं\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c7);
                       txt = ("•इमली को मीठी चटनी\n•इमली 1 कप\n•चीनी या गुड़ -1 कप\n•काला नमक _ 3/4 छोटी चम्मच\n•सादा नमक - आधा छोटी चम्मच\n•किशमिश - 1 /4 कप\n•छुआरे - 5-6 ( बारीक लम्बे कतर लीजिये) यदि आप चाहें\n•गरम मसाला - एक छोटी चम्मच\n•लाल मिर्च - एक चौथाई छोटी चम्मच से कम\n•छोटीं इलाइची  4 - 5 ( छील कर पीस लें)");
                        txt2 = ("•एक बर्तन में इमली का पेस्ट, चीनी या गुड़ और 1 कप पानी मिला ली जिये. अब इमली और चीनी के घोल को छान कर, गैस पर उबालने के लिये रख दीजिये, घोल में उबाल जाने के बाद किशमिश और छुआरे डाल दीजिये, घोल को गाढा होने तक धीमी आग पर उबलने दीजिये, थोड़ी थोड़ी देर में चमचे से चलाते रहिये, ताकि वह तले में न लगे.\n\n•इमली के गाढे घोल में नमक, लाल मिर्च और गरम मसाला मिला कर 2 मिनिट और पका दीजिये, आग बन्द कर दीजिये, मीठी चटनी में पीसी हुई इलाइची मिला दीजिये.इमली की मीठी चटनी तैयार हैं. इमली की मीठी चटनी को दही वडा या किसी भी चाट या परांठे के साथ खा सकते हैं.\n\n•इमली की मीठी चटनी को किसी डिब्बे में भर कर अपने फ्रीजर में रख दीजिये और 1 साल तक कभी भी निकलिये ओर प्रयोग कीजिये.\n\n•इमली का पेस्ट बनाने के लिये: 1 कप इमली लीजिये और 2 कप पानी में रात भर भिगो दीजिये, उबालिये, मैस कीजिये और छलनी से छान लीजिये इमली का पेस्ट तैयार\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c8);
                       txt = ("•इमली को मीठी चटनी\n•इमली 1 कप\nचीनी या गुड़ -1 कप\n•काला नमक _ 3/4 छोटी चम्मच\n•सादा नमक - आधा छोटी चम्मच\n•किशमिश - 1 /4 कप\n•छुआरे - 5-6 ( बारीक लम्बे कतर लीजिये) यदि आप चाहें\nगरम मसाला - एक छोटी चम्मच\n•लाल मिर्च - एक चौथाई छोटी चम्मच से कम\n•छोटीं इलाइची  4 - 5 ( छील कर पीस लें)");
                        txt2 = ("•एक बर्तन में इमली का पेस्ट, चीनी या गुड़ और 1 कप पानी मिला ली जिये. अब इमली और चीनी के घोल को छान कर, गैस पर उबालने के लिये रख दीजिये, घोल में उबाल जाने के बाद किशमिश और छुआरे डाल दीजिये, घोल को गाढा होने तक धीमी आग पर उबलने दीजिये, थोड़ी थोड़ी देर में चमचे से चलाते रहिये, ताकि वह तले में न लगे.\n\n•इमली के गाढे घोल में नमक, लाल मिर्च और गरम मसाला मिला कर 2 मिनिट और पका दीजिये, आग बन्द कर दीजिये, मीठी चटनी में पीसी हुई इलाइची मिला दीजिये.इमली की मीठी चटनी तैयार हैं. इमली की मीठी चटनी को दही वडा या किसी भी चाट या परांठे के साथ खा सकते हैं.\n\n•इमली की मीठी चटनी को किसी डिब्बे में भर कर अपने फ्रीजर में रख दीजिये और 1 साल तक कभी भी निकलिये ओर प्रयोग कीजिये.\n\n•इमली का पेस्ट बनाने के लिये: 1 कप इमली लीजिये और 2 कप पानी में रात भर भिगो दीजिये, उबालिये, मैस कीजिये और छलनी से छान लीजिये इमली का पेस्ट तैयार\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c9);
                       txt = ("•लहसुन 1 कप , छिला हुआ\n•लाल मिर्च पाउडर 1/4 कप\n•धनिया पाउडर 1/2 कप\n•तेल2 चम्मच\n•नमक-2 छोटे-चम्मच या स्वाद अनुसार");
                        txt2 = ("•लहसुन की कलियों को छिल कर निकाल लीजिए. लहसुन छीलते समय उँगलियों पर थोडा तेल लगाने से लहसुन की गंध हाथ में नहीं लगेगी.\n\n•लहसुन की कलिया, नमक, धनिया पाउडर एक मूसल में लेकर दसतै से कूट लीजिये। आप मिक्सर ग्राइंडर या फ़ूड  प्रोसेसर का भी उपयोग कर सकते\n\n•अब कुटी लहसुन की चटनी में लाल मिर्च पाउडर और तेल डाले और वापसी कूट तो\n\n•लहसुन की चटनी तैयार है ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c10);
                       txt = ("•हरा धनियाँ- 100 ग्राम/nहरी मिर्च-3-4\n•गरम मसाला - एक छोटी चम्मच\n•अमचूर पाउडर - एक छोटी चम्मच या एक बडे नीबू का रस\n•नमक - स्वादानुसार");
                        txt2 = ("•ह्ररे धनिये और हरी मिर्च को साफ कर धो लें और मोटा मोटा काट लें. गरम मसाला, नीबू का रस या अमचूर पाउडर और नमक मिला दें और आधी छोटी कटोरी पानी डाल कर बारीक पीस लें. लीजिये हरे धनिये की चटनी तैयार हैं.\n\n•यह चटनी भी फ्रिज में रख कर 3-4 दिन तक खाई जा सकती हैं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c11);
                       txt = ("•1 मध्यम आकार की तोरी, छीलकर कटी हुई ।\n• आधा चम्मच राई\n•1 चम्मच उड़द दाल\n•1 चम्मच चना दाल\n•3 चम्मच कहूकस किया हुआ नारियल\n•4-5 हरी मिर्च\n•1 चम्मच नीब्रू या इमली का रस\n•1 चम्मच गुड या चीनी\n•7-8 करीपत्ते\n•1 चम्मच बारीक कटा हरा धनिया\n•चुटकी भर हींग\n•1 चम्मच तेल\n•नमक स्वादानुसार");
                        txt2 = ("•एक कढाई में तेल गरम करें ।\n\n राई डालें, राई तडकने  पर चना और  उरद दाल डाल कर भुने।\n\n•हरी मिर्च, करीपत्ते, हींग और तोरी के टुकडे डाल दें ।\n\n•तोरी गलने तक पकाए \n\n•ठंडा होने पर नमक, हींग, इमली का रस, गुड़ और धनिया मिला कर मिक्सी में पीस लें । पीसते समय ज़रूरत हो तो थोडा पानी डालें चपाती, चावल या डोसे के साथ परोसे ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c12);
                       txt = ("•करोंदे - 100 ग्राम \n•हरी मिर्च -3-4\n•कटा हुआ हरा धनिया - 50 ग्राम (1 कटोरी)\n•लालमिर्च - एक चौथाई छोटी चम्मच\n•हींग- 1 -2 चुटकी\n•नमक - स्वादानुसार");
                        txt2 = ("•करोंदे, हरी मिर्च, हरा धनिया धो कर साफ कर लीजिये।\n\n• धनिया मोटा-मोटा काट कर सभी चीजो को मिक्सी में डाल कर बारीक पीस लीजिये और बाउल में निकाल लीजिये।\n\n•करोंदे की चटनी तैयार हैं ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c13);
                       txt = ("•नारियल 1 /2कच्चा  \n•हरीमिर्च 2 से 3 \n• राई - 1 छोटी चम्मच ( या दही आदि छोटी कटोरी )\n•नींबू - 1 रस निकला हुआ\n• साबुत लाल मिर्च - 1\n• हरा धनिया - 1 /2 छोटी कटोरी\n• कड़ी पत्ता - 9 से 10\n•नमक - स्वादानुसार\n• तेल - 1 छोटी चम्मच\n•लालमिर्च - 1 /4 छोटी चम्मच");
                        txt2 = ("•कच्चे नारियल का छिलका हटा कर उसके छोटे छोटे टुकडे कर लीजिए ।\n\nनारियल, हरी मिर्च, हरा धनिया, नींबू का रस, नमक, लाल मिर्च और 3 छोटे चम्मच पानी डाल कर मिक्सी में बारीक पीस लीजिए । अगर आप को चटनी गाडी लग रही हो तो उसमें पानी और मिला लीजिए ।\n\n एक पैन में तेल डालिए जब तेल में से हल्का धुआँ उठने लगे तब उसमें राई डाले और चटकने दीजिये।\n\nकडी पत्ता और साबुत लाल मिर्च डालिए, उसके बाद मिक्सी में पीसी हुई चटनी डाल दीजिये। 1 मिनट के लिए पकने दीजिये ।\n\n नारियल की चटनी बन कर तैयार है ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c14);
                       txt = ("•आधा कप पुदीने की  पत्तियां\n•3 हरी मिर्च कटी हुई\n•एक चम्मच अदरक कटा हुआ (चाहें तो )\n•लहसुन की  4 से 5 कलियां छिली हुई (चाहें तो)\n• एक कप दही\nस्वादानुसार नमक");
                        txt2 = ("• एक मिक्सर जार में हरी मिर्च, पुदीने की पत्तियां, लहसुन और अदरक डालें.\n\n• अब इसे मिक्सी में ग्राइंड करके पेस्ट तैयार कर लें.\n\n• कटोरे में दही डालें. फिर इसमें पुदीने का पेस्ट और नमक डालकर फैट लें.\n\n तैयार हैं दही-पुदीने की चटनी  \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.c15);
                       txt = ("•2 बडे चम्मच सूखे अनार दाने\n• एक प्याज कटा हुआ\n• एक हरी मिर्च कटी हुई\n•एक बडा चम्मच हरी धनिया पत्ते कटे हुए\n• आधा बडा चम्मच पुदीना पत्ते कटे हुए\n• आधा छोटा चम्मच जीरा पाउडर\n• आधा छोटा चम्मच नींबू रस\n• आधा छोटा चम्मच चाट मसाला\n• एक छोटा चम्मच गुड़\n• स्वादानुसार नमक या काला नमक");
                        txt2 = ("• सबसे पहले आनारदाने पानी से अच्छी तरह धो लें.\n\nअब मिक्सर जार में आनारदाने, हरी धनिया, पुदीना पत्ते,प्याज, हरी मिर्च, नींबू रस, चाट मसाला, गुड़, जीरा पाउडर और नमक या काला नमक डालें.\n\nइसमें एक बडा चम्मच पानी डालकर जार का ढकन  लगाए  और इसे मिक्सी में पीसकर बारीक पेस् तैयार कर ले  \n\nलीजिए तैयार है अनारदाना को चटनी. अब इसे स्नैक्स या पराठों के साथ सर्व करें.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                }
                break;

            }

            case "Aachar Receipes": {

                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a1);
                       txt = ("•करोंदे 250 ग्राम  \nसरसों का तेल 1/3 की कप\n•हींग- 1 /4 छोटी चम्मच से आधा \n'हल्दी पाउडर - 1 छोटी चम्मच\n•सोंफ - 2 टेबल स्पून \n•जीरा - 1 छोटी चम्मच\n• अजवायन - 1 छोटी चम्मच\n'दाना मेथी - 2 छोटी चम्मच \n पीली सरसों - 3 छोटी चम्मच\n•नमक - 2 छोटी चम्मच\n•लाल मिर्च - 1 छोटी चम्मच");
                        txt2 = ("• करोंदे को  पानी से 2 बार धोकर साफ कर लीजिये. थाली या चलनी में रखकर पानी सुखा दीजिये. अब इन करोंदों को दो भागों में काट लीजिये, किसी करोंदे में यदि काला बीज हो तो उसे चाकू की सहायता से निकल दीजिये.\n\n•पीली सरसों, मेथी, अजवायन, जीरा और सौंफ को  कढाई में डालकर हल्का सा 1- 2 मिनिट चमचे से लगातार चलाते हुए हल्का सा रोस्ट कर लीजिये, इससे मसालों की नमी निकल जाती हैं और वह आसानी से पिस जाते हैं, अब मसालों को दरादरा पीस लीजिये\n\n•कढाई में तेल डाल कर , अच्छा  धुआं उठने तक गरम कर लीजिये. गैस बन्द कर दीजिये. गरम तेल में कटे हुये करोंदे ,हींग, हल्दी पाउडर डाल कर मिला दीजिये, अब इन करोंदों में दरदरे पिसे मसाले, नमक और लाल मिर्च डालकर अच्छी तरह मिला दीजिये. ये करोंदे का अचार बन गया हे. करोंदे का अचार को ठंडा होने के बाद, किसी कांच या प्लास्टिक के कन्टेनर में भर कर रख दीजिये.\n\n•यदि आप अचार को धूप में रख सके तो , अचार के डिब्बे को 4-5 दिनों तक धूप में रखिये और रोजाना अचार को दिन में एक बार चमचे को सहायता से ऊपर नीचे कर दीजिये.यदि आप धूप में नहीं रख सकते हें तो भी अचार को रोजाना ऊपर नीचे करने रहे और 3-4 दिन बाद, करोंदे के टुकडे मुलायम हो जायेंगे और करोंदे में सारे मसाले जब्ज हो जायेंगे .\n\n• साबुत करोंदे का अचार बनाइये: -\n\n•साबुत करोंदे का अचार बनाने के लिये करोंदे को काटना नहीं:, करोंदे अच्छी तरह धो कर पानी सुखा लीजिये .किसी बर्तन में इतना पानी भर कर उबलने रख दीजिये कि करोंदे पानी में अच्छी तरह डूब जायं, पानी में उबल जाने के बाद, करोंदे पानी में डालिये और करोंदों को ढककर 3मिनिट तक उबलने दीजिये.\n\n•करोंदों को छलनी में निकाल लीजिये, ताकि अतिरिक्त पानी करोंदों से नीचे निकल जाय.\n\n•कढाई में तेल डालकर गरम कीजिये, तेल को धुआं उठने तक अच्छा गरम कर लीजिये, गैस बन्द कर दीजिये और तेल को थोडा ठंडा होने दीजिये, अब तेल में हींग और हल्दी पाउडर डालिये, करोंदे भी डाल दीजिये, पिसे मसाले और लाल मिर्च डालकर मिला दीजिये, करोंदे का अचार तैयार है करोंदे का अचार 3-4 दिन बाद खाने के लिये तैयार हो जायेगा, तब तक करोंदे में सारे मसाले जब्ज हो जायेंगे, तब तक रोजाना चम्मच से अचार को ऊपर नीचे करते रहे, ताकि अचार में सारे मसाले अच्छी तरह मिलते रहे, अगर धूप है तो अचार को धूप में भी रखा जा सकता हे. अचार को 1 माह तक रख कर खाया जा सकता है .\n\n• अचार को साल भर तक रखने के लिये अचार में इतना सरसों का तेल गरम करके ठंडा करके डाल दे कि अचार तेल में डूबा रहे.\n\n•करोंदे अचार को आप जब चाहें निकाले और खायें. अचार निकालते समय हमेशा साफ और सूखे चम्मच का प्रयोग कीजिये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a2);
                       txt = ("• करेले - 500 ग्राम ( 7-8 मीडियम आकार के)\n•हींग पाउडर - 1 /4 छोटी चम्मच\n•जीरा - 2 छोटी चम्मच\n•मैथी - 2 छोटी चम्मच\n• अजवायन - 1 छोटी चम्मच\n•सोंफ - 2 चोटी चम्मच\n•राई या पीली सरसों - 4 छोटी चम्मच (पिसी हुई)\n•लाल मिर्च - 1 छोटी चम्मच\n• काला नमक - 1 छोटी चम्मच\n•सादा नमक - 3 छोटी चम्मच\n•गरम मसाला - 1 छोटी चम्मच\n•सरसों का तेल -100 ग्राम  ( 1/2 कप )\n•सिरका - 1 /4 कप या 2 नीबू का रस\n'हल्दी पाउडर - 1 छोटी चम्मच");
                        txt2 = ("•अच्छे लम्बे वाली किस्म के करेले बाजार से ले आइये .करेलों को साफ पानी से 2 बार धोइये, धुले करेले से चलनी या थाली में रख कर पानी को सुखाइये , डंठल काट कर अलग कर दीजिये, कोने को पतले पतले गोल कतरे काट कर बना लीजिये.\n\n•इन गोल कतरे कोने को 1 छोटी चम्मच नमक लगाकर किसी बर्तन में 1 /2 घंटे के लिये रख दीजिये, इस तरह करेले से कड़वा पानी निकल कर अलग हो जाता है करेले को अच्छी तरह 2 बार धो लीजिये, और कपडे पर रखकर हवा या धूप में सूखने दीजिये.\n\n•या करेले को उबलते पानी में डालिये और 5 मिनिट के लिये ढक कर रख दीजिये, करेलों को चलनी में डालिये और पानी निकाल दीजिये, साफ पानी से करेलों को अच्छी तरह धोइये, चलनी में डालकर अतिरिक्त पानी हटा दीजिये, करेले के टुकडों को हवा या धूप में 2 -3 घंटे के लिये धुले साफ कपडे पर फैला कर रख दीजिये ताकि इनका सारा पानी सूख जाय.\n\n•हींग, जीरा, मैथी दाने अजवायन और सौंफ को सूखा हल्का ब्राउन होने तक भून लीजिये, ये भूने मसाले और पीली सरसों को दरदरे पीस लीजिये.\n\n• अब करेले के टुकडे किसी सूखे साफ बर्तन में रखिये, भूने मसाले और बचे हुये सभी मसाले और नमक मिलाइये , तेल को अच्छी तरह गरम करके इन करेलों में मिलाइये, नीबू का रस निकाल कर डालिये और सारी सामग्री को चमचे से अच्छी तरह मिलाइये.\n\n• मसाले मिले करेले को किसी प्लास्टिक या कांच के साफ और सूखे कन्टेनर में भर कर रखिये, आप इस कन्टेनर को धूप में भी रख सकते हैं, चार दिन तक रोजाना अचार को सूखे चम्मच से चला कर ऊपर नीचे कीजिये, करेले का अचार खट्टा और सुगन्ध वाला तैयार हो गया हे. आप करेले के अचार को अपने लन्च या डिनर के साथ या नाश्ते में गरमा गरम परांठे के साथ खाइये और परोसिये यह बडा ही स्वादिष्ट बना हे.\n\nयह करेले का अचार 15-20 दिन तक खाया जा सकता है अधिक दिन तक अचार खाने के लिये आप यह अचार फ्रिज में रख सकते हैं या इस अचार में इतना सरसों का तेल डाल दीजिये कि अचार तेल में डूबा रहे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a3);
                       txt = ("•खजूर -आधा किलो \n•बूरा (पिसी हुई चीनी)-2 कप\n• अदरक चौथाई कप (कदूकस की हुई)\n•लाल मिर्च पाउडर- डेढ़ चम्मच\n•हल्दी पाउडर -1चम्मच\n•सौंफ पाउडर -2 चम्मच\n•जीरा पाउडर - 1चम्मच\n• नीब्रू का रस-2-3 चम्मच\n•नमक - स्वादानुसार");
                        txt2 = ("खजूर का अचार बनाने के लिए सबसे पहले हम एक बडे पैन में पानी उबाल लें और अब इस उबलें हुये पानी में खजूर को डाल दें, करीब 5-6 मिनट के बाद खजूर को पानी से निकाल कर एक प्लेट में रख लें और एक साफ़ कपडे से धुले हुए सभी खजूरों को अच्छी तरह से पोंछ कर साफ़ कर लें और सभी खजूरों की गुठलियां निकाल दें ।\n\n• अब एक बडी थाली या फिर ट्रे में सभी खजूर को निकाल कर रख लें और अब खजूर के ऊपर से सभी सामग्री जैसे-पिसी हुई चीनी, कदूकस किया हुआ अदरक, सौंफ पाउडर,हल्दी पाउडर, लाल मिर्च पाउडर, जीरा पाउडर, नींबू का रस और नमक को डालकर दोनों हाथों से खजूर के साथ अच्छी तरह से मिला दें ।\n\n•जब खजूर में सभी सामग्री अच्छी तरह से मिल जाये और सभी खजूरों के ऊपर मसाले की एक परत आ जाये तब खजूर के अचार का एक साफ काच या प्लास्टिक के कटेनर में भर कर रख लें और कटेनर को अच्छी तरह से बंद करके 4-5 दिन धूप में रखें और बीच बीच में कटेनर को हिलाते रहे जिससे अचार में सभी मसाला अच्छी तरह से मिल जाये ।करीब 5 दिन के बाद जाए स्वादिष्ट खजूर के अचार को खाने के साथ इस्तेमाल कर सकते है ।\n\n• स्वादिष्ट खजूर का अचार बनकर तैयार हो गया है ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a4);
                       txt = ("• आंवले - 500 ग्राम  \n•सरसों का तेल - 200 ग्राम  \n•हींग - 1 /4 छोटी चम्मच (पिसी हुई)\n•मैथी के दाने - 2 छोटी चम्मच\n• अजवायन - 1 छोटी चम्मच\n•नमक - 50 ग्राम (4 छोटे चम्मच)'\nहल्दी पाउडर - 2 छोटे चम्मच\n•लाल मिर्च पाउडर - 1 छोटा चम्मच से कम \nपीली सरसों - 4 छोटे चम्मच (मोटी मोटी पिसी हुई)\n•सोंफ पाउडर - 2 छोटे चम्मच");
                        txt2 = ("•बाजार से अच्छी किस्म के आंवले खरीद लाए और इन्हें घर लाकर साफ़ पानी में डालकर अच्छे से धो लें. एक बर्तन में 11 /2 कप पानी लेकर इसे उबलने के लिए रख दें. पानी में उबाल आने पर इसमें सारे आंवले डाल दें और गैस को धीमी कर दें. हमें आंवले को इतना नरम वरना हैं कि इनकी फांके की जा सके. जब आपको लगे कि आंवले इतने नरम हो गए हैं तो गैस बंद कर दें.\n\n• आंवले से सारा पानी हटा कर इन्हें ठंडा कर लें. जब ये ठन्डे हो जाएं तो इनकी फांके निकाल लें और गुठली अलग कर दे \n\n• एक कढाई में तेल डाल कर अच्छा गरम करें और फिर गैस बंद कर दें. इस तेल में हींग, मेथी के दाने और अजवायन डाल दें और चम्मच से हल्कऱ चलाते हुए भून लें. अब हल्दी पाउडर, सौंफ़ पाउडर, नमक, लाल मिर्च और पीली सरसों डाल कर सारे मसालों को चलाते हुए अच्छे से मिला लें.\n\n•तैयार मसालें में आंवले डालें और चलाते हुए मिलाए. आंवले का आचार बन कर तैयार हे.\n\n• आचार को अच्छे से ठंडा होने दें. ठंडा होने के बाद इसे\n\n•किसी कांच के कंटेनर में भर लें. 3-4 दिन तक इसे रोज़\n\n•साफ़ और सूखे चम्मच चलाकर ऊपर -नीचे ज़रूर करते रहे.\n\n• आप चाहें तो आंवले के आचार को अभी खा सकते हैं लेकिन 3-4 दिन में सारे मसालों का स्वाद इसमें भर जाएगा और आचार बेहद स्वादिष्ट हो जाएगा. अगर आप चाहते हैं कि ये आचार ज्यादा समय तक ठीक रहे तो आंवले को तेल में डुबा कर रखें.\n\n• आंवले का स्वादिष्ट आचार तैयार हे. जब भी आपका मन इसे खाने का को तो बस इसे कंटेनर से निकालें और खा लें.\n\n•ये आचार साल भर तक आराम से चलेगा\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a5);
                       txt = ("•1/2 किलो लहसुन की कलियां छिली हुई\n•25 ग्राम राई, दरदरी पिसी हुई\n•25 ग्राम मेथी दरदरा\n•15 ग्राम हल्दी पाउडर \n• 25 ग्राम नमक\n•25 ग्राम कलोंजी\n• 25 ग्राम सौंफ\n•25 ग्राम लाल मिर्च पाउडर\n 1/2 चम्मच अजवायन\n• 1 कप सरसों का तेल");
                        txt2 = ("•लहसुन को साफ पानी से धोकर एक घंटे के लिए धूप में सूखने के लिए फैला दें और इसे फिर मर्तबान में भर कर रख दे\n\n• अब तेल को किसी कड़ाही या कटोरे में तेज गरम कर लें.\n\n गरम तेल में राई, मेथी, सौंफ, कलोंजी व अजवायन डाल दे\n\n•इसके बाद जब तेल हल्का गुनगुना हो तो उसमें बाकी मसाले मिलाकर लहसुन वाले मर्तबान में डाल दें.\n\n•अब इस मर्तबान को अच्छी तरह से हिलाएं ताकि लहसुन मसाले में अच्छी तरह ये मिक्स हो जाए अचार के मर्तबान को सूती कपडे से ढककर एक हफ्ते तक रोज धूप में रखें और इसे हिलाएं ताकि अचार अच्छी तरह मिक्स होता रहे.\n\n• एक हफ्ते बाद अचार को चेक करें और फिर इसका इस्तेमाल करना शुरु कर सकते हैं. लहसुन का चटपटा अचार तैयार हैं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a6);
                       txt = ("• आधा किलो नींबू\n• आधा किलो शक्कर \n•1से 2 छोटी चम्मच काला नमक\n• एक छोटी चम्मच बडी इलाइची पाउडर \n•6 से 8 पिसी काली मिर्च\n• आधी छोटी चम्मच लाल मिर्च\n•4 से 5 चम्मच नमक");
                        txt2 = ("•1-1 नींबू को 4 टुकडों में काटकर उसमें नमक डालकर नर्म होने के लिए 25 दिन से 30 दिन के लिए एक जार में रख दें बीच-बीच में नींबू को चलाते और देखते रहे.\n\n• जब नींबू नर्म हो जाए तो नींबू मेँ शक्कर, काला नमक, काली मिर्च, लाल मिर्च और बडी इलाइची का पाउडर मिलाकर 3 से 4 दिन के लिए धूप में रख दें.\n\n• हर दिन साफ और सूरवे चम्मच से अचार को जरूर चलाए .\n\n•एक सप्ताह में नींबू का मीठा अचार अच्छे से बन जाएगा.\n\n•ध्यान रखें अचार को हमेशा साफ और सूरवे चम्मच से ही ले \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a7);
                       txt = ("•200 ग्राम अदरक\n•200 ग्राम नींबू\n•एक चम्मच भुनी अजवायन\n•एक छोटा चम्मच काला नमक\n1/4 छोटा चम्मच काली मिर्च पाउडर\n•एक छोटी चम्मच पिसी हींग \n•एक छोटा चम्मच नमक");
                        txt2 = ("•अदरक को धो कर छील लें और कद्दूकस कर लें.\n\n•नींबू का रस अदरक में निचोड़े.\n\n•अब अदरक में अजवायन, काला नमक, काली मिर्च पाउडर, नमक और हींग अच्छे से मिलाकर उसे 5 दिन के लिए रख दें साथ ही साथ अचार को एक साफ चम्मच से चलाते भी रहे.\n\n•15 से 20 दिनों में अदरक का अचार पूरी तरह बन जाएगा.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a8);
                       txt = ("•12-15 बड़ी ताज़ी लाल मिर्च \n•1 कप सरसों का तेल\n•1/2 चम्मच हींग\n-1/2 कप राई पाउडर\n•1/2 कप मेथी दाना पाउडर\n• 2 चम्मच सौंफ\n•1/4 कप नमक\n•1/4 कप अमचूर पाउडर\n• 1/2 चम्ममच हल्दी पाउडर");
                        txt2 = ("•लाल मिर्च की डंडी को निकाल लें और मिर्च में बीच से चीरा लगा कर उसके बीज निकल दें.\n\n•अब मसाला तैयार करने के लिए सबसे पहले सरसों के तेल को गर्म कर लें और फिर इसे बॉउल में भर कर किनारे रख दे\n\n• अब एक बडे कटोरे में हींग, राई पाउडर, मेथी पाउडर,सौंफ, नमक, अमचूर और हल्दी को अच्छी तरह मिला लें.\n\n• बाद में मसाले में 2 चम्मच ठंडा हो चुका सरसों का तेल मिला दें.\n\n•अब इस तैयार मसाले को मिर्च के अदंर भरें.\n\n•जब सभी मिर्च में मसाला भर जाए तो उन्हें एक-एक करके सरसों के तेल में डुबो कर कांच के एक जार में भरकर रख दे .\n\n• जार के अंदर बचा हुआ सरसों का तेल डालकर बंद करके धूप में कम से कम 1 हफ्ते के लिए रख दें.\n\n• एक हफ्ते बाद इसे खाने के साथ सर्व करें\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a9);
                       txt = ("•2 किलो टमाटर\n•50 ग्राम लहसुन\n•50 ग्राम हरी मोटी\n• 25 ग्राम मीठी नीम की पत्ती\n•100 ग्राम पिसी राई\n•50ग्राम  हल्दी पाउडर\n•25 ग्राम  लाल मिर्च पाउडर\n• 150 ग्राम चीनी\n• 2 बडे चम्मच सफेद  सिरका\n• 2 टी स्पून  हींग\n• नमक स्वादानुसार\n•150ग्राम सरसों का तेल");
                        txt2 = ("•टमाटर को धोकर कपडे में फैला कर पानी सूखा दें ।लहसुन का छिलका निकाल कर छोटा -छोटा काट कर एक बाउल में रख लें । अदरक का पीस लें । हरी मिर्च का डठंल निकल दें ।\n\n•अब गैस पर कढाई रखें । तेल डालें । जब तेल में धुआँ उठने लगे तो हींग ,साबुत  हरी मिर्च,बारीक कटा लहसुन ,पिसा हुआ  अदरक, और मीठी नीम को पत्ती डालकर भून लें ।अब इसमे बडे टुकडों कटा हुआ टमाटर डालकर 45 मिनट पका लें । उसके पश्चात टमाटर में पिसी हुई राई ,हल्दी पाउडर ,लाल मिर्च पाउडर, चीनी और नमक डालकर अच्छी तरह चलायें ।\n\n• अब गैस बंद करके सिरका डालें ।\n\n•टमाटर के मिश्रण को काँच के जार में पलट दें । दूसरे दिन से लगातार 5-7 दिन धूप में रखें\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a10);
                       txt = ("•हरी मिर्च अचार वाली - 250 ग्राम  \n•राई या काली सरसों - 4 टेबल स्पून \n• नमक - 3 छोटी चम्मच\n•जीरा - एक छोटी चम्मच\n•सोंफ - 1 छोटी चम्मच\n•मैथी - एक छोटी चम्मच\n•हींग - 1 /4 छोटी चम्मच से कम\n•हल्दी पाउडर - एक छोटी चम्मच\n•गरम मसाला - आधा छोटी चम्मच\n•नीबू का रस या सिरका - 2 (2 टेबल स्पून  रस)\nतेल - 4 टेबल स्पून  ");
                        txt2 = ("इस अचार को हम 2 तरीके से बनायेंगे\n\n•मिर्च को  भर कर .\n\n•मिर्च को छोटा छोटा काट कर .\n\n•हरी मिर्च अचार के लिये पकी हुई प्रयोग में लेते हैं. हरी मिर्च को अच्छी तरह धो लीजिये, सुखाइये डंठल तोडिये और साफ कपडे से पोंछ कर इस तरह ऊपर से नीचे तक चीरा लगाइये कि मिर्च एक तरह पूरी तरह जुडी रहे.\n\n•जीरा, मैथी, सौंफ और सरसों को गरम तवा पर डाल कर हल्का सा भून लीजिये कि मसालों की नमी दूर हो जाये मसाले को ठंडा होने पर मिक्सी से हल्कऱ दरदरा पीस कर लीजिये, हल्दी, गरम मसाला और नमक भी मिला लीजिये.मसाले को किसी प्याली में निकाल लीजिये\n\n•तेल को कढाई में डालकर अच्छा गरम कर लीजिये. गैस बन्द कर दीजिये, तेल को थोडा ठंडा होने के बाद हींग डाल दीजिये. भूने मसाले में नीबू का रस और तेल भी मिला दीजिये.\n\nएक एक मिर्च उठाइये और मसाला लीजिये, मिर्च के अन्दर मसाला भर कर किसी प्याले या प्लेट में रखते जाइये. सारी मिर्च इसी तरह भर कर तैयार कर लीजिये अब बचा हुआ तेल भी मिर्च के ऊपर डाल दीजिये.\n\nभरी हुई मिर्च को आप पतले कपडे से ढककर धुप में भी रख सकते हैं, यदि धूप न हो तो कमरे के अन्दर प्याले को रखिये. अचार को आप अभी भी खा सकते हैं लेकिन अचार का असली स्वाद 3 -4 दिन में तैयार हो कर मिलेगा, सारे मसाले मिर्च के अन्दर जज्व हो जायेंगे, अचार को रोजाना दिन में 1 - 2 बार सूखे और साफ चमचे से चलाकर ऊपर नीचे करते रहिये.\n\n•हरी मिर्च का राई वाला अचार तैयार है अचार को काच या चीनी मिट्ठी के कन्टेनर में भरकर रख लीजिये और आप जब भी खाना खाये कन्टेनर से हरी मिर्च का अचार निकालिये और खाइये\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a11);
                       txt = ("• 250 ग्राम आंबा हल्दी\n• 2-3 नींबू का रस\n•बाजार में तैयार मिलने वाला इंस्टेंट अचार मसाला\n•350 ग्राम तेल\n•नमक अगर मसाले में कम लगे तो जरूरतानुसार");
                        txt2 = ("• सबसे पहले आंबा हल्दी को धोकर, कपडे पर  सुखा लें.\n\n• इसके बाद उसमें नींबू रस व नमक मिलाकर कांच के जार में भरकर दो दिनों के लिए अलग से रख दें.\n\n•अब एक कढ़ाई या पतीले में तेल गर्म करके ठंडा कर लें.हल्दी भरे हुए जार में तेल और बाकि मसाले मिला कर अच्छे से मिक्स कर लें.\n\n•यह अचार करीब एक सप्ताह बाद इस्तेमाल करने लायक हो जाता है.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a12);
                       txt = ("• 500 ग्राम सफ़ेद प्याज\n• 2 छोटे चम्मच कलोंजी\n• 3 छोटे चम्मच पिसी हुई राई\n• 1 छोटा चम्मच नमक\n• 1 छोटा चम्मच लाल मिर्च पाउडर\n• 1 /2 छोटा चम्मच हल्दी पाउडर\n• 50 मिली सरसों का तेल");
                        txt2 = (" सबसे पहले प्याज को छीलकर इन्हें धो लें और कपडे में रखकर सुखा लें.\n\n• सूखे हुए प्याज में चार चीरा लगा दें, जिससे इसमें मसाला भरा जा सके .\n\n• अब एक कटोरी में सारे मसाले मिला लीजिए.\n\n• इस तैयार मसाले को प्याज में भरकर जार में रखें.\n\n• इसके बाद जार में सरसों का तेल डालें और 1-2 दिन के लिए धूप में रखें.\n\n• बस 2 दिन में ही ये अचार खाने के लिए तैयार हो जाएगा.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a13);
                       txt = (" 1 किलो पीले नींबू\n• 1 किलो शक्कर \n• 1 कटोरी राई\n• 1 कटोरी सरसों मिर्च 200 ग्राम \n• बड़ी इलायची 4\n• छोटीं इलायची 4\n• थीडी सी लोंग करीब 10\n•10 ग्राम  कालीमिर्च\n• 1 छोटा चम्मच मेथीदाना\n•  50 ग्राम  हल्दी पाउडर\n• थोड़ी -सी केसर काला  नमक 1 छोटा चम्मच\n• 2 चुटकी हींग पाउडर\n•  नमक स्वाद अनुसार");
                        txt2 = ("•1 किलो नींबुओँ का रस एक कांच के बर्तन में निकाल लें.\n\n• अब छिलकों में से अंदर के रेशे भी निकाल  दें व छिलकों के कैंची से बारीक-बारीक स्लाइस  काट लें.\n\n• अब इन छिलकों कों साफ पानी से धोकर प्रेशर कुकर में 1सीटी ले ले \n\n• अब इनको सूती कपड़ो पर पानी सुख जाने तक धूप मे सूखा लें. अब  निकले  हुए रस में इन छिलकों कों मिलाइए. सभी मसाले मिलाकर  हिलाइये. अब शक्कर मिला दीजिए और 15 दिन तक तेज़ धुप मे रखिए  और  रोज़  शक्कर  चलते रहिये  \n\n• जब शक्कर गाडी हो जाए तब यह अचार खाने लायक होगा \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a14);
                       txt = (" • आधा किलो गाजर\n•करीब पांच चम्मच पिसी हुई राई\n•1 चम्मच लाल मिर्च पाउडर\n•आधा चम्मच हल्दी\n•आधा चम्मच हींग\n•एक चम्मच नींबू का रस\n•सरसौं या जैतून का तेल\n•नमक स्वादानुसार");
                        txt2 = ("•गाजर को छीलकर उसे साफ कर लें. उसे दो-दो इंच लंबे टुकडों में काट लें.\n\n•इन टुकडों पर   लगा पानी अच्छी तरह सूख जाने दें. हो सके तो इसे एक दिन धूप दिखा लें. वरना अचार के खराब हो जाने को आशंका रहेगी.\n\n• जितनी भी सामग्री है उसे एक जार में गाजर के साथ मिलाकर  रख दें.\n\n•जार को सूरज को रोशनी में रख दें, अचार तैयार हो जाएगा. इसमें दो से तीन दिन लगेंगे.\n\n• आप  चाहें तो इसमें बीच से कटी हुई हरी मिर्च भी डाल सकते \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.a15);
                       txt = ("•1 किली छोटे-छोटे बिना गुठली वाले कच्चे आम  \n पानी  5 कप\n•पिसी लाल मिर्च 250 ग्राम\n•पिसी हल्दी दो चम्मच\n• हींग 5 ग्राम\n•सरसौं 200 ग्राम\n•200 ग्राम नारियल तेल\n•250 ग्राम नमक");
                        txt2 = ("•आमों को धोकर कपडे पर सुखा दीजिए.\n\n• नमक को पानी में घोलकर खूब उबालिए. ठंडा होने पर छानकर बर्तन में रखिए.\n\n•सारे आमों को इस बर्तन में डालिए. चार-पांच दिन ढंककर रखिए. दिन में एक-दी बार हिलाइए.\n\n• आम थोडे सिकुड़कर हरे से पीले हो जायेंगे इन्हें निकालकर कपडे पर सुखाइए.\n\n• नमक के पानी को  फिर से पांच मिनट उबालिए. ठंडा होने दीजिए. इस पानी से मिर्ची, हल्दी और हींग पीस लीजिए.सरसों अलग पीस लीजिए.\n\n• पिसे हुए दोनों मिश्रणों को आमों में मिलाकर  बर्तन में भर दीजिए. नारियल तेल गरम कर हींग डालने के बाद ठंडा करिए. महीन सूती  कपडा लेकर उसको चार तह कर तेल में डूबोकर अचार पर ढख दीजिये\n\n• तीन महीने बाद अचार का इस्तेमाल कीजिये तेल वाला कपडा हमेशा अचार पर ढका रहना\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                }
                break;
            }

            case "Salad Receipes": {

                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.s1);
                       txt = ("•फ्रेन्च बीन्स - 200 ग्राम\n•तिल - 2 टेबल स्पून \n•तिल का तेल - आधा टेबल स्पून \n•नमक - 1 /4 छोटी चम्मच");
                        txt2 = ("•बीन्स को अच्छे से धो लें. फिर इनकी एक तरफ़ के मोटे डंठल हटा दें लेकिन दूसरी तरफ के डंठल ना हटाएं ताकि इन्हें पकड़ कर मजे से खाया जा सके.\n\n•जो बीन्स ज़यादा लंबी लगें उन बीन्स को तिरछा और बराबर भागों में काट कर थोडी छोटी कर लें. अब इनमें आधा नमक डाल कर मिला दें ताकि भाप में बनाते समय इनका रंग खराब ना हो.\n\n• अब बारी हैं बीन्स को स्टीम करने की. नमक मिलाए बीन्स को 4-5 मिनट तक नरम होने के लिए स्टीम करें. इन्हें बस हल्के से नरम करें.\n\n• अब एक कढाई में तेल गर्म करके तिलों को हल्का सा भून लें और फिर तैयार बीन्स के साथ नमक डालकर मिला दें.इन्हें लगातार चलाते हुए 1 -2 मिनट के लिए भूनें. ओर फिर गैस से उतार लें.\n\n•टेस्टी-टेस्टी सलाद तैयार है. सलाद को प्लेट में निकल कर सलाद के पत्तो से सजाकर सर्व करें.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.s2);

                       txt = ("•3 कप उबली हुई स्वीनट कार्न 1/3 कप\n• बारीक कटे हरे पत्ते वाले प्याज\n•1/3 कप शिमला मिर्च क्यूब में कटी\n• 1/3 कप टमाटर क्यूब में कटी\n• नमक काली मिर्च पाउडर\n•1 छोटा चम्मच नीबू रस");
                        txt2 = ("•सभी सब्जियों को एक साथ मिला लीजिये।\n\n•इन पर नींबू का रस, काली मिर्च पाउडर और नमक छिड़कर सर्व कीजिये ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.s3);
                       txt = ("•मूली - 2-3\n•अदरक - 1 इंच लम्बा टुकडा\n• हरी मिर्च - 1-2\n•नीबू - आधा (एक छोटी चम्मच रस)\n•हरा धनिया - 1 टेबिल स्पून \n• भूना जीरा पाउडर - आधा छोटी चम्मच\n• नमक - स्वादानुसार( 1/3 छोटी चम्मच)");
                        txt2 = ("•मूली को धोइये, दोनो ओर से डंठल काटिये और कद्दूकस कर लीजिये.\n\n• अदरक को धोइये, छीलिंये ओर कद्दूकस कर लीजिये.\n\n• हरी मिर्च को धोइये, डंठल तोडिये और बारीक कतर लीजिये.\n\n• हरा धनिया के पत्ते तोड़िये, धोइये और बारीक कतर लीजिये.\n\n• कद्दूकस किया हुये मूली में अदरक, हरी-मिर्च , हरे धनिये ,नींबू का रस भुना हुआ जीरा और नमक डाले मूलीकस तैयार है मूलीकस प्याले मे भरिये और खाने के साथ परोसिये \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.s4);
                       txt = ("•500 ग्राम चुकंदर\n•500 ग्राम सादा दही\n• या 100 ग्राम ग्रीक योगर्ट\n•स्वाद के अनुसार नमक");
                        txt2 = ("• हालांकि इस सलाद को बनाना आसान है लेकिन इसकी तैयारी में काफी समय लग जाता है । लेकिन, यह बन बहुत आसानी से जाता है । दही लें और इसको महीन सूती कपडे में बांधकर सिंक के ऊपर लटका दें ताकि दही का सारा पानी टपककर निकल जाए और दही खूब गाढ़ा और कड़क हो जाए । आपकी दही के गाढ़ेपन के ऊपर निर्भर करेंगा कि इसको बनाने की प्रक्रिया में आधा घंटा लगेगा या एक घंटा ।अगर सादा दही इस्तेमाल कर रहे हैं तो यह खूब गाढा और कड़क होना चाहिए । आप चाहें तो ग्रीक योगर्ट भी इस्तेमाल कर सकते हैं क्योंकि यह काफी गाढा होता है । ग्रीक योगर्ट से इसे बहुत जल्दी तैयार किया जा सकता है ।\n\n• जब तक दही का पानी निचुड़ रहा है तब तक एक बर्तन में पानी डालकर उबलने के लिए रख दें ओर साथ ही धुले हुए चुकंदरों को भी इसमें डाल दें । इन्हें आधा घंटे तक उबालें । चुकंदर उबलकर मुलायम हो गए हैं या नहीं यह पता करने के लिए एक चुकंदर में चाकू की नोंक मारकर देखे: । अगर चाक़ू आराम से चकुंदर के भीतर जाकर बाहर आ जाता है तो समझो ये तैयार हो गए है \n\n•चकुंदरो को पानी से बाहर निकाल कर इनका छिलका उतार ले इन्हे कद्दूकस किये हुए चुकंदरों मे से निचुड़ा हुआ दही और नमक डालकर इसे अच्छी तरह से मिला ले चुकंदर का जायकेदार सलाद तैयार है \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.s5);
                       txt = ("•2 बड़े चम्मच कस्टर्ड पाउडर\n•1/2 लीटर दूध\n•4 बडे चम्मच चीनी (50 ग्राम)\n•2 कप फल कटे हुए (केला, सेब, अनार, पपीता, अंगूर, स्ट्रॉबेरी , कीवी )");
                        txt2 = ("•आधा कप हलके गरम दूध में कस्टर्ड पाउडर मिला के पेस्ट बनाले .\n\n•बाकी बचे हुए दूध को उबलने के लिए रख दे जब दूध उबलने लगे तो उसमें कस्टर्ड का पेस्ट और चीनी मिला के धीमी आंच पर लगातार चलाते हुए गाढा होने तक पका ले.\n\n• गैस बंद करके ठंडा होने दे. जब ठंडा हो जाये तो उसे फ्रिज में रख के ठंडा कर ले.\n\n• अच्छी तरह से ठंडा होने के बाद कस्टर्ड में कटे हुए फल मिला के ठंडा ठंडा फ्रूट कस्टर्ड तुरंत ही परोसे\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.s6);
                       txt = ("•सामग्री\n•पके हुए टमाटर- 500 ग्राम\n•नींबू- 1\n•हरा प्याज बारीक स्लाइस किए हुए- 3\n•बारीक कटा हरा धनिया- 1 बडा चम्मच\n• बारीक कटा पोदीना-1 बडा चम्मच");
                        txt2 = ("• एक बड़ा बाउल में स्लाइस किए हुए टमाटर डालें और उन पर चीनी छिड़कैं अब नींबू को लम्बा-लम्बा. काटे । आधा नींबू अलग रख दें ।\n\n•अब बारीक कटें नींबू को टमाटर के उपर डालें फिर इन पर हरा प्याज, हरा धनिया और मिट डालें।\n\n•अब आधे बचे नींबू को टमाटर पर नीचोडें । इस ढक कर फ्रिज में रख दें ।\n\n• कुछ देर बाद सर्व करें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.s7);
                       txt = ("•देशी चना- 100 ग्राम \n• गोद चना- 100 ग्राम \n•लोबिया- 100 ग्राम \n• मूंग -50 ग्राम \n• घी या मक्खन -एक छोटी चम्मच\n• भुने हुए मूंगफली के दाने - 50 ग्राम\n• खीरा -1 \n• टमाटर -1\n• नींबू का रस-एक छोटी चम्मच\n•काली मिर्च-एक चौथाई चम्मच\n• नमक स्वादानुसार\n• हरा धनियां बारीक कटा हुआ ।");
                        txt2 = ("• अंकुरित चने और लोबिया को एक कुकर  में नमक घी और आधा  कटोरी पानी डाल के मिलाएं और सीटी आने तक उबाल कर गैस बंद कर दें ।\n\n• अब चम्मच से कुकर में बनी आधी भाप निकाल दें ताकि चने और लोबिया ज्यादा ना पक जाएं ।\n\n•बाकी बची हल्की भाप जब कुकर से निकल जाए तो इसे खोलकर दानों को अलग बर्तन में निकाल लें अगर थोडा पानी बाकी हो तो उसे अलग निकाल कर सूप को तरह इस्तेमाल कर लें । ये पानी काफी ताकतवर होता हैं।\n\n•अब इन दानों में कटा टमाटर, खीरा, काली मिर्च, मूंगफली के  दाने और नींबू का रस डाल कर मिलाएं और प्लेट में सजा ले\n\n• सलाद तैयार हैं\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.s8);
                       txt = ("• लाल शिमला मिर्च-एक\n• पीली शिमला मिर्च-एक\n•टमाटर दो हिस्सों में कटे हुए-दस से पंद्रह\n•प्याज एक हरे प्याज की पत्तियां-एक बडा चम्मच\n•लहसून  के पत्ते-चार से पांच\n•कुटी हुई काली मिर्च-आधा छोटा चम्मच\n•नमक- स्वादानुसार\n•जैतून का तेल-दो बडे चम्मच\n•सिरका-एक बडा चम्मच\n•भुनी हुई मूंगफली-एक कप ।");
                        txt2 = ("•ओवन को 200 डिग्री सेल्सियस तक गरम करें । शिमला मिर्च चारों और फोर्क से चुभाएं । बेकिंग शीट पर रख गरम ओवन में 30 मिनट तक भूनें।\n\n• अब इन्हें कागज के लिफाफे में डाल बंद करके दस मिनट तक रखें । बडे बाउल में चेरी टॉमेटो, प्याज, हरे प्याज के पत्ते, लहसून  के पत्ते, कुटी काली मिर्च और नमक डालें ।\n\n• जैतून का तेल व सिरका डालें । शिमला मिर्च निकालें, छीलें और पतले स्ट्रिप्स  काट बाउल में बाकी सामग्री के साथ डाले \n\n• सलाद फ्रिज में एक घंटे तक रखेंभुनी मूंगफली डाल ठंडा ठंडा सर्वे करे \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.s9);
                       txt = ("•ओलिव आँयल- 1 /2 कप\n•रेड वाइन विनेगर- 1/2\n•कप लह्रसुन पाउडर- 11/2 छोटा चम्मच\n•तुलसी के पत्ते सूखे- 11/2कप\n• सूखे ओरिगैनो- 11 /2 कप\n•पिसी हुई काली मिर्च- 3/4\n•छोटा चम्मच चीनी- 3/4\n•छोटा चम्मच उबली हुई मैकरोनी- 2 1/2\n•कटे हुए मशरूम- 3 कप\n•चैरी और टमाटर कटे हुए- 15\n•रेड बैल पेपर - 1\n•कप क्रम्बल्ड चीज- 3/4 कप\n•कटे हुए हरे प्याज- 1 /2\n•कप ब्लेक ओलिवेज- 4 आउंस");
                        txt2 = ("•एक बडे बोल में ओलिव आँयल, विनेगर, लहसुन पाउडर ,तुलसी, ओरिगैनो, काली मिर्च और चीनी को मिला लें ।\n\n• इसमें उबले पास्ता, मशरूम, टमाटर, रेड पेपर, चीज ,हरे प्याज, ऑलिवज़ , मिलाएं । अच्छी तरह से मिक्स करें और इसे दो घंटे के लिए फ्रिज में रख दें और चिल्ड खाएं ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.s10);
                       txt = ("•केला\n•सेब \n•चीकू\n•तरबूज\n•खरबूजा\n• कीवी\n•आम\n•पपीता\n•संतरा\n•लीची,गाजर\n•खीरा आदि -तीन कप (मिले-जुले )\n• ताजा पोदीना-दो बडे चम्मच\n•शहद-दो छोटे चम्मच\n• नींब्रू का रस-दो छोटे चम्मच,\n• जैतून का तेल-एक छोटा चम्मच\n• नमक च काली मिर्च-स्वादानुसार ");
                        txt2 = ("•सबसे पहले सेब, तरबूज, गाजर, पपीता व खीरे के स्कूपर से गोल-गोल बॉल्स निकालें तथा शेष फलों को उनकी आवश्कतानुसार छीलकर काट लें ।\n\n•अब ड्रेसिंग बनाने के लिए एक अलग कटोरी में नींबू का रस, जैतून का तेल, शहद, नमक च काली मिर्च मिलाएं।\n\n•अब इस ड्रेसिंग को फलों में डालकर अच्छी तरह मिलाएं। तैयार हेल्दी सैलेड को  एयर टाइट लंच बाक्स में पेक करके दे  \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.s11);
                       txt = ("•बारीक कटी पत्ता गोभी- 2 कप\n•छोटे टुकडे किए हुए सेब -2 कप \n• बारीक कटे अजवायन के पत्ते - 2 कप \n•नमक स्वादानुसार\n•बारीक कटे शतपुष्प- 1 बडा चम्मच\n• दही- 1/4 कप \n• दूध- 2 छोटे चम्मच\n• पिसी हुई चीनी-, 1/2 छोटा चम्मच\n• नमक स्वादानुसार•");
                        txt2 = ("•दही दूध , चीनी, नमक और बारीक कटे शतपुष्प को एक बाउल डालें और अच्छी तरह से मिक्स कर लें।\n\n• इसे चिल होने के लिए फ्रिज में रख दें । बर्फ वाले ठन्डे पानी में पत्ता गोभी ओश्र अजवायन के पत्तो को आधे घंटे के लिए भिगो कर रख दें ।\n\n•इससे यह पत्ते ताज़े हो जाएंगे । अब तैयार ड्रेसिंग में पत्ता गोभी और अजवायन के पत्तो को डालें और अच्छी तरह से मिक्स कर लें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.s12);
                       txt = ("•भिगोई हुई मूंग दाल ,बिना छिलके वाली -1 /2 कप \n•कटी शिमला मिर्च 2 टी स्पून \n•घिसी गाजर 1 टी स्पून \n•कटा खीरा 2 टी स्पून\n•धनिया -2 टीस्पून \n•हरी मिर्च -1 \n•बारीक कटी प्याज - 1\n•ताजा घिसा नारियल- 2 टी स्पून\n• नींबू का रस- 2 टी स्पून\n•नमक- स्वाद अनुसार छौकने के लिये-\n•राई 1/2 टी स्पून\n•उरद दाल- 1/2 टी स्पून\n•लाल मिर्च- 2\n• तेल- 1/2\n•कडी पत्ती- 1 टीस्पून  \n•हींग- चुटकी भर");
                        txt2 = ("•एक बडे से कटोरे में सभी सामग्रियां मिक्सी कर दें ।\n\n• फिर ऊपर से इसमें राई वाला तड़का लगा दें ।\n\n• अगर आम का सीज़न चल रहा हो तो आप कच्चे आम से भी इसमें तड़का लगा सकती हैं ।\n\n•क्रोसांबरी कई सब्जियों के मिश्रण से भी तैयार किया जा सकता हैं जैसे, चुकंदर, पत्ता गोभी, मूली, टमाटर और कार्न आदि ।\n\n• आप चाहें तो इसमें दही भी मिक्स कर सकती हैं \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.facebook);
                       txt = ("• दही 2 कप\n• टमाटर 1/2 कप कटा हुआ\n•प्याज 1 /4 कप कटा हुआ\n•जीरा पाउडर 1 चम्मच\n• नमक स्वाद अनुसार");
                        txt2 = ("• एक बाउल में दही लेकर उसे अच्छे से फेट ले ।\n\n• बारीक कटा हुआ टमाटर और प्याज डाले और मिलाये।\n\n• अब जीरा पाउडर और नमक डाले और फेट ले ।\n\n• टमाटर प्याज का रायता तैयार है ।\n\n• दही रायता ठंडा या साधारण तापमान पे परोस सकते है ।यह रायता चावल के व्यंजन जैसे पुलओ (तवा पुलओ),बिरियानी वगैरा के साथ अच्छा लगता है\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.google1);
                       txt = ("•ककडी - 2 (100 ग्राम)\n•टमाटर - 2 (100 ग्राम)दही - 2 कप (500 ग्राम  )\n•तेल - 1 -2 छोटी चम्मच\n•पुदीना पत्ते -10-12\n•करी पत्ता- 10-12\n• हींग - 1 पिंच\n•हरी मिर्च - 1 (बारीक कटी हुई)\n• नमक - 1/4 छोटी चम्मच से कम या स्वादानुसार\n• काला नमक - 1/2 छोटी चम्मच या स्वादानुसार\n•जीरा - 1/2  छोटी चम्मच");
                        txt2 = ("•दही को अच्छी तरह फेट लीजिए. ककडी और टमाटर को अच्छे से धोकर सुखा कर डंठल हटा दें और बारीक काट कर तैयार कर लीजिए.\n\n• पुदीना के पत्ते और करी पतों को अच्छे से धोकर छोटा-छोटा काट लीजिये.\n\n•बारीक कटी ककड़ी और टमाटर को दही मे डालकर मिक्स कर दीजिये\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.google1);
                       txt = ("•दही 400 ग्राम  \n•पालक -200 ग्राम (कटा हुआ एक कप )\n•जीरा पाउडर -एक छोटी चम्मच\n•हरी मिर्च -1(छोटी छोटी काट लीजिये )\n•नमक 1/4 छोटी चम्मच\n•काला नमक - 1/4छोटी चम्मच");
                        txt2 = ("•पालक के पत्ते से डंडिया तोड दीजिये. पत्तो को 2 बार साफ पानी से धोइये, चलनी में रखकर पानी निकाल दीजिये और अब पालक के पत्तो को बारीक काट लीजिये. कटे हुये पत्तो को किसी बर्तन में एक बड़ी चम्मच पानी के साथ उबालने के लिये रख दीजिये. 5-7 मिनिट में पालक के पत्ते उबल कर नरम हो जाते हैं. ठंडा होने के बाद पत्तो से अतिरिक्त पानी निकाल दीजिये.\n\n• दही को फेट लीजिये. फैटे हुये दही में, पालक के पत्ते, जीरा पाउडर, हरी मिर्च और नमक मिला दीजिये. पालक का रायता तैयार हे.\n\n• पालक के रायते को प्याले में निकालिये, थोडा सा जीरा पाउडर ऊपर से डाल कर सजाइये, रायते को ठंडा होने के लिये फ्रिज में आधा घंटे के लिये रख दीजिये.\n\n•पालक का रायता इस तरह से भी बना सकते हैं छोटी कढाई में एक चम्मच घी या तेल डालिये और एक चौथाई छोटी चम्मच जीरा डाल कर तडकाइये, कटरी हुई हरी मिर्च डाल कर हल्का सा भूनिये और कटा हुआ पालक डाल कर मिलाइये, धीमी आग पर ढककर पालक को 3- 4मिनिट तक पकाइये.\n\n•फैटे हुये दही में पका हुआ पालक और नमक डाल कर मिला दीजिये. सजाने के लिये थोडा सा भुना  जीरा पाउडर छिडक दीजिये. पालक का रायता तैयार है .\n\n•गरमा गरम परांठे या चपाती के साथ ठंडा पालक का रायता परोसिये और खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                }
                break;
            }

            case "Roti Receipes": {

                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r1);
                       txt = ("•चावल का आटा -1कप\n•नमक- 1/4 छोटी चम्मच (स्वादानुसार )\n•तेल - 2 टेबल स्पून");
                        txt2 = ("•चावल का आटा गूथ कर तैयार करने के लिये किसी बर्तन में 11/4 कप डालकर उबलने के लिये रखेंगे, चौथाई कप पानी किसी प्याली में अलग निकाल कर रख लीजिये, एक कप उबलते पानी में गैस धीमी करके, नमक और 2 छोटे चम्मच तेल डाल दीजिये, और अब चावल का आटा डालकर मिला दीजिये, गैस बन्द कर दीजिये. आटे को ढककर 5 मिनिट के लिये रख दीजिये ताकि चावल का आटा नरम हो जाय.\n\n•अब आटे को किसी डोगे में डालकर मसल मसल ,एकदम नरम चापाती जैसा आटा होने तक गूथिये. नरम गुथे आटे को 15-20 मिनिट के लिये ढककर रख दीजिये,आटा अच्छी तरह फूल कर सैट हो जाय.\n\n•चावल का आटा रोटी बनाने के लिये तैयार हे. तवा गरम होने के लिये गैस पर रखिये, आटे से एक नीबू के बराबर आटा निकालिये, गोल लोई तैयार कीजिये, लोई को सूखे चावल के आटे में लपेटिये और चकले पर रखकर हाथ से दबाकर थोडा बडा लीजिये, अब इस रोटी को फिर से सूखे आटे में लपेटिये और चकले पर बेलन से हल्का दवाब देते हुए किनारे दबाते हुये, गेहूं के आटे के जैसी पतली रोटी बेल लीजिये \n\n•रोटीं को सावधानी से उठाकर गरम तवे पर डालिये, निचली सतह सिकने पर रोटी को पलटिये, दूसरी सतह भी सिकने पर रोटी को फिर से पलटिये और कलछी या चमचे से किनारों को हल्का दवाब देते हुये घुमाते हुये सकिये, रोटी को दोनों और हल्की ब्राउन होने सेक कर तैयार कर लीजिये , सिकी रोटी को तवे से उतार कर किसी प्लेट पर रखी प्याली या एल्युमीनियम फॉयल बिछाकर रखिये सारी रोटी इस तरह सेक कर तैयार कर लीजिये \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r2);
                       txt = ("•बाजरे का आटा -500 ग्राम\n•नमक स्वादानुसार \n•गरम पानी \n•मक्खन या घी");
                        txt2 = ("•बाजरे के आटे को किसी चौडे बर्तन में छान लें. गुनगुने पानी की सहायता से आटे को गूथ लें.\n\n•तवा गैस पर रख कर गरम करें. गूथे हुये आटे से 2 रोटियां बनाने लायक आटा निकाले और आटे को हाथ से मसल कर मुलायम करें, पानी डालने की आवश्यकता हो थोडा थोडा पानी मिलाकर नरम कर लीजिये. नरम आटे से एक रोटी का आटा निकालिये गोल कीजिये, हथेलियों से बड़ा कीजिये \n\n•हथेलियों पर थोडा सा पानी लगाइये. लोई को दोनों हाथों की हथेलियों की सहायता से 5-6 इंच के व्यास में बडा लीजिये. गरम तवे पर रोटी डालिये. सिलने के बाद पलटे से पलटिये.\n\n•यदिं आप बाजरे को रोटी को हाथ से बडाने में कठिनाई महसूस करते हैं, तब आप दूसरे तरीके से रोटी बडा सकते हैं. गुंथे हुये  थोडा सा आटा निकलिये, नरम कीजिये,लोई बनाइये एक मोटा चौकोर पोलीथिन चकले पर रखिये,लोई को पोलीथिन पर रखिये, दूसरे चौकोर पोलीथिन से लोई को ढक कर हथेली की सहायता से दबा दबा कर बडा लीजिये. ऊपर लगी हुई पोलीथिन को हटाइये. हल्के हाथ से रोटी को उठाइये, गरम तवे पर डालिये, निचली सतह पर सिकने के बाद पलटे से पलटिये. जब रोटी की दूसरी सतह सिक जाय तो रोटी को पलटे की सहायता से उठाइये,और धीमी गैस पर घुमा घुमा कर दोनों तरफ ब्राउन होने तक सकिये\n\n•गरमा गर्म रोटी पर घी लगाइये बाजरे की रोटी के साथ चने का साग बहुत अच्छा लगता है उरद चने की दाल का स्वाद अच्छा लगता है  सरसो के साग के साथ बाजरे की रोटी अच्छी लगती है आप अपने मन पसंद किसी भी सब्जी के साथ गरमा करारी बाजरे की रोटी परोसिये\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r3);
                       txt = ("•आटा - 250 ग्राम (2 कप)\n•पानी -1 कप\n•नमक - आधा छोटी चम्मच\n•तेल - 1 -2 छोटी चम्मच");
                        txt2 = ("•आटे को किसी गहरी थाली या बडे प्याले में छान कर निकाल लीजिये. आटे में नमक और तेल डाल दीजिये.\n\n•एक हाथ (बायें हाथ) )से पानी डालते हुए आटे को  दायें हाथ से गूथिये. एक साथ ज्यादा पानी आटे में मत डालिये, आटा अच्छी तरह मिक्स हो जाय तब आटे में मुक्किया लगाकर,बार बार आटे को दायें हाथ से उठा कर पलटिये (आटे को ज्यादा सख्त और ज्यादा पतला मत कीजिये) . आटा एक जैसा हो जाने पर, उसे मुक्किया लगाकर, अगर आवश्यकता हो तो उसके ऊपर थोडा 2 - 3 छोटी चम्मच पानी छिड़ककर, 20- 25 मिनिट के लिये ढककर छोड़ दीजिये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r4);
                       txt = ("•आटा गूथने के लिए \n•गेहू का आटा या मैदा -350 ग्राम (3 कप )\n•नमक-स्वादानुसार (आधा छोटी चम्मच )\n•तेल या घी 2 टेबल स्पून \n•पूरन बनाने के लिए पिट्ठी\n•चने की दाल- 150 ग्राम (3/4 कप) \n•चीनी या गुड़ 50 -ग्राम (1/3 कप) \n•छोटी इलाइची 8 या 10 \n•घी या रिफाइंड तेल -आधा कप ");
                        txt2 = ("•चने की दाल को 4 -5 घंटे पहले पानी मे भिगो दीजिये\n\n•आटे को किसी बर्तन में छान लीजिये, 2 टेबल स्पून घी और स्वादानुसार नमक डाल कर अच्छी तरह मिला लीजिये. आटे को गुनगुने पानी की सहायता से नरम आटा गूथ लीजिये. गूथे हुये आटे को सैट होने के लिये 20 मिनिट के लिये रख दीजिये .\n\n•दाल को कुकर में 1/3 कप पानी डाल कर उबालने रख दीजिये. एक सीटी आने के बाद गैस बन्द कर दीजिये. कुकर से दाल निकालिये, ठंडा कीजिये और बिना पानी डाले मिक्सी से बारीक पीस लीजिये.\n\n•कढाई में एक टेबल स्पून घी डाल कर गरम कीजिये, घी में पिसी हुई दाल , पिसी हुई चीनी डाल दीजिये. ( यदि आप मीठे के लिये गुड़ का प्रयोग कर रहे हैं तो गरम घी में गुड़ को तोड़ कर डालें और पिघला लें अब पिसी हुई दाल डाल कर )5 मिनिट भूनिये, ठंडा दिजिये और उसमें इलाइची पीसकर मिला दिजिये. पूरी में भरने के लिये पूरन तैयार हैं.\n\n•आग पर तवा रख कर गरम कीजिये. गूथे हुये आटे से थोडा सा आटा तोड़िये और गोल कीजिये. सूखा आटा लगाकर, 3 इंच व्यास में बेल लीजिये, 2 चम्मच पूरन इस बेली हुई पूरी के उपर रख कर रखिये और पूरी को चारों ओर से उठाकर,बन्द करके, दोनों हाथों की हथेली के बीच रख कर दबा कर थोडा सा बडा लीजिये. ( यदि ऐसा नहीं करेगे तो आपकी पूरन पोली बेलने समय फट सकती हैं ). अब इस पूरन भरे हुए  गोल को सूखे आटे (परोथन) में लपेट कर चकले पर बेलन की सहायता से गोल 6-7 -8 इंच के व्यास की पूरन पोली खेल लीजिये \n\n•बेले हुई पूरन पोली को तवे पर डाल कर  दोनों तरफ घी लगा कर पलट पलट कर ब्राउन होने तक सेकें. तवे से पूरन पोली उतार कर प्लेट मे निकाल कर रखिये .दूसरी पूरन पोली इसी तरह बेल कर तवे पर डालिये और सेकिये इसी तरह सारी पूरन पोली बना कर तैयार कर लीजिये  \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r5);
                       txt = ("•1 कप गेहूँ का आटा या मैदा\n•1 टीं-स्पून चूरा कीया हुआ खमीर\n•1 टीं-स्पून  शक्कर\n•1 टीं-स्पून  बारीक कटा हुआ लहसुन\n•1/2 टीं-स्पून  नमक\n• 1 टीं-स्पून  तेल\n•गेहूं का आटा , बेलने के लिए\n•1 टीं-स्पून तेल ,चुपडने के लिए");
                        txt2 = ("•तेल छोड़कर सभी सामग्री को बाउल में मिलाकर, ज़रुरत हो उतने पानी का प्रयोग कर, नरम आटा गूथ लें ।\n\n•तेल लगाकर दुबारा गूथ लें ।\n\n• आटे को गीले सूती कपडे से ढ़ककर आटे को फूलने रख दें(लगभग 15 से 20 मिनट के लिए) आटे को हलका दबाकर सारी हवा निकाल लें ।\n\n•आटे को 8 बराबर भाग में बाँट लें ।\n\n•आटे के हर भाग को, थोडे सूखे आटे का प्रयोग कर, व्यास के गोल आकार में बल लें ।\n\n•प्रेशर कुकर का ढक्कन निकालकर, अंदर के भाग को तेल से चुपड़ लें ।\n\n•आँच पर उल्टा रखकर गरम कर लें ।\n\n•हर तंदुरी रोटी के एक तरफ पानी लगाकर, रोटी को पानी के तरफ से कुकर के अदर के भाग में चिपका लें \n\n•आप कुकर  के अंडर के भाग मे  3 से 4 तंदूर रोटी चिपका सकते  है । \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r6);
                       txt = ("•रवा- 1 कप\n•नारियल- 3 चम्मच घिसा\n•अदरक- 1 /4 चम्मच\n•मिर्च- 2-3\n•चीनी- 1 चम्मच\n•तेल- 2 चम्मच\n•पानी\n•नमक- स्वादअनुसार");
                        txt2 = ("•सबसे पहले सभी सामग्रियों को एक साथ पानी की सहायता से मिक्स कर के गूथ लीजिये।\n\n•जब हो जाए तब उसे 20 मिनट के लिये किनारे रख दें ।\n\n•फिर उसकी छोटी छोटी लोई काट कर उसे रोटी नुमा बना कर तवे पर घी या तेल लगा कर सेंक लीजिये।\n\n•इसे दोनों तरफ गोल्डन ब्राउन होने तक सेकिये ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r7);
                       txt = ("•गेहूं का आटा- 1 कप\n•ओट्स-3/4 कप पाउडर\n•बेसन - 1 /4 कप \n•गाजर- 1\n•प्याज- 1\n•हरी मिर्च अदरक पेस्ट - 1 चम्मच \n•धनिया पत्ते - 3 चम्मच\n•धनिया पाउडर- 11 /4 चम्मच \n•जीरा पाउडर- 1/2 चम्मच \n•लाल मिर्च पाउडर- चुटकी भर \n•नमक- स्वाद अनुसार\n•दही- 1 /4 कप\n•पानी\n•तेल");
                        txt2 = ("•एक बडे बर्तन में तेल और पानी मिला कर आटा सान लीजिये और 10 मिनट के लिये किनारे रख दीजिये।\n\n•फिर थोडा सा आटा ले कर रोटी बना लीजिये।\n\n•एक नॉन स्टिक तवा लीजिये और उसमें रोटी को दोनों ओर सेंक लीजिये, उसमें काले चकत्ते पड जाने दीजिये।\n\n•उस पर घी या तेल लगाइये और सेकिये ।\n\n•जब रोटी तैयार हो जाए तब गैस बंद कीजिये और ओट्स रोटी को दही और अचार के साथ सर्व कीजिये ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r8);
                       txt = ("•आटे के लिए\n•3/4कप संपूर्ण गेहूँ का आटा \n•1 टेबल-स्पून पिघला हुआ घी\n•नमक स्वाद अनुसार\n•भरवां मिश्रण के लिए\n•3/4 कप कसा हुआ ताजा नारीयल\n•2 टी-स्पून घी\n•1/2 कप पिसी हुई शक्कर \n•1/2 टी-स्पून  इलायची पाउडर\n•1/2 टीं-स्पून  जायफल पाउडर\n•अन्य सामग्री\n•घी ,पकाने के लिए");
                        txt2 = ("•आटे के लिए-आटे, घी और नमक को एक बाउल में डालकर अच्छी तरह मिला लें ।\n\n•थोड़े पानी का प्रयोग कर नरम आटा गूँथ लें और एक तरफ रख दे ।\n\n•भरवां मिश्रण के लिए-एक चौडे नॉन स्टिक पैन में घी गरम करें, नारीयल डालकर,लगातार हिलाते हुए, मध्यम आँच पर 5 से 9 मिनट तक पका लें ।\n\n•आँच से हटाकर, शक्कर, इलायची पाउडर और जायफल पाउडर डालकर अच्छी तरह मिला लें ।\n\n•मिश्रण को 6 बराबर भाग में बांटकर  एक तरफ रख दें ।\n\n•आगे बढ़ने की विधी-\n\n•आटा गूँथ कर 6 बराबर भाग में बाँट लें ।\n\n•आटे के प्रत्येक भाग को है 7 व्यास के गोल आकार में बेल लें ।\n\n•रोटीं को चपटी सूखी जगह पर रखें और तैयार भरवां मिश्रण के एक भाग को आधी रोटी में रखकर चंद्राकार में मोड़ लें ।\n\n•नॉन स्टिक तवां गरम करें और रोटी को थोडे घी का प्रयोग कर , दोनो तरफ सुनहरे दाग मिलने तक पका लें ।\n\n•बचे हुए आटे और भरवां मिश्रण का प्रयोग कर 5 और रोटी बना लें ।\n\n•तुरंत परोसे ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r9);
                       txt = ("•4रोटियाँ\n भरवां मिश्रण के लिए\n•1/2 कप छिले और कसे हुए आलू \n•1/2 कप स्लाइस्ड और आधे उबले हुए बेबी कॉर्न\n•1 टेबल- स्पून तेल\n•1/2 कप पतले स्लाइस्ड प्याज\n•1/2 कप रंग-बिरंगी शिमला मिर्च के टुकडे (लाल , पीली और हरी)\n•2 टेबल-स्पून भुनी और क्रश की हुई मूंगफली\n•1/4 टीं-स्पून लाल मिर्च पाउडर\n•1/4 टी- स्पून गरम मसाला\n•नमक स्वाद अनुसार\n•1 टेबल- स्पून नींबू का रस\n परोसने के लिए\nटमॅटो केचप");
                        txt2 = ("•भरवां मिश्रण के लिए-एक चौडे नॉन स्टिक पैन में तेल गरम करें, प्याज और आलू डालकर, मध्यम आँच पर 2 मिनट या आलू नरम होने तक भून लें ।\n\n•नींबू के रस को छिड़कर, बची हुई सामग्री डालकर अच्छी तरह मिला लें और बीच-बीच में हिलाते हुए, मध्यम आँच पर-3-4 मिनट तक पका लें ।\n\n•आँच से हटाकर , नींबू का रस डालकर अच्छी तरह मिला लें भरवा मिश्रण को 4 बराबर भाग में बाँटकर एक तरफ रख दें ।\n\n•आगे बढ़ने की विधी-एक नॉन स्टिक तवे पर, चपाती को हल्का गरम कर लें ।\n\n•चपाती को समतल, सूखी जगह पर रखकर , भरवां मिश्रण के एक भाग को चपाती के एक किनारे रखकर अच्छी तरह रोल कर बंद कर लें ।\n\n•विधी क्रमांक 2 को दोहराकर 3 और रोल बना लें ।\n\n•टमॅटो केचप के साथ तुरंत परोसे ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r10);
                       txt = ("•आटा 11/2 (डेड कप\n•गुड़ घिसा हुजा 7 बडे चम्मच\n•तिल 1 छोटा चम्मच\n•घी बडे चम्मच\n•नमक स्वादानुसार");
                        txt2 = ("•एक नान स्टिक पैन गरम करके उसमें गुड़ और दो बडे चम्मच पानी डालकर धीमी आँच पर पकाएँ जब तक गुड़ पिघल जाए । आँच पर से उतार कर ठंडा करें ।\n\n•एक बाउल में आटा, पिघला गुड़, तिल, घी, नमक और आवस्यकतानुसार पानी डालकर सख्त लोई गूदें ।\n\n•लोईं के चार समान हिस्से बनाएं और हर हिस्से को बेलकर खेलकर पाँच इन्च की रोटी बनाएँ। एक नॉन स्टिक तवा गरम करें,उस पर एक एक करके रोटियों मध्यम आँच पर पलटते हुए सेकें जब तक वे दोनो तरफ से समान सुनहरे बन जाए \n\n•थोड़ी घी लगाएं और परोसें \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r11);
                       txt = ("•आटा -2 कप \n•आलू -2 मध्यम साइज के आलू उबाले हुए \n•अजवायन  - एक चौथाई छोटी चमच\n•नमक - आधा छोटी चम्मच (स्वादानुसार)\n•तेल - पूरी तलने के लिये");
                        txt2 = ("•आलू छील कर कद्दूकस कर लीजिये.\n\n•किसी बर्तन में आटा छान कर निकाल लीजिये, कद्दूकस किये आलू नमक और अजवायन आटे में डाल कर अच्छी तरह मिला लीजिये.\n\n•पानी की सहायता से पूरी के लिये सख्त आटा गूंथिये. \n\n•- आटे से छोटी एक नींबू के बराबर की लोइया बना लीजिये और एक एक उठाकर 3-4 इंच के व्यास में पूरी बेलिंये. \n\n•-कढाई में तेल डालकर गरम करने रखिये, जब तेल अच्छी तरह गरम हो जाय तब पूरी डालिये और कलछी से दबाकर पूरी को फुलाइये, पूरी फूलने पर पलटिये और दोनों ओर ब्राउन होने पर निकाल कर किसी प्लेट पर नेपकिन पेपर बिछा कर रख लीजिये, एक एक करके सारी पूरी इसी प्रकार तल कर निकाल लीजिये.\n\n•गरमा गरम आलू पूरी आप अपने मन पसन्द चटनी और सब्जी के साथ परोसिंये और खाइये\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r12);
                       txt = ("•चावल का आटा - 1 कप \n•तेल - 1 टेबल स्पून \n•जीरा पाउडर - 1/2 छोटी चम्मच\n•नमक - 1/2 छोटी चम्मच से कम या स्वादानुसार\n•सौंफ पाउडर - 1/2 छोटी चम्मच\n•धनिया पाउडर - 1/2 छोटी चम्मच\n•तेल - पूरियां तलने के लिए");
                        txt2 = ("•चावल का आटा गूंथने के लिए, पानी को हल्का गरम कर लीजिए. आटे को प्याले में निकाल लीजिये, धनियां पाउडर ,सौंफ पाउडर, नमक और जीरा पाउडर डालकर मिक्स कर लीजिये और थोडा थोडा पानी डालते हुए आटे में मिलाइये,1 छोटी चम्मच तेल भी डाल दीजिए और नरम आटा गूंथकर तैयार कर लीजिए.\n\n•आटे को ढककर के 20-25 मिनिट के लिए रख दीजिए,आटा फूलकर तैयार हो जाएगा.\n\n•पूरी बनाने के लिए कढाई में तेल डालकर गरम कीजिये.आटे से छोटीं-छोटीं लोईयां तोडकर तैयार कर लीजिए और इन्हें ढक कर रखें ताकि ये सूखे नहीं अब एक लोई उठाइये हाथ पर थोडा सा तेल लगाकर लोई को गोल आकार दीजिए, लोई को पोलिथिन शीट पर रख कर हाथ से दबाव देते हुए बडा कीजिये और बेलन की मदद से थोड़ी मोटी पूरी बेलकर तैयार कर लीजिए. अब बेली पूरी को उठाकर गरम तेल में डालिये.\n\n•पूरी को पलट-पलट कर गोल्डन ब्राउन होने तक तल कर ,निकाल कर , प्लेट में रखिये. सारे आटे से इसी तरह पूरियां बना कर तैयार कर लीजिये. इतने आटे से 8 से 10 पूरियां बनकर तैयार हो जाती हैं. चावल की पूरी बनकर तैयार हैं.\n\n•पूरी को दाल, चना मसाला या अपनी पसंदीदा सब्जी के साथ परोसिये और खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r13);
                       txt = ("• गेह का आटा - 1 कप ( 150 ग्राम)\n• ह्ररे चने (ताजा चने)- आधा कप ( 60 ग्राम)\n•हरा धनिया - 2 टेबल स्पून\n•सोंफ पाउडर - 1 छोटी चम्मच\n• धनिया पाउडर - 1 छोटी चम्मच\n•हरी मिर्च - 1 बीज हटाकर बारीक कटी हुई\n•गरम मसाला- 1/4 छोटी चम्मच\n• नमक - 1 /2 छोटी चम्मच ( स्वादानुसार)\n• अदरक पेस्ट  - 1 /2 छोटी चम्मचं\n•तेल- आटे में डालकर गूंथने के लिये और पूरिया तलने के लिये");
                        txt2 = ("ह्ररे चनों को अच्छी तरह धोकर पानी हटा दीजिये, चनों को मिक्सर में डालिये, हरी मिर्च भी डाल दीजिये और दरदरा पीस लीजिये.\n\n•आटे को किसी बडे प्याले में निकालिये, हरे चने, हरी मिर्च का पेस्ट भी डाल दीजिये, अदरक का पेस्ट, 2 छोटे चम्मच तेल, नमक, सौंफ पाउडर, धनिया पाउडर, गरम मसाला और हरा धनिया डालकर, सारी चीजो को मिलने तक मिला लीजिये, अब गुनगुने पानी की सहायता से थोडा थोडा पानी डालकर, पूरी का सख्त आटा गूथ कर तैयार कर लीजिये,इतना आटा गूथने में 1 /4 कप पानी लग जाता हे. गुंथे आटे को ढककर 20 मिनिट के लिये रख दीजिये, आटा फूल कर सैट हो जायेगा.\n\n•हाथ पर थोडा सा तेल लगाकर चिकना कीजिये और आटे को मसल कर चिकना कर लीजिये. आटे से छोटी छोटी लोइयां तोड़ लीजिये, इतने आटे में 11 -12 लोइयां तोड़ लीजिये, लोइयों को गोल करके चपटा कर लीजिये, सारी लोइयां बना कर तैयार कर लीजिये. लोइयों को सूती कपडे से ढककर रखिये, ताकि वे सूखे नहीं\n\n•कढाई में तेल डालकर गरम कीजिये. एक लोई उठाइये और चकले पर रखिये और गोल एक जैसी 3-3.5 इंच के व्यास में पूरी बेलिये, 3-4 पूरी बेल कर प्लेट में रख लीजिये.\n\n•तेल अच्छी तरह गरम होने पर 1 पूरी गरम तेल में डालिये,और कलछी से दबाकर पूरी को फुलाइये, पूरी के तैर कर आने पर पलटिये और दोंनो ओर हल्की ब्राउन होने तक तल कर, नेपकिन बिछी प्लेट में निकाल कर रखिये, सारी पूरियां इसी तरह बेल कर, तल कर तैयार कर लीजिये.\n\n•हरे चने की गरमा गरमा क्रिस्पी पूरी बनकर तैयार हैं. हरे चने की पूरियां आलू  टमाटर की  सब्जी, मटर की सब्जी या किसी भी अपनी मन पसन्द सब्जी,अचार, दही,या रायता किसी के भी साथ परोसिये और खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r14);
                       txt = ("•पूरी के लिये आटा लगाने के लिये-\n•गेहूं का आटा- 400 ग्राम (2 कप)\n•दही 2 टेबल स्पून\n•अजवायन - 3/4 टेबल स्पून\n•नमक - स्वादानुसार (3/4छोटीं चम्मच)\n•तेल - 1 टेबल स्पून  दाल तैयार करने लिये-\n•मूंग दाल - 150 ग्राम (3/4 कप )-हरी मिर्च - 2-3\n•हरा धनियां - साफ करके मोटा काट लें( आधा छोटी कटोरी)\n•अदरक - 1 इंच लम्बा टुकडा\n• धनियां - 1 छोटी चम्मच\n•नमक स्वादानुसार ( आधा छोटी चम्मच)\n•तेल - पूरी तलने के लिये");
                        txt2 = ("•मूंग दाल को साफ करके, धोकर पानी में 2 घंटे पहले भिगो दीजिये. भीगी हुई मूंग दाल को एक बार फिर से धोइये,मिक्सर में मूंग दाल, हरी मिर्च, हरा धनियां और अदरक के साथ मिला कर बिना पानी डाले या बहुत ही कम पानी के साथ पीस लीजिये. पेस्ट में धनियां पाउडर और नमक मिला कर अच्छी तरह मिला दीजिये.  आटे को किसी बर्तन में छान कर निकाल लीजिये, आटे में दही, अजवायन, नमक और तेल मिला लीजिये. गुनगुने पानी की सहायता से का नरम आटा लगाइये. आटे को ढककर आधा घंटे के सैट होने के लिये रख दीजिये.\n\n• आटे से थोडा सा आटा निकाल कर, गोल लोई बनाइये.लोई से चकले  पर पूरी बेलिये, पूरी के ऊपर एक या डेड़ छोटी चमच दाल का पेस्ट लेकर एक जैसा फैलाइये.\n\n•कढाई में तेल डाल कर गरम कीजिये. तेल गरम हो गया हैं यह टेस्ट कीजिये   ( आटे से थोडा सा आटा निकाल कर हाथ से दबाकर गरम तेल में डालिये, अगर आटा जल्दी ही कढाई के तले से ऊपर ऊठकर, फूलकर तैरने लगे तो तेल पर्याप्त गरम हैं) गरम तेल में दाल की तरफ से पूरी डालिये, पानी 'दाल की सतह वाला हिस्सा नीचे तेल की ओर रहे\n\n•जब दाल की सतह हल्की ब्राउन हो जाय, फूलने के बाद पूरी को  पलट कर ब्राउन होने तक तलिये. तली हुई पूरी दलिया या प्लेट में नेपकिन पेपर बिछा कर रखिये. सारी पूरी इसी तरह बनाकर तैयार कर लीजिये.\n\n• आपकी राजस्थानी दाल पूरी तैयार हैं. गरमा गरम राजस्थानी दाल पूरी मटर आलू मटर पनीरया किसी भी अपनी मन पसन्द सब्जी के साथ परोसिये और खाइये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }

                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.r15);
                       txt = ("•मैदा - 2 कप \n•नमक - 1 /2 छोटी चम्मच या स्वादानुसार\n•आलू- 2-3 उबले हुये \n•दही - 1/3 कप\n•तेल - 1 टेबल स्पून मैदा में डालने के लिये\n•तेल - भठूरे तलने के लिये");
                        txt2 = ("•आलू को छीलकर, कद्दूकस करके , एकदम बारीक कर लीजिये.\n\n•मैदा को किसी बर्तन में निकालिये, मैश आलू  नमक, तेल और दही आटे में डालकर मिक्स कीजिये, और अब थोडा थोडा पानी डालकर नरम आटा गूंथ कर तैयार कीजिये, आटा चपाती के आटे  से थोडा सा सख्त और पूरी के आटे  से थोडा सा नरम होना चाहिये. आटे को ढककर 15-20 मिनिट के लिये रख दीजिये ताकि आटा फूल कर सैट हो जाय. भठूरे के लिये आटा तैयार हे.\n\n• कढ़ाई में तेल डालकर गरम करने  को रखिये. हाथ में सूखा आटा लगाकर, आटे से एक बडे नीबू के बराबर की लोइयां तोड़ लीजिये, लोइयों को गोल करके रख लीजिये. एक लोई उठाइये और सूखे मैदा में लपेटिये, लोई को चकले पर रखकर ओवल या गोल आकार में पराठे के जैसा  मोटा  भटूरा  बेल कर  तैयार  कर  लीजिये .\n\n• कढाई में तेल अच्छी तरह गरम होने पर बेला हुआ भटूरा कढाई में डालिये और भटूरे के तैर कर आने पर  , भटूरे को कलछी से दबाकर फुलाइये. भटूरे को नीचे की ओर से हल्का ब्राउन होने पर  पलट दीजिये, भटूरे को दूसरी  और भी हल्का ब्राउन होने तक तलिये. तले हुये भटूरे नेपकिन पेपर बिछी हुई प्लेट में निकालिये. सारे भटूरे इसी तरह तल कर तैयार कर लीजिये.\n\n•गरमा गरम आलू  भटूरे  को छोले मसाला या पिंडी चना या मटर के छोले, चटनी या अचार के साथ परोसिये और खाइये . आलू भटूरे की खास बात यह भी हैं कि यह ठंडे होने के बाद एकदम मुलायम बने रहते हैं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                }
                break;
            }

            case "Sabzi Receipes": {
                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa1);
                       txt = ("•गाजर -1  आलू-1 शिमला मिर्च- 1 \n•फूल गोभी - 1 कप\n•टमाटर - 3 (150 ग्राम )\n•अदरक - 1 इंच टुकडा\n• मटर - 1/4 कप\n• क्रीम - 1/2 कप\n• सूखा नारियल - 1/4 कप कदूकस क्रिया हुआ \n• - सब्जियां तलने और  सब्जी  बनाने लिए\n•हरा धनिया - 2-3 बडे चम्मच हींग - 1 र्पिच\n•जीरा -1/2 छोटी चम्मच हल्दी पाउडर \n•धनिया पाउडर - 1 छोटी चम्मच\n•गरम मसाला - 1/4 छोटी चम्मच\n•लाल मिर्च साबुत - 2\n•तिल - 1 टेबल स्पून \n• नमक - 1 छोटी चम्मच या स्वादानुसार\n•लाल मिर्च पाउडर -2 छोटी चम्मच");
                        txt2 = ("•सब्जियों को धोकर, छोटा छोटा काट लीजिये. टमाटर, हरी मिर्च  अदरक को धोइये और मिक्सी में पीस कर पेस्ट लीजिये \n\n•कढाई में तेल डाल कर गरम कीजिये. गरम तेल में कटे हुए आलू  डालिये और हाई मीडियम आग पर हल्के ब्राउन होने  तक तल कर निकाल लीजिये, गोभी, गाजर और शिमला मिर्च बारी-बारी से हल्की ब्राउन होने तक तल लीजिए और एक प्याले में निकालते जाइये.\n\n•धीमी आंच पर , एक दूसरी कढाई में तिल और जीरा डालकर हल्का  सा भूनें अब इसमें कदूकस हुआ  नारियल भी डाल दीजिए और हल्का  सा कलर चेंज होने तक भून लीजिए. मसाला भून जाने एर गैस बंद कर दीजिए और मसाले को  प्याले में निकाल लीजिए, मसाले के ठंडा होने के बाद इसे पीस लीजिए.\n\n•कढाई में 2 चम्मच तेल डालकर गरम क्रीजिए, गरम तेल में हींग, हल्दी पाउडर, धनियां पाउडर डाल कर मसाले को  हल्का  सा लीजिए. अब इसमें टमाटर और अदरक का पेस्ट डालते  हुए. लाल मिर्च पाउडर और साबुत लाल मिर्च भी डाल कर तब तक भूनिये जब तक, मसाला तेल न छोड़ने लगे, मसाला भून जाने एर इसमें  जीरा और नारियल का पाउडर डाल दीजिए. हल्कऱ सा भूनिये, अब बीन्स  डाल कर मसाले को  लगातार चलाते हुये 2-3 मिनिट और भूनिये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa2);
                       txt = ("•मटर - 1 कप\n•पनीर - 250 ग्राम \n•टमाटर - 250 ग्राम \n•हरी मिर्च - 2\n•तेल - 3-4 टेबल स्पून -क्रीम- 1/2 कप \n•हरा धनिया - 3-4 टेबल स्पून  (बारीक कटा हुआ )\n•अदरक पेस्ट - 1 छोटी चम्मच\n•जीरा - 1 /2 छोटी चम्मच हींग - 1 पिंच \n•हल्दी पाउडर - 1 /2 छोटी चम्मच\n•धनिया पाउडर - 1 छोटी चम्मच\n•लाल मिर्च पाउडर … 1 /4 छोटी चम्मच\n•गरम मसाला 1/4 छोटी चम्मच या स्वादानुसार");
                        txt2 = ("•पनीर को  1 -1 इंच के टुकडों में काट कर तैयार कर लीजिए. पेन में 2 छोटी चम्मच तेल डालकर गरम क्रीजिए.तेल के गरम होने एर पनीर  के टुकडे डाल कर सेक  लीजिए.पनीर  के टुकडों को  पलट कर 2 और से गोल्डन ब्राउन होने तक रोके और प्लेट में निकल लीजिये.\n\n•अब पेन में मटर के दानों को  डालकर 2 मिनिट के लिए ढक कर के धीमी आंच एर पका  लीजिए. 2 मिनिट बाद इन्हें चैक कर लीजिये , मटर के दाने हल्के नरम हो गये हैं, इम्हें प्याले में निकाल लीजिए.\n\n•टमाटर, हरी मिर्च को  मिक्सी से बारीक पीस लीजिये.\n\n•ग्रेवी बनाने के लिए पैन  में 2 टेबल स्पून  तेल डालकर गरम क्रीजिए. गरम तेल में जीरा, हींग, हल्दी पाउडर, धनिया पाउडर और अदरक का पेस्ट डाल कर हल्कऱ सा भूनिये,और अब टमाटर, हरी मिर्च का पेस्ट और लाल मिर्च पाउडर डाल कर मसाले को  तब तक भुनिये जब तक मसाले के ऊमर तेल तैरता दिखने लगे.मसाला भून जाने एर इसमें क्रीम   डाल दीजिए और मसाले को  लगातार चलाते हुए तब लक भूने जब तक उबाल न आ  जाए मसाले में उबाल आने एर इसमें 1 कप पानी डालकर मिक्स क्रीजिए और ग्रेवी  को  फिर से लगातार चलाते हुए उबाल जाने तक पकाए.\n\n•ग्रेवी में उबाल आने पर  इसमें नमक, गरम मसाला और बारीक कटा हुआ हरा धनिया डाल कर मिला दीजिए.अब ग्रेवी  में भूना हुआ पनीर  और मटर के दाने डाल दीजिए,सभी चीज को  अच्छे से मिला दीजिए.सब्जी को  ढककर के 4-5 मिनिट धीमी आंच पर  पकते सब्जी  को  चैक क्रीजिए, सब्जी  बनकर तैयार हे. इसे प्याले में निकाल लीजिए और हरे धनिये  के ऊप्पर से डाल कर सजाइये. गरमा गरम मटर पनीर  को सब्जी , परांठे, नॉन या चपाती किसी के भी साथ परोसिये और खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa3);
                       txt = ("•मूंगदाल- 1/2 कप (300 ग्राम )\n•घी- 2 टेबल म्पून\n•हरा धनिया - 2-3 टेबल स्पून  (बारीक कटा हुआ)\n•जीरा - 1/2 छोटी चम्मच हींग - 1 र्पिच\n• टमाटर - 1 (बारीक कटा हुआ ) - 6-7\n•धनिया पाउडर - 1 छोटी चम्मच\n•साबुत्त लाल मिर्च - 1\n•लाल मिर्च - 1/4 छोटी चम्मच'हल्दी … 1/4 छोटी चम्मच\n•हरी मिर्च - 1 (बारीक कटी  हुई)\n•अदरक पेस्ट - 1/2 छोटी चम्मच \n•नमक - 3/4 छोटी चम्मच या स्वादानुसार ");
                        txt2 = ("•दाल को  अच्छे से साफ करके धोकर 15-20 मिनिट पानी  में भिगो कर रख दीजिए. मूंग दाल को  बिना मिगीये, तुरन्त धोकर भी बनाया जा सकता हैं, यह बहुत जल्द पकने बाली दाल .\n\n•मूंगदाल को  आप  दो तरह से बना सकते हैं. पहले आप दाल को  कुकर में सीटी डाल  कर बाद में तड़का लगा दीजिये  या फिर पहले  कुकर में मसाला भून लीजिये दाल को  अच्छे से साफ करके धोकर 15-20 मिनिट पानी  में भिगो कर रख दीजिए. मूंग दाल को  बिना भिगोये , तुरन्त धोकर  भी बनाया जा सकता हैं, यह बहुत जल्द पकने वानी दाल \n\n•मूंगदाल को  पहले आप  दो तरह से बना सकते हैं.  दाल को  कुकर में सीटी दालकर कर बाद में लड़का लगा दीजिए या फिर पहले  कुकर में मसाला भून लीजिये, लीजिए उसके बाद दाल डालकर पका  लीजिए\n\n•हम यहीं पर दाल को  बना रहे हैं,इसके लिए सबसे पहले कुकर को  गरम क्रीजिए, घी डाल दीजिए घी को  मेल्ट  होने दीजिए.\n\n• टमाटर को  अच्छे से धोकर छोटा-छोटा बारीक काट कर तैयार कर लीजिए.घी गरम होने एर जीरा और हींग डाल दीजिए, जीरा भूनने एर हल्दी पाउडर, धनिया पाउडर, बारीक कटी  हरी मिर्च,अदरक का पेस्ट डालकर मसाले को  हल्का सा भून लीजिए.\n\n•मसाला पर  इसमें बारीक कटे हुए टमाटर डालिए. मूंग दाल को  मसाले में डाल दीजिए और 1 -2 मिनिट मसाले के साथ चलाने हुए भून लीजिए.\n\n•दाल में 2 कप पानी  और नमक, डाल कर मिला दीजिए. कुकर का ढवकन बंद कर दीजिए और दाल में 1 सीटी  आने पर पका लीजिए. सीटी आने एर गैस बंद कर दीजिए और कुकर का प्रेशर खत्म होने एर ढवकन खोल लीजिए.\n\n•दाल बनकर तैयार है इसमें हरा धनिया डालकर मिला दीजिए. दाल को  प्याले में निकाल लीजिए.\n\n•दाल में अलग से तड़का  लगाने के लिए छोटी कढाई में 1 छोटा चम्मच घी डाल कर गरम कीजिये साबुत लाल मिर्च  पाउडर डाल कर गैस बंद कर दीजिए, इस  को  दाल के ऊमर डालकर सजाइये. स्वादिष्ट  मूंगदाल बन कर तैयार है आप इसे चपाती, चावल और दलिया के साथ परोसिये और खाईंये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa4);
                       txt = ("•पालक - 350 गाम \n•मशरूम - 6-8\n•टमाटर - 2 -हरी मिर्च - 1 -2 \n•अदरक - 1 /2 … इंच टुकडा\n• ताजा हरा नारियल - छोटे टुकडे आधा कप\n•हरा धनियां -2 टेबल स्पून  बारीक कटा हुआ\n• नमक - 3/4 छोटी चम्मच (स्वादानुसार)\n•धनिया  पाउडर - 1 छोटी चम्मच\n•गरम मसाला … 1 /4 छोटी चम्मच\n•तेल - 2 टेबल स्पून  हींग - 1 र्पिच\n•जीरा - 1 /4 छोटी चम्मच\n•लाल मिर्च - 1 /4 छोटी चम्मच\n• हल्दी पाउडर - 1 /4 छोटी चम्मच\n•बीम - 2 टेबल स्पून ");
                        txt2 = ("•पालक के पत्तो तोड़ कर मोटे डंठल हटा कर साफ कर लीजिये, मित्रों को  2 बार डूबते पानी  में धोइये, छलनी में रखकर पानी सूखने तक सुखा लीजिये. पानी सूखने पर  पालक के पत्ते बारीक काट लीजिये.॰ मशरूम को  कपडे से पोंछ कर साफ कर लीजिये और मशरूम के पतले पतले  टुकडे काट लीजिये. टमाटर, हरी मिर्च, अदरक और नारियल के टुकडे मिक्सर से बारीक पीस कर पेस्ट बना लीजिये.\n\n•कढाई में तेल डालकर गरम कीजिये, गरम तेल में हींग और जीरा डालिये, जीरा भूनने एर हल्दी पाउडर डालिये और अब पिसा मसाला, धनियां पाउडर और लाल मिर्च पाउडर डालिये, मसाले को  सारा देर में चलाते हुये तब तक भूनिये जब तक कि मसाले पर  तेल न तैरने लगे.\n\n•मसाले में कटा हुआ पालक डालिये, मिक्स कीजिये, 2-3 टेबल स्पून पानी  डालिये और 2-3 मिनिट तक ढककर मीडियम आंच  एर पकाइये, ढवकन खोलिये चमचे से चलाइये और मशरूम के टुकडे नमक, गरम मसाला और हरा धनियां डालकर मिलाये , अगर पानी  कम हो रहा है तब पानी  अपनी पसन्द के अनुसार जितनी पतली सब्जी रखी है थोडा पानी  और डाल सकते हैं, सब्जी  को  ढककर मिडियम आंच पर और 2 मिनिट तक पकाइये.\n\n•पालक मशरूम को सब्जी बनकर तैयार है सब्जी   को  प्याले में निकालिये और चपाती, परांठे, नान और चावल के साथ परोसिये और खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa5);
                       txt = ("•मखाने - 1 कप \n•काजू - 25\n•तेल - आधा  कप जिसमें हम काजू और मखाने तलेंगे.\n•नेवी के लिये:\n•टमाटर - 4 (250 गाम)\n•हरी मिर्च - 2\n•काजू - 25 काजू ,एक घंटे पानी  में मिगीये हुये\n•हरा धनियां - 2-3 टेबल स्पून, बारीक कटा हुआ\n•तेल - 2 टेबल स्पून \n•अदरक पेस्ट - 1 छोटी चम्मच\n•कसूरी मेथी - 1 छोटी चम्मच\n•हींग - 1 र्पिच\n•जीरा - आधा  छोटी चम्मच\n•गरम मसाला … 1 /4 छोटी चम्मच\n•हल्दी पाउडर - 1 /4 छोटी चम्मच\n•लाल मिर्च पाउडर … 1 /4 छोटी चम्मच\n•धनिया  पाउडर - 1 छोटी चम्मच\n•नमक -1 छोटी चम्मच");
                        txt2 = ("•टमाटर को  धोकर बडे टुकडों में काट लीजिये, हरी मिर्च डंठल हटा कर धो लीजिये. टमाटर हरी मिर्च मिक्स करे \n\n•ग्रेवी के लिये मसाला भून लीजिये, पैन  गरम कीजिये और पैन  में तेल डाल दीजिये, तेल गरम होने पर  जीरा डाल दीजिये, जीरा भूनने पर  हींग डाल दीजिये, अदरक पेस्ट ,हल्दी पाउडर, कसूरी मेथी और धनियां पाउडर डाल कर मसाले को  थोडा सा भून लीजिये. अब पिसा हुआ मसाला डाल दीजिये, लालमिर्च पाउडर भी डाल दीजिये और मसाले को  मीडियम आंच पर तब तक भूनिये जब तक कि उसके ऊपर  तेल न तैरने लगी\n\n• जब तक मसाला भूना है तब तक दूसरे गैस एर काजू और मखाने तल कर तैयार कर लीजिये. दूसरी कढाई में तेल डालकर गरम कीजिये, मीडियम गरम तेल में काजू डालकर हल्का  ब्राउन होने तक तल कर निकाल लीजिये. अब थोडे थोडे मखाने डालकर हल्के ब्राउन होने तक तल कर निकाल लीजिये, सारे मखाने तल कर तैयार कर लीजिये.\n\n•मसाले को  बीच बीच में चलाते हुये भून कर तैयार कर लीजिये, मसाले से तेल अलग होने लगा है मसाला भून गया है . भूने मसाले में 1 कप पानी  डाल दीजिये, नमक, गरम मसाला और थोडा सा हरा धनियां डालकर मिला दीजिये. उबाल आने  के बाद, भूने मखाने और काजू डालकर मिला दीजिये, सब्जी  को  ढककर 3-4 मिनिट तक धीमी गैस पर  पकने दीजिये\n\n.• मखाना काजूकरी को  चपाती, परांठे, पूरी या चावल के साथ परोसिये और खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa6);
                       txt = ("•कोफ्ते बनाने के लिए.\n•पनीर- 250 गाम\n•अरारोट  या मैदा… 3-2 चमचा\n•नमक - स्वादानुसार (आधा छोटी चम्मच)\n•धनियां पाउडर - आधा छोटी चम्मच\n•हरी मिर्च… 1 छोटी, बारीक कटी \n•हरा धनियां- एक टेबल स्पून ( कटा हुआ )तरी बनाने के लिए.\n•टमाटर- 3-4 मीडियम साइज की -हरी मिर्च… 1- 2\n•अदरक - 1 इंच छोटा टुकडा\n•काजू - 15\n•तेल - 1-2 चमच\n•जीरा -आधा छोटी चम्मच हींग - 1 र्पिच\n•हल्दी पाउडर - 1 /4 छोटी चम्मच\n•धनिया  पाउडर - 1 छोटी चम्मच\n•लाल मिर्च पाउडर … 1/4 छोटी चम्मच (यदि आप  चाहें)\n•नमक - स्वादानुसार (3/4 छोटी चम्मच)\n•गरम मसाला … 1 /4 छोटी चम्मच से कम\n•हरा धनियां - 1 बड़ी  चम्मच (बारीक कटा हुआ  )");
                        txt2 = ("•कोफ्ते बनाएं:\n\n•पनीर  में अरारोट  डाल कर एक बाउल में मिला लें. इसे मिलाते हुए आटे  जैसा चिकना करके मैश कर लें. अब इसमें नमक, धनिया पाउडर, को हरी मिर्च, और हरा धनिया डाल कर मिला लें. कोफ्ते का मिश्रण तैयार हैं.\n\n•माइक्रोवेव सेफ ट्रे  या प्याले के ढवकन को  तेल लगा कर चिकना कर लें. अब तैयार मिश्रण से छोटे-छोटे गोले बना कर इस  में थीडी-थीडी दूरी एर रख लें.\n\n•माइक्रोवेव को  4 मिनट के लिए अधिकतम तापमान पर  सैट कर लें औरपनीर के गोलों वाली ट्रे को  इसमें रख कर माइक्रोवेव करें. निश्चित  समय के बाद इसे माइक्रोवेव से निकाल लें. पनीर  के कोफ्ते बन कर तैयार हैं.\n\n•तरी बनाएं: -\n\n•सबसे पहले काजू  को आधा  घंटे के लिए गरम पानी  में डाल कर भिगो दें.\n\n•टमाटर, अदरक और हरी मिर्ची को  धोकर बड़े-बड़े टुकडों में काट लें. अब इन तीनो  को  भीगे हुए काजू के साथ मिक्सी में डाल कर बारीक पीस लें.माइक्रोवेव सेफ़ प्याले में तेल  डाल कर उसमें हींग, जीरा,धनिया पाउडर और हल्दी डाल कर अधिकतम तपमान पर  2 मिनट के लिए माइक्रोवेव करें. 2 मिनट बाद प्याले को  बाहर निकाल कर इसमें पिसे मसाले, नमक, लाल मिर्च और गरम मसाला डाल कर मिलाए और 3 मिनट के लिए दुबारा  ढक कर माइक्रोवेव करें.\n\n•निक्षित्त समय के बाद इसमें एक कप पानी  मिलाए और फिर से 3 मिनट के लिए ढक कर माइक्रोवेव करें.\n\n•समय खत्म होने एर प्याले क्रो निकाले. तरी तैयार हैं. इसमें हरा धनिया और तैयार किए मलाई कोफ्ते  डाल कर 2 मिनट के लिए ढक कर रख दें.\n\n•लजीज़ मलाई कोफ्ते तैयार हैं. गर्मा-गर्म परोसें और चपाती, चावल या परांठे के साथ इसका मजा ले.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa7);
                       txt = ("•बैगन - 500 गाम ( बडे बैगन, बिना बीज बाले)बैगन मैरीनेट करने के लिए \n•दही 3-4 टेबल स्पून \n•वेसन - 2 टेबल स्पून \n•नमक - 1/4 छोटी चम्मच\n•गरम मसाला - एक चौथाई छोटी चम्मच\n•तेल- बैगन तलने के लिये\n•टमाटर- 3-4\n•हरी मिर्च 2\n• अदरक - 1 इंच लम्बा टुकडा मूंगफली के दाने - 2 टेबल स्पून \n•ताजा दही … 1/4 कप\n•तेल - 2 - 3 टेबल स्पून \n•हींग - 1 र्पिच\n•जीरा - आधा छोटी चम्मच\n• हल्दी पाउडर - 1 /4 छोटी चम्मच\n•धनिया  पाउडर - 1 छोटी चम्मच\n•लाल मिर्च - एक चौथाई छोटी चम्मच से कम\n• नमक - स्वादानुसार (3/4 छोटी चम्मच)\n•गरम मसाला - 1 /4 छोटी चम्मच\n•हरा धनियां - 2-3 टेबल स्पून  (बारीक कटा हुआ)");
                        txt2 = ("•बैगन को  धोकर छील लें और इन्हें पानी मे डूबा कर रख दें.\n\n•अब बारी है बैगन को  मैरीनेट करने क्री. इसके लिए एक बाउल में फ्रैंटा हुआ दही, नमक, गरम मसाला और बेसन डाल कर इन सबको अच्छे से मिला लें. बैगन को  1 /2 इंच के मध्यम आकार  के चकोर टुकडों में काट लें. बैगन के टुकडों को  तैयार मसाले में मिला कर 15-20 मिनट  के लिए इसी तरह रख दें.\n\n• निश्चित  समय के बाद ये मैरीनेट हो जाएगे. इन्हें तलने के लिए एक कढाई में तेल डाल कर गरम कर लें. गरम तेल में बैगन के टुकडे छोटे छोटे करके डालें. जितने टुकडे आसानी से डाल कर तले जा सके डाल लें. इन्हें पलट-पलट कर हल्का ब्राउन  होने तक पका  लें और फिर एक प्लेट में निकाल कर रख दे.\n\n•तरी बनाएं:\n\n•टमाटर, हरी मिर्च और अदरक को  धो लें. हरी मिर्च के डंठल हटा दें और अदरक को  छील लें. अब इन सभी  को  बड़े-बड़े टुकडों में काट कर इनके साथ मूंगफ़ली के दानों को  मिक्सी में डाल लें और इन्हें पीस कर बारीक पेस्ट बना ले  कढाई में 2-3 टेबल स्पून  तेल डाल कर गरम कर लें.बिलकुल धीमी आंच एर इसमें हींग और जीरा डाल कर भून लें. इसके बाद हल्दी पाउडर और धनिया पाउडर डाल कर टमाटर  - मूंगफ़ली वाला पिसा मसाला डाल लें. लाल मिर्च डाल कर इसे तेल छोड़ने तक भूनें. जब तेल मसाले के उपर तैरने लगे तो इसमें कटी  हुई दही डाल कर मिला लें. चम्मच से चलाते हुए इसे फिर से तेल छोड़ने तक भूनें. जब मसाला भून  जाए तो इसमें तले हुए बैगन के टुकडे डाल कर मिला ले आपको जितनी गाडी तरी पसंद है उसके अनुसार इसमें 1 या 1/2 कप पानी  डाल लें. नमक मिलाए और इसमें उबाल आने  तक चलाते हुए पकाए. सब्जी  में गरम मसाला डाल कर मिला दें. इसे ढक कर 5-6 मिनट तक पकने दें.इतने समय में मसालों का स्वाद बैगन में भर जाएगा. गैस बंद करके इसमें आधा  हरा धनिया मिला लें. बैगन को तैयार है.\n\n•गरमा-गरम बैगन को क्रो बाउल में निकाल कर हरा धनिया डाल कर सजाएं और चपाती, परांठे या चावल के साथ इसे खाए \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa8);
                       txt = ("•फूल गोभी - 1 मीडियम आधा कप  (400 ग्राम)\n•हरी मटर के दाने - 1 कप\n• टमाटर 2-3-ह्ररी मिर्च - 1 -2\n•अदरक - आधा  इंच लम्बा टुकडा\n•मूंगफली के दाने - एक टेबल स्पून \n•तेल - 1-2 टेबल स्पून \n•हींग - 1 पिंच (यदि आप चाहे \n•जीरा - एक चौथाई छोटी चम्मच\n•हल्दी पाउडर - एक चौथाई छोटी चम्मच\n•धनियां पाउडर - 1 1 /2 छोटी चम्मच\n• नमक - स्वादानुसार (3/4 छोटी चम्मच से कम\n•चीनी - आधा  छोटी चम्मच\n•लाल मिर्च - एक चौथाई छोटी चम्मच से कम\n•गरम मसाला - एक चौथाई छोटी चम्मच से कम\n•हरा धनियां - एक टेबल स्पून (बारीक कटा हुआ )");
                        txt2 = ("•सबसे पहले गोभी को  बड़े-बड़े टुकडों में काट लें. गुनगुने पानी में थोडा सा नमक डाल कर मिला लें. इस पानी में गोभी के टुकडे डाल कर 10 मिनट के लिए डुबो दें. 10 मिनट बाद इन्हें नमक वाले पानी से निकाल कर साफ़ पानी से अच्छे  से धो लें.\n\n• टमाटर को  धोकर बडे… बडे टुकडों में काट लें. अदरक को  छील कर धो लें और काट  लें. मिर्च के डंठल हटा कर इन्हें भी धो लें. अब इन सभी  को  छिली हुई मूंगफ़ली के साथ मिक्सी में डाल कर बारीक पीस लें.\n\n• एक कढाई में तेल गरम करके इसमें हींग और जीरा डाल कर तड़काये . हल्दी पाउडर और धनिया पाउडर डालें. फिर टमाटर का पिसा हुआ  मसाला डाल कर भूनें. इस मसाले को  तब तक चलाते हुए भूनें जब तक तेल मसाले के उपर ना तैरने लगे.\n\n• मसाला अच्छे से भून जाए तो इसमें गोभी और मटर डाल कर अच्छे से मिला दें. इन्हें 2 मिनट भून कर आधा कप पानी  डाल कर मिलाएं. नमक और लाल मिर्च भी डाल लें. सब्जी  क्रो ढक दें और 6-7 मिनट तक धीमी आंच  एर ही पकने दें. सब्जी  क्रो चैक करें, अगर लगे कि अभी ये हल्की कच्ची  हैं तो इसे एक बार चला कर फिर से ढक कर 2-3 मिनट पका  लें. अगर आपको पानी कम लगे तो 1 -2 चम्मच पानी  भी डाल सकते हैं.\n\n•निचित्त  समय के बाद चैक करें. हमें सब्जी को  बहुत ज्यादा  गलाना नहीं है. गोभी मटर मसाला तैयार हैं. इसमें गरम मसाला और हरा धनिया डाल कर मिला ले.सटजी क्रो जल्दी बनाएं:\n\n•सब्जी  क्रो जल्दी बनाने के लिए गैस के दोनों चूल्हो का इस्तेमाल करना  होगा. एक बर्तन में गोभी, मटर में नमक मिला कर इतना पानी  लें कि सब्जियां डूब जाए लेकिन पानी  बहुत जयादा भी ना हो. सब्जियां बस डूब जानी चाहिए इन्हें एक चूल्हे एर पकने के लिए रख दें.\n\n•दूसरे चूल्हे एर एक कढाई में तेल गरम करके हींग, जीरा तडका लें. फिर हल्दी और धनिया पाउडर डाल कर टमाटर वाला मसाला डालें और तेल छोड़ने तक भून लें. मटर गोभी क्रो चैक कर लें. अगर ये नरम हो गये हैं तो ये पक गये हैं.हमें इन्हें ज्यादा  गलाना नहीं हैं. गोभी और मटर क्रो पानी  के साथ ही तैयार किए मसाले में डाल लें और लाल मिर्च, गरम मसाला, चीनी और आधा  हरा धनिया भी डाल कर मिला लें.इसे अब 2-3 मिनट तक पका  लें. ये सब 10-15 मिनट में ही तैयार हो जाएगी.\n\n स्वादिष्ट गोभी मटर मसाला क्रो किसी बाउल में निकाल लें.इसे हरा धनिया डाल कर सजाएं और नान, परांठे या चावल के साथ इसे मजे से खाए.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa9);
                       txt = ("•1 कप मूंग दाल \n•1 - 2 प्याज\n• 1 चम्मच सौंफ \n•1 आलू  \n•1 गाजर\n•1 कप लौकी\n•1 किलो कदू \n•10-35 बीन्स \n•1चम्मच गुड\n• 1 चम्मच हरी मिर्च पेस्ट  \n•1 चम्मच अदरक पेस्ट\n• 1 चम्मच चिली पाउडर\n•1 चम्मच राई\n•1 चम्मच हींग\n• 1 चम्मच तेल\n• नमक स्वादअनुसार");
                        txt2 = ("•मूंग को पानी  में धोइये और 10 मिनट के लिये भिगो कर रख दीजिये। सभी सब्जियों को काट लीजिये। उसके बाद  मूंग को सभी सब्जियों और हल्दी  के साथ उबाल आने दे \n\n•अब एक कढाई लीजिये, उसमें तेल गरम कीजिये, फिर उसमें जीरा, राई, सौंफ और हींग डालिये। जब यह लड़को लगे तब इसमें को हुए प्याज  डाल कर भूरा होने तक भूनिये । उसके बाद इसमें हरी मिर्च का पेस्ट और अदरक पेस्ट मिलाइये और चलइये ।\n\n•कढाई क्रो आंच से उतारिये और उसमें चिली पाउडर डाल कर चलाइये । अब आपका तड़का  तैयार हो चुका हैं, इसे पकी हुई मूंग दाल के साथ मिला दीजिये।\n\n•इसके बाद इसमें गुड और नमक मिला कर पेश कीजिये ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa10);
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa10);
                       txt = ("• 1/2 कप स्लाइसेस \n• 1/4 चम्मच \n• 1/2 राई\n• 2 चम्मच हरी मिर्च और अदरक की पेस्टी \n• 1 टमाटर, कटा हुआ\n• 1 चुटकी हींग\n• 1 /2 चम्मच हल्दी पाउडर \n• 1 चम्मच लाल मिर्च पाउडर \n• 1 चम्मच धनिया पाउडर \n• 1 चम्मच जीरा पाउडर \n• 1 चम्मच शक्कर \n•  2 चम्मच पकाने वाले तेल\n• 1/2 चम्मच कटी  हरी धनिया\n•1 1/4 कप पानी \n• नमक");
                        txt2 = ("•कढाई में तेल गरम करें, उसमें राई, जीरा और हींग डालें हैं: कुछ सैकेंड के बाद हरी  मिर्च और अदरक वाला पेस्ट लाए ।\n\n•फिर इसमे कटे  हुए आलू मिलाकर  के 3-4 मिनट तक चलाए\n\n•अब इसमें लाल मिर्च पाउडर और हल्दी  मिला कर 1 मिनट तक पकाये  ।\n\n•फिर 1/4 कप पानी  डाल कर मिश्रण को  पकने दें । जब यह उबलना शुरु हो जाए तब आंच को  धीमा कर दें और 4-5 मिनट में चलाती रहें ।\n\n•इसे लगभग 10-15 मिनट पकने में लगेंगे। अगर जरुरत पड़े  तो और पानी  मिक्सा क्रिया जा सकता हैं ।\n\n•आखिर में जीरा और धनिया पाउडर  मिक्स करें।\n\n•आंच को  बंद  करें और इसे एक कटोरें में डाल कर हरी धनिया से गार्निश करें।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa11);
                       txt = ("•पालक के पत्ते… 30-35\n•खट्टी दही- 1 कप\n•बेसन - 2 चम्मच\n•तेल- 2 चम्मच-हरी मिर्च… 2-3\n•अदरक- 1 इंच पीस\n• सूखी लाल मिर्च… 4-5\n• प्याज- 1\n•जीरा- 1 चम्मच\n•नमक- स्वाअनुसार\n• हल्दी पाउडर … चुटकी भर");
                        txt2 = ("•सबसे  पहले  बेसन, दही और दो कप पानी  को  अच्छी तरह से फैट लें ।\n\n• फिर एक नॉन नॉनस्टिक पेन में तेल गरम करें।\n\n•फिर हरी मिर्च, 10-12 पालक को पत्तिया और अदरक को  हल्का सा पानी मिला कर पीस लें ।\n\n•इस मिश्रण को  दही वाले बर्तन  में मिक्स करें।\n\n•अब गरम तेल में लाल मिर्च डाल कर ।\n\n•उसके बाद प्याज को  क्यूबस में काट कर पेन में डालें ।\n\n•इसके साथ ही राई और जीरा डाल कर  चलाएं ।\n\n•जब प्याज मुलायम हो जाए तब दही वाला मिश्रण, नमक और हल्दी मिलाएं ।\n\n•इसे मध्यम आंच एर चलाते हुए तब तक पकाये , जब तक कि कड़ी गाडी ना होने लगे ।\n\n• उसके बाद बाकी  पालक बारीक काटें और उसमें कड़ाई  में ही मिला दें ।\n\n•कुछ मिनट तक कड़ी  पकाएं और गैस छंद कर दें । इसे गरमा गरम चावल के साथ सर्व करें।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa12);
                       txt = ("•3-4 उबले आलू कटे हुए\n• 2 मध्यम आकार  के प्याज\n• 2 चम्मच अदरक लहसुन पेस्ट\n• 4-5 हरी मिर्चc\n• 2 टमाटर \n•हल्दी पाउडर\n• लाल मिर्च पाउडर\n• नमक\n• धनिया पाउडर\n•गरम मसाला\n• टमाटर का केचप \n•साधा चम्मच जीरा\n•1 तेज पत्ता\n• 1 कप पानी \n•तेल");
                        txt2 = ("•एक कटोरे में सारे मसाले और नमक डालें और उसमें थोडा सा पानी  डाल कर पेस्ट  तैयार कर लें । टमाटर और प्याज  को  पीस कर पेस्ट तैयार करें. अब एक पेन में तेल गरम करें और उसमें जीरा और तेज पत्ता डालें, फिर अदरक-लहसुन पेस्ट डालें और अच्छे से भूनें\n\n• अब पैन  में प्याज और टमाटर का पेस्ट  डालें और फिर उसे दो मिनट तक के लिये भूने और फिर उसमें मसाला पेस्ट  डालें और फिर मीडियम आंच  एर एक मिनट तक के लिये भूनें।\n\n• अब ऊपर  से गरम मसाला और टोमेटो  केचप  डाल कर जब तक तेल अलग न हो जाए, तब तक मसाले को  भूने।\n\n•अब उसमें उबले हुए आलू छील -छाल कर अच्छे से चलाएं और फिर थोडा सा पानी  डालें । तब तक पकाएं जब तक वह अच्छे से हो न जाए, उसके बाद आंच बंद कर दें ।\n\n•आपकी आलू की सब्जी  तैयार हो गई हैं, अगर इसको और भी चटपटा बनाना हैं तो इसमें टमैटो क्रैचप की  मात्रा और बढा दें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa13);
                       txt = ("•4 उबले हुए आलू \n• 1 हरी मिर्च\n• 1 कप हरी मटर\n• आधा  कप हरी धनिया बारीक कटी  हुई\n• स्वादानुसार नमक\n• 2 चम्मच तेल\n• 2 प्याज");
                        txt2 = ("•सबसे पहले प्याज को  छील लें और लंबे टुकडों में काट लें। मटर को उबाल लें ।हरी मिर्च बारीक काट लें\n\n•फिर एक नान स्टिक फ्रीबेन में दो चम्मच तेल डाल कर गर्म करें प्याज डाल कर हल्का गुलाबी होने तक भून लें ।\n\n•हरी मिर्च डाल कर हल्का भूनें । इसके बाद मटर डाल कर कुछ देर चलाते हुए भूनें। आलू छील  कर काट कर डालें ।\n\n•नमक डालकर अच्छी तरह चलाएं । तब तक पकाएं जब तक कि आलू मटर गल न जाएं । कटी  हुई हरी धनिया से सजा कर परांठा या पूरी के साथ गरमागरम सर्व करें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa14);
                       txt = ("•1/2 कप उबले हुए हरे मटर\n• 2 टेबल-स्पून तेल\n• 2 टीं-स्पून जीरा \n•2 टीं-स्पून उड़द दाल है\n• 2 कप बारीक कटा हुआ प्याज 2 टीं-स्पून  लहसून \n•2 टीं-स्पून  धनिया-जीरा पाउडर \n• टीं-स्पून  लाल मिर्च का पाउडर है /2 टीं-स्पून हल्दी / 2 टीं-स्पून बारीक कटा हुआ टमाटर नमक , स्वाद अनुसार \n• टेबल-स्पून बारीक कटा हुआ हरा धनिया टेबल-स्पून कसा हुआ नारियल \n•2 टेबल-स्पून टुकडा क्रिया हुआ काजू ");
                        txt2 = ("•एक नॉन स्टिक -कढाई में तेल गरम करिए और उसमे जीरा और उड़द दाल डालिए ।\n\n•जब जीरा चटखने लगे, तब उसमे प्याज डालिए और मध्यम आंच पर  से 2 मिनट भूनिए ।\n\n• उसमे लहसून का  पेस्ट, धनिया-जीरा पाउडर, लाल मिर्च का पाउडर, हल्दी, टमाटर, नमक और २ टेबल-स्पून पानी  डालिये हिल्लाये और मध्यम आंच पर  2 मिनट,उसमे लहसून को पेस्ट, धनिया-जीरा पाउडर, लाल मिर्च का पाउडर, हल्दी, टमाटर, नमक और 2 टेबल-स्पून  पानी  डालिए, अच्छे से मिलाइए और मध्यम आंच पर 2 मिनट,बीच बीच  में हिलाते हुए पकाइये  ।\n\n• उसमे बनाया हुआं नारियल-काजू के पेस्ट, हरे मटर, धनिया / 2 कप पानी  डालिए, अच्छे से मिलाइए और मध्यम आंच एर 2-3  मिनट, बीच बीच  में हिलाते हुए पकाइये।\n\n•गरमा  गरम परोसिए ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sa15);
                       txt = ("•2 टीं-स्पून तेल\n• 2 टीं-स्पून जीरा\n• 2 टीं-स्पून बारीक कटी  हुई हरी मिर्च\n• 2 टीं-स्पून बारीक कटा हुआ अदरक\n• 2 कप कटे प्याज\n•2 कप उबले मसले हुए आलू \n• 2 कप कटी  मेथी\n• 2 टीं-स्पून मेथी , भूनकर  क्रश की हुई\n• 2 टीं-स्पून अमचूर\n•2 टीं- स्पून हल्दी पाउडर\n•2 टीं-स्पून गरम मसाला\n• नमक स्वादानुसार \n•1 कप कटा हुआ हरा धनिया\n• 2 कप ब्रेड  रोल करने के लिए\n• तेल तलने के लिए ");
                        txt2 = ("•पैन में तेल गरम करें और जीरा  डालें ।\n\n• जब बीज  चटकने लगे, हरी मिर्च, अदरक और प्याज डालकर 2-3 मिनट या प्याज के पार्दर्शी होने तक भून लें ।\n\n•बची हुई सामग्री डालकर अच्छी  तरह मिलायें और २ मिनट तक भून लें ।\n\n• बची हुई सामग्री डालकर अच्छी तरह मिलायें और २ मिनट तक भून लें ।\n\n•आँच से हठाकर मिश्रण को  ठंडा करने रख दें ।\n\n• मिश्रण को  4 बराबर भाग में बाँटकर प्रत्येक भाग को गोल चपटी टिक्की  बना लें ।\n\n•  हर टिक्की को  ब्रेड कबोक्स मे लपेटकर सभी तरफ से काट  कर ।\n\n• मध्यम आँच पर  कढाई में तेल  गरम करें और टिक्की  को  दोनो तरफ से सुनहरा होने तक तल लें । तेल सीखने वाले कागज़ में निकालकर गरमा गरम परोसें ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                }
                break;
            }

            case "Sambhar Receipes": {
                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb1);
                       txt = ("•आधा कप तूअर दाल\n• आधा कप मसूर दाल\n• 1/2 चम्मच हल्दी पाउडर\n• 1 कप कटी  हुई लौकी\n• 1/2 कप कटे कद्दू \n•  1/2 कप बेबी कार्न (पतले गोल टुकडो में कटे हुए)\n• 2 कटी  हरी मिर्च\n• 1 कप कटे टमाटर\n• 1/2 कप कटे प्याज\n• 2 चम्मच अदरक-लहसुन पेस्ट \n• 2 चम्मच घिसा नारियल\n• 1 चम्मच धनिया पाउडर\n• 1/2जीरा पाउडर\n•1 चम्मच कसूरी मेथी\n• 1/2 चम्मचच मिर्च पाउडर\n• 1 /2 चम्मच गरम मसाला\n• नमक स्वादानुसार\n•3 चम्मच तेल\n•2 चम्मच कटी हरी धनिया");
                        txt2 = ("•सबसे पहले  दाल को अच्छी प्रकार से धो लीजिये और पानी  में 30 मिनट के लिये भिगो दीजिये। 30 मिनट बाद दाल को 3 कप पानी , हल्दी पाउडर और नमक मिला कर प्रेशर कुकर में पकने के लिये चढा दीजिये। जब दाल तैयार हो जाए तब उसे उतार कर ठंडा होने दीजिये।\n\n•अब एक पैन  में तेल डाल के गरम कर  के उसमें बारीक कटा प्याज डाल कर भूनिये । उसके बाद टमाटर,अदरक-लहसुन पेस्ट , घिसा नारियल, धनिया-जीरा पाउडर,लाल मिर्च पाउडर और गरम मसाला डालिये तथा 2-3 मिनट के लिये भूनिये  ।\n\n अब उसी पैन  में कद्दू लौकी और बेबी कार्न तथा हरी मिर्च डाल कर थोड़ी पकाइए सब्जिया पकने के बाद उसमे पकी दाल और 1 कप पानी डालिये तथा उसे अच्छी प्रकार से गादी होने तक उबालिये । जब दाल तैयार हो जाए तब उसमें कटी हुई हरी धनिया डालिये और गरमा-गरम चावल और रोटी के साथ खाइए और खिलाइये  .\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb2);
                       txt = ("•हरा धनियां - 250 ग्राम  ( 1 छोटा बंच )\n• मसूर की  दाल - एक छोटी कटोरी\n• प्याज - 1 बारीक कटा हुआ\n तेल - 2 टेबल स्पून  \n• जीरा - आधा छोटी चम्मच\n• हींग पाउडर - 2 र्पिच\n• हरीमिर्च - 1-2 कटीं हुई\n• अदरक - 2 इंच का टुकडा\n• धनिया पाउडर - 1 छोटी चम्मच\n•नमक - स्वादानुसार\n• हल्दी पाउडर - 1 /4 छोटी चम्मच\n• गरम मसाला - 1 छोटी चम्मच\n• लाल मिर्च - 1 /4 छोटी चम्मच\n• टमाटर -1 कटा हुआ");
                        txt2 = ("•दाल को 1 घंटे पहले पानी में भिगो दीजिये।\n\n•दाल को अच्छी तरह से धो  लीजिये, कुकर में दाल डाल दीजिये और पानी की मात्रा उतनी हो की सारी दाल अच्छी तरह से भीग जाए और थोडा सा पानी दाल के ऊपर दिखने लगे, फिर 3 सीटी लगवाएँ। मिक्सी में टमाटर, हरी मिर्च, लहसुन और 1 इंच अदरक को मिक्सी में पीस लीजिये।\n\n•अदरक को बारीक और पतला काट लीजिये। प्याज को भी बारीक काट लीजिये।\n\n•कढाई में तेल डालकर गरम कीजिये, जीरा और हींग डालिये, जीरा भूनने पर , प्याज, और बारीक कटी हुई अदरक डाल दीजिये। जब प्याज हल्के भूरे हो जाए तब मिक्सी का पिसा मसाल डाल दीजिये।\n\n•हल्दी पाउडर, धनिया पाउडर, लालमिर्च पाउडर, नमक ,गरम मसाला, और  डालकर मसाले को अच्छी तरह चम्मच से चलाते हुये तब तक भूनिये जब तक कि मसाले की कोटिंग न आ जाये ।\n\n•कुकर में से दाल को कढ़ाई में डाल दीजिये, 5 मिनट के लिंए गैस पर धीमी आग पर पकने दीजिये। दाल बनकर तैयार है ।दाल पर हरा धनिया डाल कर सर्व कीजिये \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb3);
                       txt = ("•चनादाल - 2 छोटे चम्मच\n•मूँग दाल - 2 छोटे चम्मच\n•अरहर दाल - 2 छोटे चम्मच\n•मसूर दाल - 2 छोटे चम्मच\n•उरद दाल - 2 छोटे चम्मच\n• साबुत लालमिर्च - 2\n• लाल मिर्च पाउडर - 1 /2 छोटी चम्मच\n• हल्दी पाउडर -1 /2 छोटी चम्मच\n• जीरा -1 छोटी चम्मच\n•हिंग - 1 र्पिच\n•नमक - स्वादनुसार\n• काली मिर्च साबुत - 4 से 5\n• बड़ी  इलाइची  - 2 से 3\n• लोंग - 2\n•अदरक - 1 इंच कद्दूकस की हुई\n• हरी मिर्च - 2 बारीक कटी  \n•हरा धनिया - 1 /2 चोटी चम्मच\n• नींबू  -1");
                        txt2 = ("•सारी दालों को धो कर आधा घंटे पानी में भिगो दीजिए ।\n\n•दाल को उबालने के लिए कुकर में दाल डाल दीजिए उसने नमक, हल्दी पाउडर और एक कटोरी पानी डाल दीजिए और कुकर का ढकन लगा कर एक सिटी लगा लीजिए कुकर को जब तक नहीं खोले जब तक प्रेशर निकल नहीं जाता ।\n\n•एक कढ़ाई में घी डालिए, जब घी में से हल्का धुआं उठने लगे तब उसमे जीरा हिंग डाल कर हल्का भूरा होने तक पकने दीजिये। फिर उसमे अदरक और हरी मिर्च डाल दीजिए, और इसे भी हल्का भूरा होने तक भून लीजिये उसमे लाल मिर्च, धनिया पाउडर, आमचूर पाउडर और नमक डाल दीजिए और तब तक भून लीजिए जब तक मसाला घी छोड़ने नहीं लगता ।\n\n•फिर उसमे दाल डाल दीजिए और ढक कर 3-4 मिनट तक मीडियम आँच पर पकने दीजिए ।\n\n•दाल बन कर तैयार हैं जाए इस पर हरा धनिया और नींबू का रस डाल कर सर्व  कीजिये ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb4);
                       txt = ("•हरा धनियां - 250 ग्राम)\n•अरहर की दाल - एक छोटी कटोरी\n• प्याज - 1 बारीक कटा हुआ\n•सरसों का तेल - 2 टेबल स्पून \n• जीरा - आधा छोटी चम्मच\n• हींग पाउडर - 2 पिंच\n• हरी मिर्च - 1-2 बारीक कटी हुईं\n•धनिया पाउडर - 1 छोटी चम्मच\n•नमक - स्वादानुसार (आधा छोटी चम्मच से अघिक)\n•हल्दी पाउडर - 1 /4 छोटी चम्मच\n•लालमिर्च - 1/4 छोटी चम्मच\n• टमाटर -1 बारीक कटा हुआ");
                        txt2 = ("•दाल को अच्छी तरह से धो  लीजिये, कुकर में दाल डाले और पानी की मात्रा उतनी हो की सारी दाल अच्छी तरह से भीग जाए और थोडा सा पानी दाल से ऊपर दिखने लगे ।फिर 2 सीटी लगवाएं \n\n•कढाई में तेल डालकर गरम कीजिये , जीरा और हींग डालिये, जीरा भूनने पर , हरी मिर्च, प्याज़ और लहसुन डाल कर मसाले को हल्का सा भूनिये ।हल्दी पाउडर, धनिया पाउडर, लालमिर्च पाउडर, नमक,और टमाटर डालकर, मसाले को अच्छी तरह चम्मच से चलाते हुये तब तक भूनिये जब तक कि मसाले की कोटिंग न आ जाये।\n\n• कुकर में से दाल को कडाही में डाले, 5 मिनट के लिए गैस पर पकने दे । अरहर की दाल बनकर तैयार हैं\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb5);
                       txt = ("•उड़द की दाल - 1 छोटी कटोरी \n•राजमा - 1 /4 कटोरी\n•तेल -1 से 2 टेबिल स्पून  \n• प्याज - 1\n• अदरक - एक इंच\n•लहसुन 4-5 कलियाँ\n• हींग - 1 पिन्च\n• जीरा - आधा  छोटी चम्मच\n•क्रीम या मलाई - आधा छोटी कटोरी\n• धनियां पाउडर - 1 छोटी चम्मच\n•लाल मिर्च पाउडर - 1 /4 छोटी चम्मच\n• हरी मिर्च -1- 2 बारीक कटीं हुई\n•नमक - स्वाद अनुसार\n• हरा धनियाँ - बारीक कटा हुआ");
                        txt2 = ("•उड़द और राजमा साफ़ कर के रात भर या 8 घंटे के लिये भिगो दें!\n\n• उड़द और राजमा धो कर कुकर में उबाल लीजिये, उबलने के लिये कुकर में एक सिटी तेज़ आँच पर लगवाएं उसके बाद गैस को कम कर दे और 5-6 सिटी लगवाएँ।\n\n• अदरक, लहसुन ,हरी मिर्च, प्याज को मिक्सी में पीस लीजिये ।\n\n•कढाई में तेल डाल कर गरम कीजिये उसमें हींग और जीरा डाले, जीरा भूनने के बाद मिक्सी का पीसा मसाला डाल दीजिये, धनियां, लाल मिर्च पाउडर डाले मसाले को तब तक पकने दे जब तक मसाला तेल नही छोडे फिर क्रीम या मलाई डाल कर मसाले को अच्छी तरह से चला कर तब तक भूने जब तक मसाले के साथ क्रीम अच्छी तरह ना मिले।\n\n• फिर उबले हुये उड़द और राजमा डाल दीजिये और अच्छी तरह से चम्मच चलाये उसके बाद 2-3 कप पानी डाले, या आपको जितनी पतली दाल चाहिये उतना पानी दाल दीजिये। फिर नमक, गरम मसाला डाल दीजिये उस के बाद ढक कर 3-4 मिनट तक पकने दे। दाल पर हरा धनिया डाल दीजिये, दाल बन कर तैयार हैं\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb6);
                       txt = ("•हरा धनियां - 250 ग्राम( 1 छोटा बंच )\n•चने की दाल - एक छोटी कटोरी\n• प्याज - 1 बारीक कटा हुआ\n• तेल - 2 टेबल स्पून \n•जीरा - आधा छोटी चम्मच\n•हींग पाउडर - 2 र्पिच\n•हरी मिर्च - 1-2 कटीं हुई\n•अदरक - 2 इंच का टुकडा\n•धनिया पाउडर - 1 छोटी चम्मच\n•नमक - स्वादानुसार\n• हल्दी पाउडर - 1 /4 छोटी चम्मच\n• गरम मसाला - 1 छोटी चम्मच\n• लाल मिर्च - 1 /4 छोटी चम्मच\n• टमाटर -1 कटा हुआ");
                        txt2 = ("•दाल को 1 घंटे पहले पानी में भिगो दीजिये।\n\n•दाल को अच्छी तरह से धो  लीजिये, कुकर में दाल डाल दीजिये और पानी की मात्रा उतनी हो की सारी दाल अच्छी तरह से भीग जाए और थोडा सा पानी दाल के ऊपर दिखने लगे, फिर 3 सीटी लगवाएँ।\n\n• मिक्सी में टमाटर, हरी मिर्च, लहसुन और 1 इंच अदरक को  मिक्सी में पीस लीजिये।\n\n• अदरक को  बारीक और पतला काट लीजिये। प्याज को  भी बारीक काट लीजिये।\n\n• कढाई में तेल डालकर गरम कीजिये, जीरा और हींग डालिये, जीरा भूनने पर, प्याज, और बारीक कटी हुई अदरक डाल दीजिये। जब प्याज हल्के भूरे हो जाए तब मिक्सी का पिसा मसाल डाल दीजिये।\n\n•हल्दी पाउडर, धनिया पाउडर, लालमिर्च पाउडर, नमक,गरम मसाला, और नमक डालकर मसाले को अच्छी तरह चम्मच से चलाते हुये तब तक भूनिये जब तक कि मसाले की कोर्टिग न आ जाये ।\n\n•कुकर में से दाल को कढ़ाई में डाल दीजिये, 5 मिनट के लिए गैस पर धीमी आग पर पकने दीजिये। चने की दाल बनकर तैयार हैं ।\n\n•चने की दाल पर हरा धनिया डाल कर सर्व कीजिये ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb7);
                       txt = ("• उरद दाल - 1 छोटी कटोरी \n•राई - 1 छोटी चम्मच\n• लालमिर्च - 1 छोटी चम्मच\n• इमली - 1 /2 छोटी कटोरी\n• हल्दी - 1 /2 छोटी चम्मच\n• नमक - स्वादानुसार\n• हरा धनिया - 1/2 छोटी कटोरी\n•कदु - 1 छोटी कटोरी\n•लोकी - 1 छोटी कटोरी\n• बैगन - 1 छोटा\n• गोभी - 1 छोटी कटोरी\n• र्भिडी - 3 से 4\n• कड़ी पत्ता - 15 से 20\n• साबुत लालमिर्च - 2\n• प्याज - 1 बारीक कटा\n• हरी मिर्च - 2 बारीक कटी \n• सांभर मसाला - 3 छोटी चम्मच");
                        txt2 = ("•दाल को आधा घंटे पहले पानी में भिगो दीजिये, ताकि दाल नरम हो जाए ।\n\n• सारी सब्जियों को 1 इंच लंबा काट लीजिये, अगर आप के पास ये सारी सब्जियाँ नहीं हैं तो कोई और सब्जियों का इस्तेमाल कर सकते हैं ।\n\n• दाल और सारी सब्जियों को कुकर में डाल दीजिये। पानी की मात्रा दाल और सब्जियों से दुगनी रखनी हैं । कुकर को बंद कर दीजिये और गैस को तेज़ करके 1 सिटी लगा लीजिये, उसके बाद गैस को मीडियम आँच पर कर दीजिये और 3-4 सिटी लगा लीजिये। जब कुकर में से सिटी निकल जाए तब चम्मच से सारी सब्जियों को मेश कर दीजिये।\n\n• 1 बड़ी कटोरी गरम पानी में इमली डाल दीजिये।\n\n• एक कढ़ाई में 2 छोटे चम्मच तेल डाल दीजिये जब तेल गरम हो जाए तब उसमें राई डाल दीजिये और उसे चटकने दीजिये, उसके बाद कड़ी  पत्ता  साबुत लाल मिर्च, हल्दी डाल दीजिये और हल्का सा भून लीजिये, उसके बाद प्याज,हरी मिर्च, नमक, सांभर मसाला डाल कर हल्का भूरा होने तक भून लीजिये। फिर कुकर कि दाल को डाल दीजिये।इस के बाद इमली का पानी छलनी से छान कर पानी को कढ़ाई में डाल दीजिये, अगर आप को सांभर में खटास कम लग रही हो तो इमली में पानी और मिला दीजिये और छलनी से छान लीजिए ।अगर अभी भी सांभर गाढा लग रहा हैं तो उसमें पान और डाल दीजिये। सांभर को तब तक पकने दीजिये जब तक सांभर अच्छी तरह उबलने नहीं लगे । सांभर के उबलने के बाद 3- 4 मिनट तक पकने दीजिये।\n\nसांभर बन कर तैयार हैं इस पर हरा धनिया डाल कर गरमा गरम परोसिए\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb8);
                       txt = ("•तूअर दाल- 1/2 कप\n•प्याज- 2\n•गाजर- 2\n•ड्रम स्टिक- 1 लंबी डंडी \n•आलू- 2\n• बैगन- 1\n• टमाटर- 1\n•सरसों- 1 चम्मच \n• कड़ी पत्ता- 1 डंठल\n• सूखी लाल मिर्च- 2\n•इमली- 1 इंच\n•सांभर मसाला- 1 चम्मच\n•हींग- 1/2 चम्मच\n• लाल मिर्च पाउडर- 1 चम्मच\n•तेल- 4 चम्मच \n• नमक\n• पानी  ");
                        txt2 = ("•दाल को धो लें और गरम पानी में 30 मिनट तक के लिये भिगो दे । अब प्रेशर कुकर में टमाटर छोड़ कर बाकी सारी सब्जियों को 2-4 सीटी आने तक पका लें और ठंडा कर लें ।\n\n• अब एक कटोरे में पानी डाल कर उसमें इमली भिगो दें ।\n\n• इसके पांच मिनट बाद उसमें से रस निचोड़े और एक कटोरी में कर के किनारे रख दें । एक पैन लें और उसमें तेल गरम करें, कडी पत्ता, सरसों और हींग डालें ।\n\n•जब यह तड़कने लगे तब इसमें हींग, लाल मिर्च और प्यार डाल कर 1 मिनट तक पकाएं और गोल्डन ब्राउन रंग का कर लें ।\n\n•इसके बाद इसमें इमली का रस, नमक, लाल मिर्च पाउडर और सांभर मसाला डालें । इसे मिक्स करें और 2 मिनट तक पकाएं ।\n\n• अब इसमें ठंडा की जा चुकी कटी हुई सब्जियां मिलाएं,जो कि उबल चुकी हों । जो सब्जियां ठीक से ना पकी हों ,उन्हें आप हल्का सा दबा दीजिये। अगर जरुरत हो तो पैन में थोडा सा पानी डाल दीजिये और गाढा होने तक पकाइये ।\n\n• सर्व करने से पहले सांभर को टेस्ट कर लीजिये।\n\n• इसके बाद अगर आपको लगता है कि सांभर तीखा है तो उसमें इमली का रस और मिला दीजिये। लीजिये तैयार हो गया आपका सांभर, अब गैस बंद कर दीजिये।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb9);
                       txt = ("•1/2 किलो कद्दू\n• 1/2 कप तूअर दाल\n•1 चम्मच तिल का तेल\n• 1/2 राई\n•1/2 जीरा\n• 1/2 उरद दाल\n• 2 हरी पत्ते वाली प्याज\n• 1 प्याज\n•1 टमाटर\n• 1 इंच इमली का पीस\n• 1 चम्मच सांभर पाउडर \n• 1/2 चम्मच हल्दी\n• 1/4 चम्मच हींग\n• 1 छोटा चम्मच नमक\n• 2 हरी धनिया के गुच्छे ");
                        txt2 = ("•कद्दू को छोटे पीस में काट लीजिये और बीज निकाल दीजिये। ऊपर का छिलका छील दें और फिर उसे मुलायम होने तक पानी में उबाल लें पानी को फेकिये मत बल्कि आगे के प्रयोग के लिये रख लीजिये। कद्दू को किसी दूसरे बर्तन में रख लीजिये।\n\nअब 2 कप पानी में तूअर दाल को 1 0 मिनट के लिये प्रेशर कुकर में पका लें ।\n\n• अब एक पैन में तेल गरम करें, उसमें राई, उरद दाल, जीरा और कडी पत्ता डाल कर पकाएं ।\n\n•फिर इसमें कटी प्याज डाल कर भुरा करें ।\n\n•जब प्याज़ गुलाबी हो जाए तब उसमें टमाटर काट कर डालें ।\n\n• अब इमली को पानी में भिगो कर रखें और जब वह मुलायम हो जाए तब उसको टमाटर के साथ ही मिला दें ।\n\n• अब नमक, हींग, सांभर पाउडर और हल्दी मिलाएं ।\n\n•इसे 10 मिनट तक धीमी आँच पर पकाएं ।\n\n• अब इसमें उबला कद्दू और उबली तूअर दाल डालें। इसमें बचा हुआ पानी  भी मिक्स कर दें और गाढा होने तक पकाएं ।\n\n• आखिर में कटी हरी धनिया डालें और गैस बंद कर दें ।\n\n• आप इसे गरमा गरम चावल के साथ सर्व कर सकती हैं ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb10);
                       txt = ("•चने की दाल- 1 कप ( भिगोई हुई)\n•घिसा हुआ नारियल- 2 बडे चम्मच\n•नमक- स्वादानुसार\n•तेल- 2 बडे चम्मच\n•सूखी लाल मिर्च 3\n•धुली उड़द दाल- 1 छोटा चम्मच\n•राई -1 छोटा चम्मच\n•हींग - 1 /4 छोटा चम्मच\n• कड़ी  पत्ते 2");
                        txt2 = ("• एक नॉन स्टिक बर्तन में 2 कप पानी उबालें । उसमें भिगोई  हुई चना दाल और नमक मिक्स कर के ढक कर पकाएं ।\n\n•एक नॉन स्टिक पैन लें, उसमें तेल गरम करें ।\n\n• फिर उसमे सूखी लाल मिर्च तोड़ कर डालें । उसके बाद उसमें धुली उड़द दाल और राई डाल कर चलाएं ।\n\n• अब इसमें हींग, कड़ी पत्ते और सूखी मिर्च डाल कर  अच्छी तरह मिलाएं । इस तडके को चना दाल में डालकर अच्छी तरह मिलाएँ।\n\n• अब दाल को ढंक कर 2 मिनट तक अच्छी तरह से पकाएं \n\n•फिर दाल में घिसा हुआ नारियल डाल कर मिलाएं और धीमी आँच पर एक मिनट पका कर सर्व करें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb11);
                       txt = ("•2 चम्मच नारियल तेल\n• 1/2 चम्मच हल्दी पाउडर \n• 1/2 चम्मच लाल मिर्च पाउडर  \n•200 ग्राम भिंडी कटी\n•नमक - चुटकीभर  \n• 2 चम्मच इमली का पानी \n• थोडा पानी  \n• 5 छोटे बैगन, बीच से कटे सांभर पेस्ट के लिये:\n• 2 चम्मच उरद दाल\n• 2 चम्मच तूअर दाल\n• 1/2 चम्मच जीरा\n•1/2 मेथी दाना\n• 1 /2 चम्मच साबुत धनिया\n•1/2 चम्मच काली मिर्च\n• 4-5 लहसुन की कलियां\n• अदरक, थोड़ी सी\n• 1/2 नारियल, घिसा हुआ\n•1/2चम्मच हल्दी पाउडर  \n•1/2चम्मच लाल मिर्च पाउडर  \n• नमक, चुटकीभर\n• पानी बेस बनाने की  सामग्री.\n•2 चम्मच नारियल तेल\n• 3 चम्मच सांभर पेस्ट\n• 2 चम्मच इमली का पानी  \n• 1 पीस गुड\n• थोडा सा नमक 220 ml बटर मिल्क तड़के के लिये सामग्री.\n• 2 चम्मच नारियल तेल\n• 5 कश्मीरी लाल मिर्च\n• 1 चम्मच राई\n• थोड़ी सी कडी पत्ता \n• नमक\n• 1 चम्मच घिसा नारियल ");
                        txt2 = ("•सब्जियों के लिये विधि -\n\n• एक कढाई में नारियल तेल, हल्दी और लाल मिर्च पाउडर डाल कर पेस्ट करें ।\n\n• फिर उसमें भिंडी और चुटकीभर नमक मिलाएं । उसके बाद इमली का रस और थोडा सा पानी  डाल कर 5 मिनट पकाएं  ।\n\n•अब इसमें कटा हुआ बैगन डाल कर आधा पकाएं । गैस  बंद कर  दे और डस मिश्रण को किनारे रख दे \n\n• सांभर पेस्ट बनाने की विधि -\n\n• एक पैन में उरद दाल, तुअर दाल, जीरा, हींग, धनिया ,कालीमिर्च, लहसुन, अदरक, नारियल, हल्दी पाउडर ,लाल मिर्च पाउडर और नमक मिला कर कुछ देर के लिये भून लें ।\n\n•अब सभी मसालों को  पानी  मिला कर पेस्ट बनाएं । इसे किनारे रखें ।\n\n• बेस  बनाने की  विधि-\n\n•एक पैन में नारियल तेल और सांभर पेस्ट डालें । ऊपर से थोडा पानी  मिला कर भूने ।\n\n• जब पेस्ट तेल छोड़ दे तब इसमें इमली का रस, गुड और नमक मिक्सक करें ।\n\n• अब धीरे धीरे बटर मिल्क मिलाती जाएं और कल्छुल से चलाती जाएं ।\n\n•अब इसमें कटी सब्जियां मिक्सर कर के आँच धीमी कर दें और पैन को ढक दें । ऊपर से तड़का लगाएं ।\n\n• तड़का बनाने को विधि -\n\n•एक छोटे पैन में नारियल तेल, कश्मीरी मिर्च, राई और कड़ी पत्ता डाल कर पकाएं ।\n\n•इस मिश्रण में हल्का नमक और घिसा नारियल डालें ।\n\n• फिर इसे सांभर में डालें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb12);
                       txt = ("•1 कप अरहर या तुअर दाल\n•1/4 चम्मच हल्दी\n• 1/2 या 2/3 चम्मच कटी लहसुन\n• 2 हरी मिर्च\n•-1/2 चम्मच जीरा या जीरा पाउडर  \n•नमक- स्वादअनुसार\n• 2 चम्मच तेल \n•2.5कप पानी ");
                        txt2 = ("•दाल को अच्छी तरह से धो लें । फिर इसे प्रेशर कुकर में पानी अपैर हल्दी डाल कर 3 सीटी तक पकाएं\n\n•एक फ्राइंग पैन  में 1 चम्मच तेल डालें।\n\n• फिर उसमें कटी लहसुन, प्याज ओर चुटकीभर  नमक डाले ।\n\n•प्याज को भूरा होने तक फ्राई करें । फिर प्यज को एक टिसू पेपर पर  निकाल कर रख लें ।\n\n•जब दाल पक जाए तब उसमें किसी बडे चम्मच से मैश कर लें।\n\n• फिर दाल को पतला करने के लिये उसमें 3/4 कप पानी मिलाएं ।\n\n•अब दाल को धीमी आँच पर कुछ देर पकाएं ।\n\n• अब गैस पर एक पैन चढाएं और उसमें 1 चम्मच तेल गरम करें ।\n\n•जब तेल गरम हो जाए तब उसमें जीरा पाउडर , लहसुन ,हरी मिर्च और नमक मिक्स करें।\n\n• इसे तब तक फ्राई करें, जब तक लहसुन भूरा ना हो जाए ।\n\n•अब इस मिश्रण को दाल मे  मिक्स कर दें। .\n\n• अब कुकर में दक्कन लगा दे और आँच को बंद कर दे ।\n\n• दाल को  5 मिनट के बाद खोल कर चलाएं । अगर दाल में नमक या पानी कम पड़ जाए तब उसमें और पानी या नमक मिक्सक करें।\n\n• इसके बाद इसमें फ्राई किये हुए प्याज डाल कर गार्निश करें ।\n\n• गरम गरम दाल को चावल या रोटी के साथ सर्व करें।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb13);
                       txt = ("•तूअर दाल- 1 /2 कप \n•मूंग दाल- 2 चम्मच\n•पानी- 2 कप\n•तेल- 2 चम्मच\n•जीरा- 1 चम्मच\n•अदरक-लहसुन पेस्ट - 1 चम्मच\n•हरी मिर्च- 2\n•प्याज- 2\n•मेथी के पत्ते 1 डंठल \n• टमाटर- 2\n•लाल मिर्च पाउडर- 1 /2 चम्मच\n•नमक- स्वादानुसार  \n• नींबू रस- 1 चम्मच");
                        txt2 = ("•दोनों दालों को धो लें और कुकर में 1 कप पानी डाल कर 3 सीटी आने तक पका लें ।\n\n•अब मेथी के मित्रों को धो कर उसकी पत्तियों को अलग कर लें और कुतर लें ।\n\n• पैन में तेल गरम करें और उसमें जीरा डालें ।\n\n• फिर लहसुन… अदरक पेस्ट और हरी मिर्च काट कर भूने ।\n\n•अब कटी  प्याज डाल कर हल्का भूरा होने तक भुने और बाद में कटे  टमाटर डालें ।\n\n•जब टमाटर गल जाए तब पैन  में कटी हुई मेथी की पत्तियाँ डालें ।\n\n•इसे 2 मिनट तक पकाएं और बाद में पकी हुई दाल, हल्दी पाउडर, लाल मिर्च पाउडर और नमक डालें ।\n\n•पैन में 1 कप पानी  डालें और अच्छे से मिक्स करें ।\n\n•इसे उबलने दें और 5 मिनट हो जाने के बाद इसमें नींबू का रस डालें \n\n• इस बार जब आपको लगे कि दाल पक गई हैं, तो आँच बंद कर  दे।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb14);
                       txt = ("•उरद दाल- 1 कप\n• दालचीनी- 1\n• लौंग- 3\n•दालचीनी- 2\n• सूखी लाल मिर्च- 1\n•अदरक-लहसुन पेस्ट - 1 चम्मच\n• टमाटर - 2\n•काली मिर्च पाउडर- 1/2 चम्मच\n• हल्दी - 1 चम्मच\n• धनिया पाउडर- 2 चम्मच\n•गरम मसाला- 1 /2 चम्मच\n• नींबू रस- 2 चम्मच\n•जीरा- 1 चम्मच \n•नमक\n•तेल- 1 चम्मच\n•पानी- 2 चम्मच\n•धनिया पत्ता  - 2 चम्मच");
                        txt2 = ("•उरद दाल को पानी  में 4 घंटों के लिये भिगो देने के बाद उसे छान लीजिये और कुकर में पानी  और नमक डाल कर पका लीजिये। 2 सीटी लगाएं ।\n\n• एक पैन में तेल गरम करें, उसमें दालचीनी, लौग, जीरा ,इलायची डाल कर फ्राई करें।\n\n• अब इसमें सूखी लाल मिर्च , अदरक लहसुन पेस्ट, डाल कर 2 मिनट फ्राई करें।\n\n•अब इसमें कटे टमाटर, धनिया पाउडर, हल्दी पाउडर,लाल मिर्च पाउडर, गरम मसाला और नमक डालें तथा 5मिनट पकाएं ।\n\n•जब मसाले पूरी तरह से पक जाएं तब दाल को उसमें उड़ेल दें और ऊपर नींबू  निचोड़  दें । इसे मिक्स करें और धीमी आँच पर 5 मिनट पकाएं ।\n\n• आँच  बंद करें और कटी हरी धनिया छिडक कर दाल कटी सर्व करें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sb15);
                       txt = ("•अंकुरित मूंग - 1 कप (अंकुरित कैसे करे)\n•नमक - स्वादानुसार (1 छोटी चम्मच)\n• टमाटर - 2\n• अदरक - 1 इंच लम्बा  टुकडा\n• कच्चा नारियल - 2 टेबल स्पून (कतरे हुये टुकडे) यदि आप चाहें \n•हरी मिर्च \n• घी  1टेबल  स्पून \n• हींग - 2 पिंच  \n•जीरा - एक चौथाई छोटी चम्मच\n• हल्दी पाउडर - एक चौथाई छोटी चम्मच\n• धनियां पाउडर - एक छोटी चम्मच\n• लाल मिर्च पाउडर - एक चौथाई छोटी चम्मच से कम\n•गरम मसाला - एक चौथाई छोटी चम्मच से कम\n•हरा धनियां - एक टेबल स्पून ");
                        txt2 = ("•अंकुरित मूंग  को धो कर कुकर में डालिये, पानी  (तीन गुना पानी ) और नमक डाल कर कुकर बन्द कर दीजिये और दाल पकने के लिये रख दीजिये. कुकर में एक सीटी आने  के बाद धीमी गैस पर 3-4 मिनिट तक दाल को  पकने दीजिये.\n\n•टमाटर, हरी मिर्च, अदरक और नारियल को  मिक्सर से बारीक पीस लीजिये. कढाई में घी डाल कर गरम कीजिये,घी में हींग और जीरा डालिये, जीरा  तड़कन के बाद हल्दी पाउडर, धनिया पाउडर और मसाले का पेस्ट डाल कर मसाले को  इतना भूनिये कि मसाले के ऊपर घी तैरने लगे.\n\n• कुकर खोलिये  दाल को  जितना पतला और गाड़ा करना हैं उसके हिसाब से पानी, भूना हुआ मसाला, लाल मिर्च और गरम मसाला मिला दीजिये. अंकुरित मूंगदाल तैयार हैं. दाल को टेस्ट करके नमक को  एडजस्ट कर लीजिये.\n\n•तैयार दाल को प्याले में निकालिये, हरा धनिया और घी या मक्खन डाल कर सजाइये. गरमा गरम अंकुरित मूंगदाल को चपाती, नान या चावल के साथ और खाइये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                }
                break;
            }

            case "Mithai Receipes": {
                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.m1);
                       txt = ("•गाजर  5-10 स्वास्थ्यवर्द्धक\n• देसी घी 2 बड़े  चम्मच\n•इलाइची का पाउडर  है /1 (एक  छोटा चम्मच\n•चीनी 1 /4 कप\n-ड/बादाम सलाइस क्रिया हुआ 3-4\n• काजू 5-6\n•क्रिशमिश  10-12\n•मावा घिसा हुआ 2 कप\n•पिस्ते कटा हुआ 3-4 कप");
                        txt2 = ("•गाजर  क्रो एक माइक्रोवेव  बाउल में रखें । उसमें घी डालकर मिलाएँ।\n\n•छोटीं इलायची पाउडर  डालकर मिलाएँ। माइक्रोवेव में हाई  एर पाँच मिनट तक पकाएँ । फिर बाउल में चीनी डालकर मिलाएँ।\n\n•माइक्रोवेव में हाई एर दो मिनट तक पकाये । फिर उसमें बदाम, काजू किशमिश और खोया  (थोडा खोया  सजाने के लिये अलग रखें) और मिलाएँ।\n\n• फिर माइक्रोवेव में दो से ढाई मिनट तक पकऱएँ। अलग रखे खोया  और पीस्ता से सजाकर गरमागरम या ठंडा परोसे ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.m2);
                       txt = ("•मूंग की  धुली दाल - 100 ग्राम (आधा कप )\n•घी - 100 ग्राम (आधा कप)\n•मावा  - 50 - 100 ग्राम ( 1/4 - 1/2 कप)\n•चीनी - 150 ग्राम (3/4 कप)\n•काजू- 20 (एक काजू क्रो 4 टुकडों में काट लें)किशमिश - 20\n•इलाइची - 4 (छील कर पीस लें)\n• बादाम - 5 (लम्बाई में बारीक काट लें)");
                        txt2 = ("•मूंग की  दाल को धो कर 2-3 घंटे के लिये पानी में भिगो दीजिये\n\n• दाल क्रो धो कर पानी से निकाल लें और बिना पानी डाले,मिक्सी से पीस लें. दाल क्रो एकदम बारीक न करें.\n\n• कढाई गैस एर रख कर गरम करें. कढाई में घी डाल कर हल्का गरम कर लीजिये और दाल डाल दीजिये. कढ़ाई  से चला चला कर दाल क्रो मिडियम आग  एर भूनें. करीब 20 या 25 मिनिट में दाल ले : अच्छी  तरह भून जायेगी ( भुनी  हुई दाल कढाई से नहीं चिपकती और घी अलग होता दिखता है ) दाल भून कर तैयार हे. दाल क्रो किसी प्याले में निकाल कर रख दीजिये .\n\n•कढाई में मावा   डाल कर धीमी आंच एर भून लीजिये और दाल में मिला दीजिये.\n\n•किंसी बर्तन में चीनी  की मात्रा  के बराबर पानी  मिला कर गैस एर रखें. पानी  में उबाल आने  के बाद 1 - 2 मिनिट तक उठायें और चाशनी तैयार कर लीजिये.\n\n•दाल में यह चाशनी मिलायें, काजू और किसमिस भी मिला दें. अब धीमी गैस एर हलवे क्रो चला चला कर भूनें 5-7 मिनिट में हलवा बन कर तैयार हो जाता है. गैस बन्द कर दीजिये. हलवे में पिसी हुई इलाइची डाल कर मिला दीजिये.आपका मूंग का  दाल का हलवा तैयार हे.\n\n•मूंग की  दाल के हलवा क्रो प्याले में निकाल लीजिये और ऊपर से कटे  बादाम डाल कर सजाइये. गरमा गरम मूंग दाल हलवा परोसिये और खाइये. ठंडा होने के बाद मूंग के दाल के हलवा क्रो फ्रिज में रख लीजिये और 7 दिन तक मूंग दाल का हलवा फ्रिज से निकालिये और खाइये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.m3);
                       txt = ("•बेसन - 1 कप\n•दूध- 1 कप\n•चीनी- 1 कप\n•घी - 1 कप (लगभग 70 गाम)\n•छोटीं इलाइची - 4\n•पिस्ते- 1 टेबल स्पून ");
                        txt2 = ("•बेसन क्रो दूध में डाल कर घोल लें. इसे अच्छे से चिकना कर लें और फिर 5 मिनट के लिए ढक कर रख दें.\n\n• पिस्ते क्रो बारीक और पतला पतला काट लें. इलायची को  छील कर इसे पीस लें और पाउडर बना लें.\n\n• एक पेन लेकर उसमें घी गरम करें. पेन अगर नॉनस्टिक का हो तो ज्यादा अच्छा  रहेगा. सारा घी इस पेन में डाल दें बस एक छोटी चम्मच बचा कर रख लें. जब घी पिघल जाए तो इसमें दूध में घुला घोल कर  बेसन डाल दें. इसे 2 मिनट तक नीचे से हल्का ब्राउन  होने तक सेक  लें.\n\n• हल्कऱ सिलने एर बेसन क्रो पलट दें. इसे चिल्ले की  तरह रखने को ज़रूरत नहीं हे. दूसरी सतह क्रो भी हल्की सिकने  दें. अब एक कलछी की  मदद से इसे मैश करें और धीमी और मीडियम आंच  एर लगातार चलाते हुए भूनें. जब बेसन ब्राउन दिखने लगे और इससे अच्छी  महक आने लगे तो आपका  बेसन भून कर तैयार हे. इसमें लगभग 12-15 मिनट का समय लगेगा.\n\n•बेसन भून गया हे. इसमें एक कप पानी  और चीनी डाल कर मिला लें. इसे कलछी से चलाते हुए तब तक पकाएं जब तक ये गाड़ा  होकर बर्तन का तला ना छोड़ दे\n\n•बेसन  का हलवा तैयार हे. इसे प्याली में निकाल कर उपर से बचाया  घी डाल दें. पिस्ता  डाल कर सजाएं और परोसें.गरम-गरम बेसन के स्वादिष्ट हलवे क्रो मजे से खाएं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.m4);
                       txt = ("•सेवई  - 100 ग्राम (एक कप)\n•घी - एक टेबल स्पून \n•चीनी - 100 ग्राम\n•काजू- 10-12 (हर काजू क्रो 5-6 टुकडों में काट लें)\n• बादाम - 6-7 (लम्बे  व पतले काट लें)\n•किशमिश - 20-25 (डंठल तोड़ कर साफ कर लें)\n•छोटी इलाइची - 4-5 (छील कर पीस लें)");
                        txt2 = ("•सबसे पहले  कढाई में घी गर्म करके उसमें सेवई डालिये और हल्का ब्राउन होने तक भून कर प्लेट में निकाल लीजिये। उसके बाद कढाई में बचे घी में सेवई की  मात्रा  का तीन गुना पानी (सेवई एक कटोरी तो पानी तीन कटोरी) मिला कर गर्म कर लीजिये ।\n\n•जब पानी अच्छी  तरह गर्म हो जाए तो उसमें भुनी   हुई सेवई और सभी मेवे (थोडे से बादाम बचा लें) डाल कर धीमी गैस एर सेवई के नरम होने तक पका  लीजिये।\n\n•अब इसमें चीनी मिला कर तब तक पकाइये  जब तक कि सारी चीनी पानी में धुल ना जाए और उसके बाद गैस बंद करके हलवे में इलाइची मिला दीजिये।\n\n•सेवई  का हलवा तैयार है । अब इसे किसी प्याले में निकाल कर दबे  हुए बादामी से सजाइये और गरमा-गरम परोस कर खाइये ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.m5);
                       txt = ("•ब्रैड स्लाइस - 10\n•दूध - 600 गाम (3 कप)\n•घी - आधा  कप\n•चीनी 100 - 350 ग्राम( 1/2 - 3/4कप)\n• काजू - 12 -14 (छोटे छोटे काट लें)\n• बादाम 8-10 (छोटे छोटे काट लें)\n•इलाइची - 6-7 (छील कर क्रूट लें)");
                        txt2 = ("•ब्रैड का हलवा बनाने के लिए आप आटे या मैदे, किसी भी तरह से ब्रेड ले सकते हैं. इन दोनों के अलावा आप  मल्टीग्रेन ब्रेड भी ले सकते हैं. अलग तरह के ब्रेड से हलवे का टेस्ट भी अलग आएगा .\n\n• एक कढाई में 2 चम्मच तेल डाल कर गरम करें. हैड क्रो छोटे-छोटे कडों में तोड़ लें. इन टुकडों क्रो गरम घी में डाल लें. आंच मीडियम और धीमा रखें. ब्रेड  क्रो टुकडों क्रो हमें सुनहरी होने तक भूनना हैं.\n\n• ब्रेड  के टुकडे सुनहरी हो जाएं तो इनमें दूध और चीनी डाल लें. सारी चीजों क्रो अच्छे से मिलाएं और चलाते हुए पकाएं. साथ ही चम्मच की  मदद से ब्रेड  के टुकडों क्रो दबाते हुए तोडू दें खुब इसमें फिहूँ चम्मच घी ओर हलवे\n\n•ब्रैड का हलवा बनाने के लिए आप आटे या मैदे, किसी भी तरह को ब्रेड  ले सकते हैं. इन दोनों के अलावा आप  मल्टीग्रेन ब्रेड  भी ले सकते हैं. अलग तरह के ब्रेड से हलवे का टेस्ट भी अलग जाएगा.\n\n• एक कढाई में 2 चम्मच तेल डाल कर गरम करें. ब्रेड क्रो छोटे-छोटे कडों में तोड़ लें. इन टुकडों क्रो गरम घी में डाल लें.  मीडियम और धीमा रखें. ब्रेड क्रो टुकडों क्रो हमें सुनहरी होने तक भूनना हैं.\n\n•जब  ब्रेड के टुकडे सुनहरी हो जाएं तो इनमें दूध और चीनी डाल लें. सारी चीजों क्रो अच्छे से मिलाएं और चलाते हुए पकाएं. साथ ही चम्मच की  मदद से हैड के टुकडों क्रो दबाते हुए तोड़ दें. अब इसमें 2 चम्मच घी और डाल लें और  हलवे क्रो अच्छे से चिकना होने तक पका  लें. थोडे से काजू अलग बचा लें और बाकी सारे बादाम हलवे में डाल कर मिला लें. इलायची पाउडर डालें और मिला लें.\n\n• स्वादिष्ट हैड का हलवा तैयार हैं. इसे किसी बाउल में निकाल लें. ब्रेड  के गरमा-गरम हलवे क्रो देशी घी और काजू डाल  सजाएं और तुरंत परोस कर इसके ज्ञायके का मजा ले .\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.m6);
                       txt = ("•खसखस … 3/4 कप ( 100 ग्राम)\n•चीनी… 3-4 कप (300 ग्राम)\n•दूध- 1 कप (250 ग्राम)\n•देसी घी - 1 कप (70 ग्राम)\nछोटी इलाइची … 4-5\nबादाम - 5-6");
                        txt2 = ("•खसखस साफ करके 4- 5 घंटे के लिए पानी में भिगो दें. अब बादाम को  पतला-पतला काट लें और इलायची को  छील कर पाउडर बन लें\n\nभीगी हुई खसखस में से फालतू पानी निकाल दें और जितनी ज़रूरत हो उतना दूध या पानी डालते हुए इसे बारीक पीस लें. अब एक कढाई में आधा  घी(जरुरत  के अनुसार) गर्म करके उसमें पिसा हुआ खसखस डालकर रंग बदलने तक और हल्की खुशबू आने   तक भूनें.जरुरत  लगे तो और घी डाल लें और फिर खसखस का अच्छे से भून कर किसी अलग बर्तन में निकाल लें.\n\n•अब एक पैन  में चीनी और दूध डाल लें. इन्हें चीनी घुलने तक पकाएं और फिर इसमें भूना हुआ खसखस डाल कर गाड़ा  होने तक हिलाते हुए पकाएं तैयार होने एर इलायची पाउडर मिला कर हलवे का प्लेट में निकाल लें.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.m7);
                       txt = ("•कार्न फ्लोर - 1 कप (300 ग्राम)\n•चीनी - 2 कप ( 450 ग्राम)\n•घी- 1/2 कप (125 ग्राम)\n•काजू - आधा  कप (छोटे छोटे कटे  हुये)\n•पिस्ते - 1 टेबल स्पून  (बारीक प्याले कटे हुये)\n•टाटरी (टार्टरिक एसिड) … 1 /4 छोटी चम्मच पाउडर (2 मटर के दाने बराबर)\n•छोटी इलाइची - 4- 5 (छील कर पाउडर बना लें)");
                        txt2 = ("•इस हल्वे क्रो बनाने में 400 ग्राम पानी  2 कप पानी का इस्तेमाल करना  हे. थोडा सा पानी लेकर उसमें कार्न फ्लोर  को    घोलें. ध्यान रहे कि सारी गुठलियों अच्छे से खत्म हो जाए अब इसमें पानी की  कुल मात्रा 1/4 कप डाल कर मिला लें. चीनी क्रो पैन  में डाल कर उसमें 3/4 कप पानी डाल कर चीनी धुल कर चाशनी बनने तक पका लें.तैयार चाशनी में कार्न प्रलोर वाला घोल मिला दें. गैस धीमी करके इसे लगातार चलाते हुए पकाए. 10-12 मिनट में ये घोल गाड़ा होने लगेगा. इसे धीमी आंच  एर  लगातार चलाते हुए पकाते रहें. धीरे… धीरे हल्का  पार  दर्शके होने लगेगा.अब इसमें आधा  घी डालें और पहले की  तरह ही चलाते हुए पकाते रहें. बाकी बचे घी क्रो धीरे… धीरे चम्मच से डालते पकाये  और हल्वे क्रो तब तक चलाते हुए पकाते रहें जब तक पूरा घी अब्सॉर्ब  ना हो जाए\n\n•जब हल्वे में चमक आ जाए तो इसमें कलर डाल कर अच्छे से पका लें. अब काजू और इलायची का पाउडर डाल कर पका  लें. इसे 5-7 मिनट तक या तब तक पकाए जब तक इसकी क्रंसिसिटेन्सी जमाने लायक ना हो जाए\n\n•कराची हलवा  तैयार हैं. इसे किसी  थाली में डाल कर जमने के लिए रख दें. उपर से पिस्ता  डाल कर चम्मच से चिपका दें. ठंडा होकर जम जाने पर  इसे अपनी पसंद के टुकडों में काट लें.\n\n•इसे आप  तुरंत भी खा सकते हैं और एअर टाईट कंटेनर में भर कर भी रख सकते हैं.  इसे फ्रिज़ में ना रखकर बाहर ही रख.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.m8);
                       txt = ("•पैठा  - 1 किलो \n•चीनी - 250 ग्राम ( 1 /4 कप)\n•घी - 50 ग्राम(1 /4 कप)\n•मावा  - 250 ग्राम (एक कप)\n• काजू - 2 टेबल स्पून  (एक काजू के 5-6 टुकडे कर लें)\n• नारियल - कदूकस क्रिया हुआ (2 टेबल स्पून)\n• पिस्ते - 1 टेबल स्पून(बारीक काट लें)\n•बादाम - 1 टेबल स्पून (बारीक काट लें)\n•छोटीं इलाइची - 6-8 (छील कर क्रूट लें)");
                        txt2 = ("•पैठे  क्रो मोटा- मोटा छील कर इसका छिलका उतार दें. इसमें से सारे बीज और स्पंजी  गूदा निकाल कर सरल गूदे क्रो बहु- बडे टुकडों में काट कर कदूकस कर लें.\n\n•एक बर्तन में कदूकस किए पेठे के बने लायक पानी भर लें. इसमें कदूकस क्रिया कदू डालें इसे अच्छे से 2 बार डुबाकर धोलें. अब इसे अच्छे से निचोड़  लें.\n\n• एक कढाई में घी गरम करें और उसमें निचोड़ा हुआ पेठा डाल कर भून लें. जब पेठे का रंग बदलने लगे तो इसमें चीनी डाल कर मिला लें. अब इसे धीमी आंच  एर बीच-बीच में चलाते हुए पकाइये .\n\n• एक अलग कढाई में मावा डाल कर इसे हल्का गुलाबी होने तक अलग कढाई में मावा  डाल कर इसे हल्कऱ गुलाबी होने तक भून लें.\n\n• पैठे  और चीनी में बिलकुल पानी  ना रहने एर इसमें भूना हुआ मावा  डाल कर मिला लें. इसे 3-4 मिनट उबालते  हुए भूनें. अब थोडे से कटे  हुए सूखे  मेवे बचा कर बाकी   सारे मेवे हल्वे में डाल र्दे. गैस बंद कर दें और हल्वे में इलायची पाउडर डाल कर मिला लें.\n\n• गांठे का स्वादिष्ट हलवा  तैयार हे. इसे किसी बाउल में निकाल लें और बचाए हुए मेवे डाल कर सजाए. ताजा-ताजा और गरम-गरम हल्वे क्रो मजे से खाए. बचे हुए हल्वे क्रो फ्रिज़ में रखकर 7 दिन तक आराम से खा सकते हैं.\n\n• आप  पेठे के हल्वे क्रो जमने लायक क्रंसिसटेन्सी तक एका कर किसी थाली क्रो चलनी करके इसे थाली में डाल कर जमा लें और फिर टुकडों में काट कर पेठे की बर्फी   भी तैयार कर सकते हैं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.m9);
                       txt = ("•एक बड़ी लौकी\n• 250 ग्राम चीनी \n•250 ग्राम मावा\n• 5 गाम इलायची पाउडर\n•25 गाम को हुए बादाम\n• 20 गाम किशमिश (या अद्भापक्री पसंद के जन्य ड्राई क्रूट्स)\n• 40 0 गाम देसी घी ");
                        txt2 = ("•लौकी का हलवा बनाने के लिए सबसे पाले लौकी क्रो छीलकर अच्छी  तरह से धो लें । फिर इसे बारीक कस लें ।\n\n•अब एक गहरे तल वाले पैन  में लौकी और चीनी क्रो एकसाथ  मिलाएं व गैस एर रखें ।\n\n• इसके बाद धीमी आंच पर तब तक पकाये , जब तक कि पानी  सूख न जाए । यह ध्यान रखें कि इसे लगातार चलाते रहें वरना  इसमें गुठले पड़ सकते हैं । इसे बहुत ज्यादा सूखने भी न दें । इसके बाद मावा लें और इसे मैश कर मिश्रण में मिलाएं । ध्यान रखें कि यह अच्छी तरह से मिल जाए।\n\n•फिर देसी घी डालकर अच्छी तरह भूनें । अब इसमें अपनी मन पसंद  के ड्राई फ्रूट्स  डालकर थोड़ी  देर तक पकाये ।\n\n•आंच  से उतारकर थोडा ठंडा करें और डिश में परोसकर ऊपर से इलायची पाउडर डालें । स्वादिष्ट लौकी का हलवा सर्व करने के लिए तैयार हैं ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.m10);
                       txt = ("•स्ट्रॉबेरी- 300 ग्राम \n•सूजी- 300 ग्राम (1/2 व्य)\n•चीनी- 300 ग्राम (1/2 व्य)\n•घी- 300 ग्राम \n•काजू- 6-7\n•बादाम … 6-7\n•किशमिश - 1 छोटी चम्मच-पिस्ते - 30-32\n•इलायची - 4");
                        txt2 = ("•स्ट्रॉबेरी  क्रो अच्छी  तरह धोकर इसके डंढ़ल हटा कर इसे छोटे-छोटे टुकडों में काट लीजिए और मिक्सर में डालकर इसकी पूरी  बना लीजिए.\n\n•1पैन गैस पर  रखिये उसमें घी डाल दीजिये है थोडा सा घी बचा लीजिये, जिसे बाद में यूज करेंगे. घी मेल्ट होने के बाद उसमें सूती डाल दीजिये और कलछी की  सहायता से लगातार चलाते हुए धीमी और मिडियम आंच एर सूती के गोल्डन ब्राउन होने तक भून लीजिए.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 10: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.m11);
                       txt = ("•तरबूज के छिलके -600 ग्राम \n•खोया 2oo ग्राम \n•चीनी 200  ग्राम\n• छोटी इलाइची 5 -6\n• काजू 20-25\n• देसी घी -2  टेबल स्पून");
                        txt2 = ("•तरब्रूज के मोटे छिलके क्रो छील लीजिये, डाके ग्रीन सख्त छिलका छील कर हटा दीजिये, सारे छिलके छील लीजिये\n\n•तरब्रूज के छिलकों क्रो कदूकस कर लीजिए. पैन  क्रो गैस एर रखें, इसमें 1 चम्मच घी डालकर मेल्ट कर लीजिए अब\n\n• इसमें कदूकस किए हुए तरबूज के छिलके डालकर ढककर के 5 मिनिट के लिए पका लीजिए.\n\n• काजू क्रो छोटे-छोटे टुकडों में काट कर तैयार कर लीजिए और इलायची क्रो क्रूट कर पाउडर बना लीजिए.\n\n•छिलकों क्रो चैक क्रीजिए और चला  फिर से 5 मिनिट ढककर के पकने दीजिए और फिर से चैक क्रीजिए छिलकों को  नरम होने तक उठाने दे .इन्हें पकने में लगभग 15 मिनिट का समय लग जाता है .\n\n•छिलको  क्रो अच्छे से पक जाने पर  और पानी  समाप्त हो जाने पर  इसमें चीनी डाल कर मिक्स क्रीजिए और धीमी आंच एर ढककर के पकने दीजिए और फिर चैक क्रीजिए.\n\n•छिलको को  अच्छे से पक जाने पर  और पानी  समाप्त हो जाने एर इसमें चीनी डाल कर मिक्स क्रीजिए और धीमी आंच पर ढककर के पकने दीजिए और फिर चैक क्रीजिए.\n\n•चीनी के धुल जाने पर  अब हलवे क्रो खुले ही पकाए ताक्री सारा जूस समाप्त हो जाए\n\n• एक पैन  क्रो गैस पर  रखें इसमें 1 चम्मच घी डाल दीजिए और घी पिघलने  पर  मावा  डालें, मावा क्रो मीडियम आग  एर लगातार चलाते हुए भून लीजिए. मावा  का हल्कऱ कलर चेंज होने पर  भून कर तैयार हो जाता हे. गैस बंद कर दीजिए और मावा  क्रो थोडा सा ठंडा होने दीजिए.\n\n•हलवे के  सूख मावे  एर इसमें भूना हुआ  मावा, काजू  डालकर अच्छे से मिक्स कर लीजिए.गैस धीमी ही रखें, हलवे में मावा  के अच्छे से मिक्स हो जाने पर  मावा  बनकर तैयार हे. इसे प्याले में निकाल लीजिए.\n\n• हलवे के ऊपर काजू डालकर इसको  गार्निश क्रीजिए स्वादिष्ट तरबूज़ के छिलकों का हलवा बनकर तैयार हे.तरबूज़ के छिलके के हलवा क्रो फ्रिज में रखकर 7 दिन तक खाया जा सकता हे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 11: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.m12);
                       txt = ("•बाजरे का आटा -1/2 कप (80 ग्राम )\n•चीनी -1/2 कप (100 ग्राम )\n•घी -1/2 कप(80 ) ग्राम\n• काजू 8 -10\n• किशमिश 20 -25\n• नारियल -1 टेबल स्पून (कट्टा हुआ )\n• इलाइची -4 -5");
                        txt2 = ("•1पैन में घी डाल कर गरम कीजिये. घी के हलवा  गरम होने एर बाजरे का आटा  डाल दीजिए. धीमी और मध्यम आच एर आटे  क्रो लगातार चलाते हुये, हल्का  ब्राउन, कलर डार्क होने और अच्छी  महक आने  तक भून लीजिये.अब इसमें 1 1/1 कप पानी  डाल दीजिए और चीनी डाल कर अच्छी  तरह से मिला दीजिए और मध्यम आग  पर  पकने दीजिए और तब तक पकाए जब तक कि हलवा गाढा न हो जाए\n\n• काजू क्रो छोटे-छोटे टुकडों में काट लीजिए, इलायची छिलकर क्रूट कर पाउडर बना लीजिए.\n\n•हलवे के गाढा होने एर इसमें काजू किशमिश, नारियल और इलाइची  का पाउडर डालकर सभी क्रो अच्छे से मिला दीजिए और 2 मिनिट के लिए और पका  लीजिए. बाजरे के आटे  का स्वादिष्ट हलवा बनकर तैयार हैं,हलवा क्रो प्याले में निकाल लीजिए.\n\n•ऊषर से थोडा सा घी का डालकर सजाइये और परोसिये. बाजरे के आटे  के हलवे फ्रिज में रखकर के 3-4 दिनों तक आराम से खाया जा सकता हैं.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.m13);
                       txt = ("•आटा- 100 ग्राम (एक कप)\n•घी - 80 ग्राम (एक कप)\n•चीनी- 100 ग्राम ( आधा  कप)\n•काजू… 10 (छोटे टुकडों में काट लीजिये)\n• पिस्ते 8-10 (लम्बाई में बारीक काट लीजिये)\n•किशमिश- 1 टेबल स्पून  (डंठल हटाकर धो लीजिये)\n•छोटी इलाइची - 4-5 (बारीक कूट लीजिये)");
                        txt2 = ("•आटे को छानिये , कढाई में आधा  घी डाल कर आटे  क्रो चमचे से लगातार चलाते  हुये, ब्राउन होने तक और आंच  महक आने  तक मध्यम आग पर  भून लीजिये.\n\n• भूने हुये आटे  में,आटे की  मात्रा का तिगुना पानी(3 कप पानी) और चीनी डाल कर मिला दीजिये, आटे क्रो तब तक चमचे से चलाते  जाइये, जब तक उसको सारी गुठलियों खत्म  हो जाय, कटे हुए  काजू और किशमिश भी मिला दीजिये और हलवे को धीमी आंच पर पकने दीजिये.हलवे दोनों चमचो से  चलाते रहिये ताकि हलवा कढाई के तले  लगे  .\n\n•हलवा गाड़ा  होने के बाद बचे घी से आधा  घी डाल कर मिलाइये और चमचे से लगातार चलाते हुये हलवे क्रो पकाइये, हलवा गाड़ा  हो गया है और कढाई के किनारों से भी नहीं चिपक रहा पानी  कि हलवा बन चुका हे. आग बन्द कर दीजिये और हलवे में इलाइची और बचा हुआ घी डाल कर मिलाइये.\n\n• आटे  का हलवा  तैयार है आटे  के हलवे को प्याले में निकालिये और बारीक कटे हुए काजू और पिस्ते से सजाइये. गरमा गरम आटे का हलुआ षरोसिये और खाइ .\n\n•आटे के हलवे  में डाले गये सूखे मेवे जाए अपने पसन्द से कम ज्यादा कर सकते हैं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.m14);
                       txt = ("• बादाम - 200 ग्राम (एक कप)\n•दूध - एक कप\n•चीनी - 200 ग्राम (एक कप)\n•घी - 100 - 125 ग्राम (आधा कप से थोडा अधिक\n•केसर - 25-30 टुकडे\n•इलाइची - 6-7 (छील कर कूट लीजिये");
                        txt2 = ("•बादाम क्रो पीने के पानी में 5-6 घंटे के लिये भिगो दीजिये,अगर आप  जल्दी हलवा बनाना चाहते है तब पानी क्रो गरम क्रीजिंये और गरम पानी में बादाम क्रो डाल कर रखिये, ये 2-3 घंटे में ही फूल जाते हैं.\n\n• भीगे हुये बादाम के छिलके उतार लीजिये. छिले बादाम क्रो पर्याप्त दूध डाल कर मिक्सी में थोडा सा दरदरा पीस लीजिये (एक दम बारीक मत दिजिये) .\n\n• भारे तले वाली कढ़ाई या नॉनस्टिक  कढाई लीजिये. बादाम का हलवा बनाने के लिये नॉनस्टिक  कढाई अधिक सुविधाजनक होती हे.\n\n•नॉनस्टिक  कढाई में एक टेबल स्पून  घी डाल कर गरम कीजिये, गरम घी में बादाम का पेस्ट और चीनी डालिये,मिश्रण को  कलछी से लगातार चलाते हुये भूनिये.\n\n•बचे हुये दूध क्रो गरम करके उसमें केसर डाल कर घोलिये और ये केसर दूध हलवा में मिला कर भूनते  रहिये, एक टेबल स्पून  घी भी डालिये, अगर आप  हलवा में कलर डालना चाहें तो एक पिंच कलर भी इसी समय मिला दीजिये और हलवा क्रो गाड़ा होने तक भूनते  रहिये. आप  देखेगें कि बादाम हलवा सै बहुत ही अच्छी  सुगन्ध आने लगी है बह कढाई के किनारों से भी नहीं चिपक रहा हे. बचा हुआ  घी भी हलवा में डाल कर मिला दीजिये. बादाम हलवा बन चुका है आग  बन्द कर दीजिये और हलवे में इचाइची डाल कर अच्छी …तरह मिला दीजिये\n\n•स्वादिष्ट बादाम हलवा तैयार है बादाम हलवा क्रो प्याले में निकालिये. गरमा गरमा बादाम हलुआ  परोसिये और खाइये,ये बादाम हलवा तो ठंडा भी बडा स्वादिष्ट लगता हे. बादाम हलवा  क्रो फ्रिज में रखकर 6-7 दिन तक खा सकते हैं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.m15);
                       txt = ("•स्वीट कार्न - 400 ग्राम (2 कप स्वीट कार्न पेस्ट)\n•घी- 200 -ग्राम ( 1 कप)\n•मावा  - 200 ग्राम (3/4 कप) कदूकस कर लीजिये\n•चीनी - 250 ग्राम (1 /4 कप से थोडी सी ज्यादा)\n•दूध- 2 कप\n•काजू- 15- 20 (एक काजू क्रो 7- 8 टुकडे कटे  हुये काट लीजिये)\n•छोटी इलाइची - 5-6 छील कर पीस लीजिये\n• पिस्ते - 7-8 (बारीक काट  लीजिये)");
                        txt2 = ("•स्वीट कार्न को  साफ पानी से अच्छी  तरह धो लीजिये.मिक्सर में डालिये और बारीक पीस लीजिये.\n\n• भारी तले की  कढाई में घी डालिये और गरम कीजिये , गरम घी में पिसे हुये स्वीट कार्न डाल दीजिये, मीडियम गैस एर अच्छी से चलाते हुये भूनिये, जब स्वीट कार्न पेस्ट का कलर बदल जाय, अच्छी  महक आने  लगे, या फिर स्वीट कार्न पेस्ट कढाई से सतह से अलग होता दिखाईं देने लगे तो आपका यह स्वीट कार्न पेस्ट भून कर तैयार हे.\n\n•इस भूने हुये स्वीट कार्न पेस्ट में मावा  डाल दीजिये और 4-5 मिनट तक करछी  से चलाते हुये भूनिये (मावा क्रो अलग से भी भूना जा सकता हैं).\n\n• किसी बर्तन में चीनी और दूध डालकर गरम कीजिये,उबाल आने  के बाद चीनी घुलने तक पकाइये. भूने हुये स्वीट कार्न पेस्ट और मावा  में डाल कर मिलाइये, साथ ही थोडे से काजू  के टुकडे बचाकर भी मिला दीजिये, करछी चलाते हुये पकाइये, किनारे झाग आने  लग जायं और मिश्रण फूलने लगे, मिश्रण क्रो जमने वानी कंसिस्टेंसी तक  पका  लीजिये, गैस बन्द कर दीजिये. मिश्रण में इलाइची डालकर मिला दीजिये .\n\n•एक थाली  में घी लगाकर चिकना कीजिये . मिश्रण क्रो थाली में डाल कर घी लगे चमचे से एक तरफ  फैला  दीजिये, बारीक कटे  हुये काजू और पिस्ते ऊपर से डाल कर चमचे से दबा दीजिये. एक या आधे  घंटे में यह बर्फी  जमकर तैयार हो जायेगी. चाकू से स्वीट कार्न बर्फी  क्रो अपने मन पसन्द आकार  में काट लीजिये. लीजिये बन गई हमारी स्वीट कार्न बर्फी , खाइये, कितनी स्वादिष्ट है . बची हुई स्वीट कार्न बर्फी  क्रो एअर टाइट कन्टेनर में भर कर रख दीजिये . एक सप्ताह तक  कन्टेनर से बर्की निकालिये और खाइये. स्वीट कॉर्न  बर्फी  व हलवा 15/12  मिश्रण फूलने लगे, मिश्रण क्रो जमने वाली  कंसिस्टेंसी  तक पका  लीजिये, गैस बन्द कर दीजिये. मिश्रण में इलाइची डालकर मिला दीजिये .\n\n• एक थाली में घी लगाकर चिकना कीजिये . मिश्रण क्रो थाली में डाल कर घी लगे चमचे से एक जैसा फैला दीजिये, बारीक कटे हुए काजू और पिस्ते ऊपर से डाल कर चमचे से दबा दीजिये. एक या थोड़े  घंटे में यह बर्की जमकर तैयार हो जायेगी. चाकू से स्वीट कार्न बर्फी  क्रो अपने मन पसन्द आकार  में काट लीजिये. लीजिये बन गई हमारी स्वीट कार्न बर्फी , खाइये, कितनी स्वादिष्ट हे. बची हुई स्वीट कार्न बर्फी  क्रो एअर टाइट कन्टेनर में भर कर रख दीजिये . एक सप्ताह तक सभी  कन्टेनर से बर्फी  निकालिये और खाइये.\n\n• स्वीट कार्न हलवा -अगर जाए स्वीट कार्न हलवा खाना चाहें तो और भी आसान, भूने हुये स्वीट कार्न पेस्ट और मावा  में दूध चीनी मिलाइये, करछी से चलाते हुये हलवा जैसा गाड़ा होने  तक पका  लीजिये, स्वीट कार्न हलवा तैयार है इलाइची डाल कर मिला दीजिये . हलवे क्रो प्याले में निकालिये, कटे  हुये काजू और पिस्ते डाल कर सजाइये\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                }

                break;
            }

            case "Festival Food Receipes": {
                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f1);
                       txt = ("•बेसन - 500 ग्राम (5 कप)\n•घी - 400 ग्राम (2 कप)\n•चीनी - 500 ग्राम (2.1 /2 कप)\n•इलाइची - 8-10\n•काजू- 50 ग्राम  1/4 कप)");
                        txt2 = ("•बेसन को  एक बर्तन में छान कर निकालिये और कढाई में घी गर्म कर बेसन डाल कर कलछी से चलाकर भून लीजिये(बेसन मोटा वाला लें, मोटे बेसन के लड्रडू ज्यादा स्वादिष्ट लगते हैं) ।\n\n•जब बेसन का रंग ब्राउन होने लगे और बेसन से सुगंध आने  लगे तो उसमें एक टेबल स्पून  पानी के छीटे लगा दीजिये। इससे बेसन में झाग ज्यादा और उसमें दाने बन जाएंगे , जो कि लड्रडू का स्वाद बढा देंगे । इसके बाद झाग खत्म होने तक बेसन को  भून लीजिंये । अब गैस बंद कर दीजिये और भूने हुए बेसन को  ठंडा करने के लिये हवा में रख दीजिये। एक काजू  के 6-7 टुकडे करते हुए सारे काजू काट  लीजिये और इलाइची को  छील कर उसके दानों को  बारीक पीस लीजिये। इसमें चीनी को  पीस कर डाला जा सकता है लेकिन पिसी चीनी से लड्रडू उत्तने स्वादिष्ट नहीं बनते इसलिये हम चीनी को  पिघला कर उसे भी दाने दार  बना देंगे और उस त्तगार को  बेसन में मिलाएगे ताकि लड्रहुँ अधिक स्वादिष्ट बनें । आप  चाहें तो तगार   या बूरा बाजार से भी ला सकते हैं ।\n\n•बेसन  अब ठंडा हो गया है । इसमें तयार, इलाइची व काजू के टुकडे डालिये और अच्छी  तरह मिला कर गोल- गोल लड्रडू बना लीजिये ।\n\n•बेसन  के लड्रडू तैयार है ।आप  चाहें तो इन्हें अभी गरमा गरम खाइये या फिर एअर टाइट कटेनर में बंद कर के 2 महीने तक कभी भी खाइये ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f2);
                       txt = ("•छोटा चावल -300 ग्राम (11 /2  कप )\n• पाउडर चीनी 100 ग्राम (आधा कप )\n•दही या दूध 1 टेबल स्पून\n• घी -२ टेबल स्पून\n• तिल -२ टेबल स्पून\n• तलने के लिए घी");
                        txt2 = ("• छोटे, नये चावल ले लीजिये, चावलों को  साफ कीजिये,धोइये और भिगो दीजिये. चावल 3 दिनों तक भीगे रखने हैं लेकिन 24 घंटे बाद पानी  बदल दीजिये.\n\n•अब चावलों में से पानी  निकाल दीजिये, चावलों को  किसी साफ मोटे सूती कपडे के ऊपर छाया में फैला दीजिये, 1 या\n\n• 1/2 घंटे में चावलों का पानी  सूख जाता हे(चावल पूरी तरह नहीं सूखने चाहिये वे नम ही रहें).\n\n•इन चावलों को  मिक्सी से मोटा आटे  जैसा पीस कर एक बर्तन में निकाल लीजिये, आटे  को  छाननी में छाना जा सकता हे. चीनी पाउडर, चावल का पिसा आटे  और घी को  अच्छी तरह मिलाइये. दही को  मथ कर या दूध चम्मच से थोडा डालिये और इस मिश्रण को  इसी दही या दूध को सहायता से सख्त आटे  को तरह गूंध  लीजिये. आटे  को  10-12 घंटे के लिये ढक कर रख , जाता नरम हो कर सैट हो आटा  हे.\n\n•कढाई में घी डाल कर गरम क्रीजिंये(कढाई में घी इतना डालिये कि अनरसे अच्छी  तरह  तले जा सके).\n\n•गोल अनरसे बनाने के लिये आटे  से छोटी छोटी लोइयां लेकर, तिल में लपेट कर , गोल करके, 4-5 अनरसे कढाई में डालिये, करछी से हिला  डुला कर ब्राउन होने तक तल लीजिये, तले हुये अनरसे प्लेट में नैपकिन पेपर बिछा कर रखिये और अनरसे बनाकर फिर से घी में डालिये इम्हें भी तल कर निकाल लीजिये, इसी तरह सारे आटे  से अनरसे बनाकर तैयार कर लीजिये. गरमा गरम अनरसे तैयार हैं.\n\n• चपटे अनरसे के लिये आटे  से छोटी छोटी लोइयां बनायें,तिल में लपेटे, फिर से गोल करें तिल आटे  में पूरी तरह चिपक जायं, अब हथेली से दबाकर चपटा कीजिये, गरम घी में डालिये, एक बार में 2-4 अनरसे बना कर घी में डाल दीजिये, अनरसे के ऊपर गरम घी उछाल कर , या हल्के हाथ से पलट कर, हल्कऱ ब्राउन होने तक तल लीजिये. तले हुये अनरसे प्लेट में नेपकिन पेपर बिछाकर, निकाल कर रखिये. दूसरे अनरसे बनाकर फिर से घी में डालिये और तल कर निकाल लीजिये, इसी तरह सारे आटे  से अनरसे बनाकर तैयार कर लीजिये. लीजिये गरमा गरम अनरसे तैयार हैं.\n\n• आए  इन अनरसों को  अभी खाइये बहुत स्वादिष्ट बने हैं.ठन्डे  होने एर कन्टेनर में भास्कर रख दीजिये और फिर 15 दिन तक कभी भी खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f3);
                       txt = ("•चावल  का आटा  - 200 गाम या 2 कप \n•उरद दाल का आटा  - 100 गाम या 1 कप\n•मूंग दाल का आटा  - 100 गाम या 1 कप\n•ब्वेसन- 300 गाम 1 कप\n•तिल - 2 टेबल स्पून \n• अजवायन - 1 छोटी चम्मच\n•जीरा - 1 छोटी चम्मच\n•लाल मिर्च - 1 छोटी चम्मच से कम(स्वादानुसार)\nहींग - 1 /4 छोटी चम्मच\n• नमक - स्वादानुसार 1/4 छोटी चम्मच)\n•तेल- 150 ग्राम(3/4कप)");
                        txt2 = ("•किसी बर्तन में सारे आटे  मिला कर छान कर निकल लीजिये.\n\n•सारे मसाले और तेल डालिये, सारी चीजें हाथ से अच तरह मिला लीजिये.\n\n•पानी की  सहायता से नरम आटा गूथ लीजिये. गुंथे हुये आटा को  20 - 30 मिनिट के लिये ढक कर रख दीजिये.चकली बनाने के लिये आटा तैयार हैं.\n\nगुथे आटा से थोडा सा आटा (लगभग साधा कप आटा)और लम्बा जाकर देते हुये आटा को  मशीन में डालिये, मशीन को  बन्द कीजिये. कोई मोटी पोलिथिन सीट लेकर किंचन टाप एर बिछाया और मशीन को  ऊपर से दबाब देते हुये, गोल घुमाते हुये, गोल चकली पोलिथिन सीट एर बनाइये, 6-7 चकली बनाकर पोलिथिन सीट एर तैयार कर लीजिये.\n\n•कढाई में तेल डालकर गरम कीजिये, पोलिथिन सीट से चकली इस तरह उठाइये कि चकली अपने आकार  में रहे,चकली उठाकर गरम तेल में डालिये (चकली तलने के लिये तेल ज्यादा गरम नहीं होना चाहिये, चकली को  मीडियम आग  एर ही तलना हैं) 5-6 या जितनी चकली तेल में एक बार तली जा सके उतनी चकली डाल दीजिये और पलट कर चकली को  ब्राउन होने तक तल कर निकाल कर किसी थाली या प्लेट में निकाल कर रखिये.\n\n•सारे आटे  से इसी तरह सारी चकली बना कर तैयार कर लीजिये.\n\n•चावल की  चकली तैयार हैं. आप  इम्हें अभी खाइये और बची हुई चकली एअर टाइट कन्टेनर में रख लीजिये जब भी आपका मन करे  डिब्बे से चकली निकालिये और 2 महिने तक आप  ये चकली खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f4);
                       txt = ("•1 कप मैदा\n• 2 चम्मच  रवा\n• 2 चम्मच  घी\n• 1/4 कप दूध\n• 1 कप अंजीर\n•3/4 कप खजूर\n• 20 काजू\n• 20 पिस्ते\n• 1 चम्मच  इलायची पावडर\n• 1 चम्मच  खसखस\n• घी");
                        txt2 = ("•एक गहरे कटोरे में मैदा, रवा और घी मिक्स करे। फिर उसमें दूध डाल कर गूथ लें । आटा  थोडा कठोर होना चाहिये। फिर इसे किसी कपडे से ढांक कर किनारे रखे  ।\n\n•एक दूसरे कटोरे में भरावन की  सभी सामग्रियों क्रो डालें,बस दूध ओर घी ना मिलाएं।\n\n• इसमें खजूर और अंजीर  मिले हुए हैं इसलिये सामग्री मे शक्कर की आवश्यकता नहीं है  ।\n\n•अब गुझिया बनाने की प्रक्रिया शुरु करे।\n\n•आटे  को छोटी सी लोई ले कर उसे खेल कर गुझिया वाले सांचे में रखें ।\n\n• फिर बीच में 1 चम्मच भरावन सामग्री रखें और गुझिया के सांचे को  बंद कर के गुझिया बनाएं ।\n\n• गुझिया को  सील करने के लिये हल्कऱ सा पानी  दूध लगाएं ।\n\n•इसी तरह से ढेर सारी गुझिया तैयार करें और उसी एक एक करके बैकिंग  ट्रे पररखें।\n\n•बेकिंग ट्रे एर सबसे पहले  घी लगा लें ।\n\n•अब जीवन को  180 डिग्री एर प्रीहीट कर लें और उसमें गुझिया को  25 मिनट तक बेक करें।\n\n•जब गुझिया तैयार हो जाए तब उसे ठंडा कर के एयरटाइट कटेनर में रख दें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f5);
                       txt = ("•1 कप बारीक घिसा नारियल\n• 1/4 कप काजू\n• 1 /4 कप बादाम\n• 1 /2 कप शक्कर \n• 1 /2 कप पानी\n• थोडे से केसर 5 चम्मच गरम दूध में भिगोया हुआ\n• 4 चम्मच घी");
                        txt2 = ("•सबसे पहले  गरम पानी में काजू और बादाम को  कुछ देर के लिये भिगो दें, जिससे बादाम का छिलका निकल आए  और काजू मुलायम हो जाएं ।\n\n•उसके बाद काजू बादाम और घिसे नारियल को  थोडे सा पानी मिला कर पीस कर पेस्ट  बना लें ।\n\n•अब एक कढाई में शक्कर  और पानी मिला कर धीमी आंच यर लगातार चलाते हुए पकाये  ।\n\n•जब यह घोल गाढा हो जाए तब उसमें पिसा नारियल और काजू वाला पेस्ट मिलाएं ।\n\n• फिर इसमें केसर वाला घोल मिलाएं ।\n\n•ऊयर से घी डालें और लगातार चलाएं ।\n\n•फिर आंच बंद कर दें और एक बार चला कर इसे गरमा गरम सर्वे करे\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f6);
                       txt = ("•मावा  (खोया) - 250 गाम (1/4 कप)\n•पनीर- 100 गाम (1/2 कप )\n•मैदा (रिफाहुँन्ड फ्लोर ) - 20 - 30 (2-३ टेबल स्पून)\n•काजू - 1 टेबल  स्पून  ( एक काजू 8 टुकड़े के हिसाब से  काट लीजिये )\n• किशमिश - टेबल म्पून\n•चीनी - 600 गाम (3 कप )\n•घी - गुलाब जामुन तलने के लिये");
                        txt2 = ("•मावा, पनीर  और मैदा को  एक चौडे और बडे बर्तन में रखकर तब तक मले  जब तक कि वह  नरम, चिकना गूथे हुये आटे  जैसा न लगने लगे. गुलाब जामुन बनाने के लिये मावा  तैयार हैं.\n\n• गुलाब जामुन तलने से पहले  चाशनी बना कर तैयार कर लीजिये. चाशनी बनाने का तरीका नीचे दिया गया हैं. चाशनी तैयार हो गई हैं.\n\n• तैयार मावा  से थोडा सा मावा  ( करीब एक छोटी चम्मच ) अंगुलियों की  सहायता से निकालिये, उसे हथेली एर रखकर चपटा करके 3-4 काजू के टुकडे और एक किशमिश उसमें भरने के लिये उसके ऊपर रखें. मावा  को  चारों और से उठा कर काजू किशमिश को  मावा  के अन्दर बन्द कर दीजिये,अब दोनों हथेलियों के बीच रख कर गोल कीजिये , मावा का गोला अच्छी  तरह बन जाने के बाद प्लेट में रख लीजिये.सारे गोले इसी तरह तैयार कर लीजिये.\n\n•कढाई में घी डाल कर गरम कीजिये. गुलाब जामुन तलने से पहले  टैस्ट कर सकते हैं.\n\n•3-4 गोले, कढाई में डालें और तलें ( गैस की फ्लेम  धीमी रखें. गुलाब जामुन को तलते समय उस एर कलछी न लगायें बल्कि गरम गरम घी उस पर कलछी से डालें और ब्राउन होने के बाद हल्के से हिला  डिंला कर तलें, गुलाब जामुन के चारों तरफ ब्राउन होने तक तल लीजिये. तले गुलाब जामुन कढाई से निकाल कर प्लेट में रखिये. थोडा ठंडा होने एर, 2 मिनिट बाद चाशनी में डूबा  दीजिये. इसी तरह सारे मावे  के गोल गोल गुलाब जामुन बनाकर, तल कर चाशनी में डाल कर डूबा  दीजिये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f7);
                       txt = ("•बेसन 200 ग्राम \n•तेल - 50 ग्राम (1/4 कप)\n•नमक - स्वादानुसार ( 1 /2 छोटी चम्मच)\n•काली मिर्च … 1 /4 छोटी चम्मच ( दरदरी कूट लीजिये)\n• अजवायन - 1 /4 छोटी चम्मच\n•लोंग -4- 5 ( दरदरी कूट लीजिये)\n• दालचीनी - 1 इंच टुकडा दरदरी कुटी हुई\n•बकिंग सोडा … 1 /4 छोटी चम्मच से थोडा कम\n•तेल - सेव  तलने के लिये");
                        txt2 = ("•बेसन को  किसी बर्तन में छान कर निकाल लीजिये, तेल,नमक, अजवायन, लोंग, दाल चीनी, काली मिर्च और ब्रेकिंग सोडा डाल कर मिलाइये. गुनगुने पानी की  सहायता से नरम आटा  गूथ लीजिये (आटा चपाती बनाने के लिये गूथा गये आटे  से भी नरम होना चाहिये) आटे  को  ढककर 10 मिनिट के लिये सैट होने के लिये रख दीजिये. सेव  बनाने के लिये बेसन  का गूथा हुआ आटा  तैयार हे.\n\n•कढ़1ईं में तेल डाल कर गरम दिजिये, गरम तेल को  चैक करने के लिये, थोडा सा आटा  तोड़ कर गरम तेल में डालिये जाए देखेंगे कि चह आटा  तुरन्त कढाई के तले से उठ कर तेल के ऊपर आकर  तैरने लगता है सेव  तलने के लिये तेल पर्याप्त गरम हे.\n\n•सेव बनाने के लिये झावे प्रयोग में लाये जाते  हैं, जितने मोटे सेब बनाने होने हैं, उतनी बहीं जाली  का छाया प्रयोग में लाया जाता हैं, अगर आप  झावे से सेब बनाना चाहते  हैं तो झया  आपके पास होना ही चाहिये. झावे को  कढाई के ऊपर रखिये, अब आप आटे  से एक चौथाई आटा  निकालिये और झावे एर रखिये, हाथ से आटे  को  दबाब दीजिये, झावे के नीचे से सेब निवल कर तेल में जाने लगेगें, सारे आटे को  दबाकर सेव निकाल दीजिये, सेव यदि झावे से चिपके हों तो चाकू की  सहायता से हटा कर तेल में गिरा दीजिये. सेवो  को  सिलने एर कहिये और हल्कऱ ब्राउन होने तक तल कर निकाल लीजिये.\n\n•तले सेब किसी प्लेट या थाली में नेपकिन पेपर बिछा कर उस एर रखिये. इसी तरीके से फिर से आटा  झावे के ऊपर रखिये और दबाइये  तथा सेब बनायें और तल लीजिये. सारे सेब इसी तरह बना कर तैयार कर लीजिये.\n\n•झावे की  जगह सेब बनाने की  मशीन का भी इस्तेमाल कर सकते हैं. ये मशीन अनेकों माडल में और लगभग हर किंचन के बरतन को दुकान पर  मिल जाती  हैं.\n\n•अगर आप  यह सेब मशीन से बनाना चाहते  हैं, तब जितने मोटे सेब बनाने हैं उसके अनुसार जाली  चुन कर मशीन में लगाइये, गूथा हुआ आटा  मशीन में भरिये, मशीन को  ड़ख कर  बन्द कीजिये, मशीन को  गरम तेल के ऊपर ले जाइये, तथा हाथ से हत्थे को  दबाब दीजिये, सेब जाली  से निवल कर तेल में गिरने लगेगें, जितने सेब एक बार में तले जा सके उतने सेब कढाई में डालिये और मशीन हटा लीजिये.सेवो को सिकने पर पलटिये और हल्का  ब्राउन होने तक तल कर .\n\n• ये सेब किसी प्लेट या थाली में नेपकिन पेपर बिछा कर उस एर रखिये. इसी तरीके से फिर से आटा  मशीन के अन्दर डालिये, मशीन को  तेल के ऊपर ले जाइये और पिस्टन  को दबाइये  तथा सेब बनाइये और तल लीजिये. सारे सेब इसी तरह बना कर तैयार कर लीजिये.\n\n•बेसन के नमकीन सेव तैयार है,सेब थोड़ी देर ठन्डे होने दीजिये, सेब होने के आए  जाए देखिये ये सेब कितने कुरकुरे हो गये हैं, ताजा ताजा बेसन  के नमकीन सेब परोसिये और खाइये. बचे हुये सेब किसी एअर टाइट कन्टेनर में रख लीजिये, जब भी आप  का मन हो  ये नमकीन सेब कन्टेनर से निकालिये और खाइये. बेसन  मसाला नमकीन सेब 2 महिने तक भी खराब नहीं होंगे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f8);
                       txt = ("•पोहा या चिवड़ा - 200 ग्राम ( 2 कप)\n•मूंगफली के दाने - 200 ग्राम ( 1 कप)\n•पका नारियल - 2-3 इंच लम्बा टुकडा (पतले पतले टुकडे काट लीजिये)\n• नमक - स्वादानुसार ( अक्चधा छोटी चम्मच)\n•काली मिर्च - आधा  छोटी चम्मच\n•चाट मसाला - आधा  छोटी चम्मच\n•तेल - 100 ग्राम ");
                        txt2 = ("•मोटा पोहा  बाजार से ले जाइये, अच्छी  तरह साफ कर लीजिये.\n\n•कड़ाईं में तेल डालकर गरम दिजिये, गरम तेल में जितना पोहा (करीब आधा  पोहा) डालिये, आग  धीमी कर दीजिये और अच्छी से चलाते हुये पोहा का तलिये यह आकार  में लगभग दुगना फूल जाता है लेकिन कलर गाड़ा  ही रहे. तले पोहे निकाल कर छलनी हुलिया में रखिये ताकि उससे अतिरिक्त तेल हट जाय. सारे पोहे तल कर निकाल लीजिये.\n\n•अब इसी ये नारियल के टुकडे डाल कर बिलकुल हल्के ब्राउन होने तक तल कर निकाल लीजिये, बचे तेल में मूंगफली के दाने डालिये, धीमी आंच  एर ब्राउन होने तक तल कर निकाल लीजिये, आग  बन्द कर दीजिये, और काली मिर्च, नमक और चाट मसाला डाल दीजिये, और अच्छी …तरह सारी चीजें मिला दीजिये, पोहो नमक्रीन तैयार हैं.ठंडी होने के बाद किसी भी एअर टाइट कन्टेनर में भर कर रखिये और 2 महिने तक जब मन चाहे, खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f9);
                       txt = ("•मुरमुरा /क्रुरमुरा 1 कप\n• आलमंड  बादाम 10-12\n•हरी मिर्च २\n•आयल  २ बडे चम्मच \n• राई 1/2 (साधा) छोटा चम्मच\n• हींग  चुटक्री\n•हल्दी का पाउडर 1/2 (एक चौथ छोटा चम्मच\n•कडी पत्ते 10 -12 छोले सेका हुआ  1/2 (साधा) कप\n• नमक स्वादानुसार\n• चीनी 2 छोटा चम्मच");
                        txt2 = ("•एक बडी कढाई गरम करने रखें । बादाम को  1/2 में काट लें ।हरी मिर्च को  भी दो टुकडों में काटे । पैन  में तेल डालें और गरम होने एर राई डालकर फूटने दें ।\n\n•हींग, हल्दी पाउडर  डालकर आधा  मिनिट भूने । कडी पत्ते और बादाम डालें और कडी पत्ते क्रिस्प होने तक भूने ।\n\n•भूने हुए चने, नमक अपैर चीनी डालकर मिला लें । \n\n•अब क्रुरमुरे डालकर अच्छी  तरह से मिला लें । ठंडा होने एर बंद डिब्बे में रखें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f10);
                       txt = ("•मैदा - 250 ग्राम( 2 कप)\n•घी - 50 ग्राम ( 1/4 कप)\n•मलाईं या क्रीम  - 25 ग्राम( 1 /4 व्य)\n•चीनी- 50 - 60 ग्राम ( 1/3 कप )\n•दूध - 50- 60 ग्राम ( 1/4 कप )\n• खसखस - 1 टेबल स्पून \n• तलने के लिये - रिफाइन्ड तेल");
                        txt2 = ("•चीनी को  बारीक पीस लीजिये.\n\n•मैदा को  किसी बर्तन में छान कर निकालिये, घी, चीनी और मलाई डाल कर अच्छी  तरह मैदा में मिला लीजिये.\n\n•दूध की  सहायता से कढा आटा  गूथ लीजिये. खसखस डालकर आटे  में मिलाइये. आटे  को  20 मिनिट सैट होने के लिये रख दीजिये.\n\n•आटे से 2 लोई बना लीजिये. लोई से आधा  सेमी. मोटाई को पूरी बेलिये, चाकू की  सहायता से 1 सेमी. वर्गाकार आकार  के शकरपारे काट लीजिये. कढाई में तेल डाल कर गरम कीजिये, कटे  हुये शकरपारे गरम तेल में डालिये, मध्यम और धींमी गैस फ्लेम  पलट पलट कर , ब्राउन होने तक तल लीजिये. यदि आपकी गैस तेज होगी तो ये अन्दर से अच्छी  तरह नहीं सिक पायेंगे और  बहुत ही हल्का  गरम होगा तो तेल में फट या टूट सकते\n\n•प्लेट में पेपर नैपकिन बिछाइये, कढाई से शकरपारे निकाल कर प्लेट में रखिये.\n\n•लीजिंये खसखस के स्वाद वाले शकरपारे तैयार हैं. ठन्डे  होने के बाद एअर टाइट कन्टेनर में रखिये. जब भी आपका मन हो कन्टेनर से शकरपारे निकालिये, और खाइये.\n\n•तिल वाले स्वाद के शकरपारे के लिये-\n\n• आइये  शकरपारे में खसखस की जगह तिल मिलकर तिल के स्वाद वाले शकरपारे भी तैयार कर सकते हैं. इसके लिये गुंथे हुये आटे  में 1 टेबल स्पून  तिल डाल कर मिलाये , और इसी विधि से शकरपारे तैयार कर लीजिये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f11);
                       txt = ("•मैदा - 200 ग्राम (2 कप)\n• - 50 ग्राम 1/4 कप) मैदा में डालने के लिये\n•चीनी 200 ग्राम ( एक कप)\n•घी - तलने के लिये");
                        txt2 = ("•मैदा को  किसी बर्तन में छान कर निकालिये, घी डालिये और हाथ से मैदा घी को  अच्छी  तरह मिलने तक मिला लीजिये.\n\n• पानी की  सहायता से मैदा को  पूरी से भी थोडा सरल आटा  गूथिये. आटा  को  सैट होने के लिये ढककर 20 मिनिट के लिये रख दीजिये.\n\n•गुथे हुये आटा  से 2 लोई बना कर तैयार क्रीजिंये. एक लोई को  उठाइये और गोल करके 10-11 इंच के व्यास में, 1/4सैमी. मोटी पूरी बेलिये. चाकू से आधा  इंच दूरी पर  काटिये, दूसरी ओर से भी इसी तरह काटकर चौकोर शकर पारे बनाकर तैयार क्रीजिंये. दूसरी लोई को  भी इसी तरह खेल कर  मनापसन्द आकार  और साइज के शक्करपारे  काट कर तैयार कर लीजिये.\n\n• कढाई में घी डालकर गरम कीजिये, गरम घी में जितने शक्करपारे आ जाए  डालिये और सभी तरफ से ब्राउन होने तक तल कर निकाल लीजिये, शकर पारे धीमी और मीडियम गैस एर ही तलें. सारे शकर पारे इसी तरह तल कर तैयार कर लीजिये.\n\n• चाशनी बनाइये -\n\n•1पैन में चीनी डालिये और आधा कप  पानी मिलाइये, गैस एर उबलने रखिये, चाशनी को  चीनी घुलने तक पकने दीजिये,चीनी घुलने के बाद चाशनी को  टैस्ट कीजिए. एक बूंद चाशनी को किसी प्याले में टपकाइये और ठंडा होने के बाद  चाशनी को  उंगली से उठाइये, उंगली और अंगूठे के बीच चिपका कर देखिये, ऊंगली और अंगूठे को  अलग करते समय चाशनी में तार निकलने चाहिये, 2 तार को चाशनी बनाकर तैयार कीजिये और गैस बन्द कर दीजिये.\n\n•तैयार चाशनी में, तले शकर पारे डालिये और शकरपारे अच्छी  तरह शवकर कोट  होने तक चमचे से चला कर मिलाते रहिये. चीनी क्रीट होने के बाद शकरपारे अन्टछी तरह ठंडा होने के बाद, एअर टाइट कन्टेनर में भर कर रख लीजिये और जब भी आपका मन हो 2 महिने तक शुगर कोटेड  शकर पारे कन्टेनर से निकालिये और खाइये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f12);
                       txt = ("•सूजी या रवा 2 कप \n•मावा  या खोया 1 कप\n•पिसी चीनी 2 कप\n• देसी घी - 1 कप\n•काजू (बारीक कटी ) 50 ग्राम\n• बादाम (बारीक कटी ) 50 ग्राम\n•हरी इलायची पाउडर 1 /2 छोटी चम्मच\n•ठंडा दूध 1 टेबल स्पून ");
                        txt2 = ("•एक भारी कढाई मावा डालकर धीमी आँच एर गुलाबी होने तक भूने आँच बंद कर दे और ठंडा होने दे\n\n• फिर एक कढाई में घी गरम को उसमें काजू और बादाम को  हल्का सा फ्री करक निकाल ले . फिर उसी घी में सूती डालकर धीमी आँच एर हल्की ब्राउन होने तक भूने आँच बंद कर दे और ठंडा होने दे\n\n•सूजी के ठन्डे  होने एर उसमें मावा, बूरा और ठंडा दूध  और काजू बादाम डालकर सब कुछ अच्छी  तरह से  से मिलाए और अपने मन के आकार  के लड्रड चुन  ले रवा लड्रडू तैयार\n\n• लड्रडू खाइए और एयर टाईट कन्टेनर में भरकर  रख दे\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f13);
                       txt = ("•लीटर फुल क्रीम दूध\n•बड़े चम्मच मैदा\n•बड़े चम्मच चीनी\n•1/4 चम्मच इलाइची पाउडर\n•घी फ्राई करने के लिए\n•चाशनी बनाने के लिए-\n•2 कप चीनी\n•केशर के कुछ धागे\n•सजाने के लिए\n• 2 बडे चम्मच बादाम और पिस्ता (बारीक कटे हुए)");
                        txt2 = ("•सबसे पहले दूध को किसी भारी बर्तन में उबाले, जब दूध गाढा हो जाये तो गैस छंद कर के दूध को ठंडा होने दे.\n\n•चीनी और 2 कप पानी  मिला के गैस एर चढा दे जब एक तार को चाशनी बन जाये तो गैस छंद कर के केसर मिला दे.\n\n• अब ठन्डे दूध में मैदा इलाइची पाउडर और 2 चम्मच चीनी मिला के गाढा बैटर बना ले.\n\n•अब एक सपाट नॉन स्टिक तवा या पेन गरम करके  उसमे घी डाले और एक बडा चम्मच भर के बटर  डाले धीमी आंच एर पकने दे. जब पुए के किनारे सुनहरे होने लगे तो उसे पलट के दूसरी तरफ से भी सेक  ले. दोनों तरफ से सिलने के बाद उसे चाशनी में डाल दे. कुछ देर चाशनी में पडा रहने दे. फिर निकल के पिस्ता और बादाम से सजा के गरम गरम परोसे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f14);
                       txt = ("•1 किलो काजू \n•750 ग्राम पिसी हुई चीनी\n• 7-8 इलायची का पाउडर\n•चांदी का वर्क 1-2");
                        txt2 = ("•काजू को  पानी में 4-5 घंटे के लिए भिगो दें\n\n•पानी से निकालकर मिक्सी में बारीक पीस का पेस्ट बना लें\n\n•पेस्ट में पिसी चीनी मिलाएं\n\n• एक भारी कढाई में काजूक पेस्ट का डालकर धीमी आंच एर चढाएं और लगातार गाढा होने तक चलाते रहे.\n\n• इलायची पाउडर डाले, जब मिश्रण कढाई के चारों तरफ सफ्रेद और खा सा देखने लगे तब गैस बंद करदे.\n\n• मिश्रण को ट्रे में निकाल ले और पतला पतला फैला दे. ठंडा होने के बाद उस एर वर्क लगे दे\n\n• अपने मनपसंद जाकर में काट कर सर्व करें\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.f15);
                       txt = ("•200 ग्राम ताजा पनीर  \n•-1/2 कप ताजी मलाई\n• 100 ग्राम चीनी\n• 1/4 छोटा चम्मच इलाइची का पाउडर\n• 1/4 छोटा चम्मच केसर (एक चम्मच दूध में भीगा दे)\n• 1 बडा चम्मच काजू बारीक कटे  हुए ");
                        txt2 = ("•1 बडा चम्मच पिस्ता बारीक कटे हुए\n\n•पनीर को कद्दूकस करके रख ले.\n\n• एक कढाई में मलाई डाल के गरम करके  जब मलाई पिघल जाये तो उसमें कद्दूकस किया  हुआ पनीर  मिला दे.\n\n•धीमी आंच एर लगातार चलाते हुए गाढा होने तक उठाए\n\n•जब मिश्रण गाढा हो जाये तो चीनी, इलाइची पाउडर, दूध में भीगी केसर मिला दे और लगातार चलाते रहे जब मिश्रण कढाई के किनारे से छूटने लगे तो गैस बंद करदे.\n\n• काजू और पिसते डाल के मिला दे और मिश्रण को  ठंडा होने  दे. जब मिश्रण ठंडा हो जाये तो छोटे छोटे नीबू के आकार  के लड्रडू बना ले.\n\n•मलाईं पनीर  के लड्रडू तैयार है इस दिवाली बनाये और इसे 3-4 दिन तक फ्रिज में रख के खाए\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                }
                break;
            }


            case "Non Veg Receipes": {
                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no1);
                       txt = ("•अंडा- 3-4\n• प्याज- 2\n•लहसुन-4-5\n• हरी मिर्च -2-3 \n• हल्दी पाउडर-1 चम्मच\n• लाल मिर्च पाउडर- 1 चम्मच\n• पुदीने की पत्ती- 1 डंठल\n• धनिया पत्ती- 1 डंठल \n•जीरा- 1 चम्मच\n• टोमेटो सॉस- 1 चम्मच\n•पानी- 1 /2 कप\n•नमक- स्वादअनुसार\n•गरम मसाला- चुटकी भर\n•तेल- 3 चम्मच");
                        txt2 = ("•प्याज को छिले और 4 भागों में काटें । मिक्सी में प्याज, पुदीने की पत्ती लहसुन, हरी मिर्च और धनिया पत्ती को पीस कर पेस्ट बना लें ।\n\n• उबले अंडे को छील कर उसे फ्राई पैन में तेल डाल कर हल्का भूरा फ्राई कर दें ।\n\n• पैन में तेल कम कर के उसमें जीरा डालें ।\n\n फिर उसमें पीसा गया पेस्ट डालें और मध्यम  आँच पर भूने। .\n\n•जब मसाला तैयार हो जाए तब उसमें नमक, हल्दी  पाउडर, लाल मिर्च पाउडर और गरम मसाला डाल कर पकाएं ।\n\n• इसके बाद कटे टमाटर डाल कर चलाएं और फिर पानी डाल कर उबाले ।\n\n•जब ग्रेवी  गाढ़ी हो जाए तब उसमें फ्राई किये  हुए अंडे डाले और हल्की से मिलाये ।\n\n• आंच बंद कर के पुदीने वाली अंडा करी को  गरम चावल के साथ सर्व करे ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no2);
                       txt = ("•उबले हुए 2-3 अंडे \n•1 प्याज़ कटी हुई \n•1 टमाटर पेस्ट किया \n• 3/4 जीरा-काली मिर्च पाउडर\n• कटी पुदीने की पत्ती,\n• आधा चम्मच मिर्च पाउडर\n• तेल तलने के लिए, नमक स्वादअनुसार\n• 1 छोटा चम्मच अंमचुर पाउडर");
                        txt2 = ("•सबसे पहले उबले हुए अंडो को आधा काट लें । अब एक पैन लें, तेल डालें, प्याज, कड़ी  पत्ता, पुदीना पत्ता और जीरा- काली मिर्च पाउडर डाल कर फ्राई करें ।\n\n•अंब पैन में टमाटर पेस्ट, मिर्च पाउडर, अंमचूर और नमक डाल कर अच्छे से मिलाए । अब कटे हुए अंडो को धीरे धीरे मसाले में डाल कर अच्छे से चलाए।\n\n• अब  आपका टेस्टी, हॉट और मसालेदार अंडा फ्राई खाने के लिए बिल्कुल तैयार हो चुका है ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no3);
                       txt = ("•अंडा 5\n•पनीर- 2 चम्मच\n• टमाटर- 1\n•हरी मिर्च- 3\n•अदरक- 1 /2 चम्मच पेस्ट\n•काली मिर्च पाउडर- 1 चम्मच\n•लाल मिर्च पाउडर- 1 /2 चम्मच\n•नमक- स्वादअनुसार\n•चाट मसाला चुटकीभर\n• बटर - 2-3 चम्मच \n• धनिया पत्ती- 2 चम्मच");
                        txt2 = ("•एक पैन में बटर पिघलाइये और उसमें कटा प्याज भून लीजिये। जब प्याज हो जाए तब उसमें लहसुन और अदरक का पेस्ट डालिये और अच्छे से भूनिये ।\n\n• जब प्याज पूरी तरह से हो जाए तब उसमें हरी मिर्च,टमाटर और घिसा हुआ पनीर डाल कर हल्की आँच पर 2-3 मिनट पकाएं ।\n\n• अब नमक, काली मिर्च पाउडर, लाल मिर्च पाउडर और चाट मसाला डालिये ।\n\n•फिर एक कटोरे में अंडा फोड कर फेटिये और उसे पैन में डाल कर भून लीजिये। इसे मध्यम आँच पर  4 मिनट तक पकाइये । अब यह तैयार हैं ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no4);
                       txt = ("•अंडे -3\n• प्याज -2\n• टमाटर-2 \n• हरे प्याज 2\n• शिमला मिर्च- 1\n• धनिया पत्ती- 2 चम्मच \n•केसर- 1 चुटकी\n•मिर्च पाउडर- 1 /2 चम्मच \n•गरम मसाला- 1 चम्मच \n•तेल \n• नमक");
                        txt2 = ("•सबसे पहले प्याज को बारीक काट लीजिये। अब टमाटर और हरी प्याज को भी काट लें । शिमला मिर्च और धनिया को भी काट लें ।\n\n• एक छोटा कटोरा लें, उसमें हल्दी पाउडर, नमक, लाल मिर्च पाउडर और काली मिर्च पाउडर डालें । फिर उसमें गरम मसाला पाउडर डाल कर सभी सामग्री को  मिक्सद करें।\n\n• मिश्रण में हल्का सा पानी मिलाएं । अब मिश्रण को बारीक पेस्ट बना लें ।\n\n• जब  पेस्ट रेडी हो जाए तब उसमें अंडा फोड़े और ब्लेरडर से फेटे \n\n•तवा गरम करें, उसमें ऑमलेट का घोल डालें ।\n\n• ऑमलेट  को फ्राई करें और ब्राउन होने तक पकाएं ।\n\n•अब इसे ब्रेड के साथ सर्व करें। \n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no5);
                       txt = ("•पकौड़े के लिये- \n•अंडे- 2\n• आलू - 2 उबले हुए\n• बेसन - 2 चम्मच\n• नमक- स्वादअनुसार\n•तेल- फ्राई करने के लिये\n•करी के लिये-\n•प्याज पेस्ट - 2 चम्मच \n•अदरक-लहसुन पेस्ट 2 चम्मच\n• टमाटर की प्यूहरी- 2 चम्मच\n•जीरा- 1 चम्मच\n•हल्दी पाउडर- 1 चम्मच\n• लाल मिर्च पाउडर- 1 चम्मच \n•जीरा पाउडर- 1 चम्मच\n•धनिया पाउडर- 1 चम्मच\n•गरम मसाला पाउडर- 1 /2 चमच\n• नमक\n•धनिया कटी हुई- 2 चम्मच\n•तेल- 2 चम्मच");
                        txt2 = ("•एक कटोरे में अंडों को फोड कर डालें । उसी कटोरे में उबले और मसले हुए आलू कटी प्याज, बेसन और नमक डालें ।\n\n• अब इस मिश्रण को अच्छी तरह से फेंटे ।\n\n•पैन में तेल गरम करें, उसमें चम्मच भर कर अंडे और आलू का पेस्ट डालें ।\n\n• पकौड़ो को भूरा होने तक तलें । एक बार हो जाने पर पकौड़ो को प्लेट में निकाल कर रखे  \n\n• अब एक पैन में 2 चम्मच तेल डालें, उसमें जीरा डालें, फिर प्याज का पेस्ट डाल कर मध्यम आँच पर फ्राई करें ।\n\n•अब अदरक-लहसुन का पेस्ट डालें और कुछ देर पकाएं ।\n\n•उसके बाद टमाटर प्यूरी, हल्दी , लाल मिर्च पाउडर, जीरा पाउडर, धनिया पाउडर डाल कर चलाएं ।\n\n• फिर नमक और गरम मसाला पाउडर डालें । फिर आधा कप पानी डाल कर मध्यम आंच पर इसे गाढा होने दे \n\n•इसके बाद पकौड़े ध्यान से डालें और जब यह अच्छी तरह से ग्रेवी में समा जाए तब आंच बंद कर दें ।\n\n• गार्निश करने के लिये हरी धनिया का इस्तेमाल करें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no6);
                       txt = ("•फिश सॉस -1/4कप \n• चीनी -1/2 चम्मच\n• लेमन ग्रास सफ़ेद हिस्साक ,बारीक कटा -2\n• लहसून, बारीक कटा -4\n• लाल मिर्च ,बारीक कटी 2\n• चिकन थाई छोटे टुकड़े मे कटा\n• वेजिटेबल ऑइल 1/4 कप\n• नारियल का दूध -1 कप\n• प्याज चौकोर टुकड़ों मे कटी 1/2\n• धनिया -3 गुच्छे");
                        txt2 = ("•एक कटोरें में फिश सॉस और चीनी मिलाएं । जब चीनी मिक्सक हो जाए तब उसमें लेमनग्रास, आधी कटी लहसुन,आधी  मिर्च और सारा चिकन पीस मिक्स करें।\n\n• अब चिकन को इस मिश्रण से अच्छी तरह से कोट कर दें और 1 घंटे के लिये फ्रिज में मैरीनेट होने के लिये रख दें ।\n\n• आप चाहें तो इसे रात में भी मैरीनेट करने के लिये रखें और सुबह पकाएं ।\n\n•उसके बाद एक बडा सा सॉस पैन या कढाई लें, फिर उसमें तेल गरम करें ।\n\n• फिर उसमें लेमनग्रास, लहसुन और मिर्च डाल कर हल्का भूरा होने तक पकाएं ।\n\n• अब आंच तो तेज करें, फिर उसमें चिकन डाल कर 2 मिनट तक दोनों साइड पकाएं ।\n\n• फिर नारियल दूध और कटी प्याज डाल कर कवर कर के मध्यम आंच पर  5 मिनट तक पकाएं ।\n\n• इसे तब तक पकाएं जब तक कि सॉस  आधा ना रह जाए ।\n\n• अब इसे किसी कटोरें में पलट दें और हरी धनिया काट कर सजाएं और सर्व करें।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no7);
                       txt = ("• 4 अंडे \n• 2 बडे प्याज \n•4 बडे चम्मच कटे मशरूम\n• 1चुटकी राई पाउडर  \n• आधा चम्मच मिर्च पाउडर  \n• 2 चम्मच मक्खन और स्वादानुसार नमक ");
                        txt2 = ("•पहले प्याज और मशरूम को काटकर अलग से रख लें ।एक बाउल में अंडे, प्याज, राई पाउडर  , मिर्च और नमक को मिलाकर मिश्रण तैयार करके  अच्छी तरह से फेंटें ।\n\n• अब एक बर्तन में आधा मक्खन गरम करके  उसमें मशरूम डालें और तेज आंच पर 3-4 मिनट पकाएं । अब  इसे उतार कर अलग रख दें ।\n\n• अब तवे पर बचा मक्खन गरम करें और आधा अंडे का मिश्रण फैलाएं । प्राय किए मशरूम ऊपर से फैला दें ।\n\n• जब ये पक जाए तो अंडे को चारों तरफ से रोल करें और गरमा -गरम सर्व करें। बचे मिश्रण को भी ऐसे ही दोहराएं ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no8);
                       txt = ("•1 /2 किलो मटन (पिसा हुआ) \n•1 अंडा\n•2 चम्मच चना (पिसा हुआ)\n• 2 चम्मच हरी धनिया\n•1 चम्मच खसखस (पानी में भिगो हुई)\n• 15-20 लहसुन\n• 1/2 इंच अदरक\n• 4 प्याज\n 4• टमाटर\n• 2 चम्मच हरी धनिया\n• 1 चम्मच हल्दी\n•नमक- स्वामदअनुसार\n• 1 /2 कप दही\n•1 कप तेल\n•पानी \n 2 काली इलायची 1 चम्मच काली मिर्च\n• 6 लौग\n 5• हरी इलायची\n• 2 तेज घत्तनि\n•1 इंच दालचीनी");
                        txt2 = ("•सबसे पहले अदरक, लहूसुन ओर खसखस को पीस कर फ्राई कीजिये, फिर उसमें हल्की सा पानी मिला दीजिये और फिर चलाइये ।\n\n•एक दूसरा पैन  लीजिये, उसमें सूखे मसाले, 1 कप पानी तथा 10 मिनट के लिये चलाइये, फिर किनारे रख।\n\n•प्याज के मिश्रण में अदरक-लहसुन पेस्ट और खसखस वाला मिश्रण डालिये और फिर दुबारा 2-3 मिनट के लिये दिजिये । उसके बाद इसमें हल्दी पाउडर, धनिया पाउडर और नमक मिलाइये और चलाइये ।\n\n इसके बाद पैन  में कटे  हुए टमाटर डालिये और भूनिये ।\n\n•जिंतनी देर टमाटर गलता हैं, उतनी देर में आप  अंडा, चना पाउडर, को हरी धनिया, नमक और पिसा हुआ मटन एक साथ मिला दीजिये ।\n\n• अब अपनी हथेलियों एर तेल लगाइये और छोटे-छोटे कोफ्ता बनाइये। इन कोफ्ता क्रो प्याज वाले मिश्रण में धीरे-धीरे डाल दीजिये।\n\n• अब पहले वाले वाले से पानी को छानिये और इसे कोफ्ते में मिलाइये और उबालिये । इस कोफ्ता  ग्रेवी को  5 मिनट  और फिर डाल क्रर हलकी आंच पर 45 मिनट के लिए पकाये और और गैस बंद कर दे \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no9);
                       txt = ("•500 गाम चिकन\n• आधा कप दही\n• एक बडा चम्मच लाल मिर्च का पेस्ट\n• एक बडा चम्मच अदरक-लहसुन घेम्\n•एक बडा चम्मच नींबू रस\n• एक छोटा चम्मच जीरा पावडर एवं चम्मच लाल मिर्च पावडर,\n•एक छोटा चम्मच गरम मसाला\n•दो बडे चम्मच मक्खन,\n• एक बडा चम्मच तेल और नमक स्वादानुसारा");
                        txt2 = ("•सबसे पहले चिकन क्रो छोटे आकार के टुकडों में काट लें और उसमें कांटे की  सहायता से बारीक छेद कर लें, जिससे मसाला चिकन में अच्छी  तरह भिगो सके । अब एक बडे कटोरे में इस चिकन क्रो लें और उसमें लाल मिर्च पाउडर ,आधा  बडा चम्मच नींबू का रस और नमक मिलकर । अब इसे कम से कम एक घंटे के लिए ऐसै ही\n\n• अब एक अलग कटोरे में दही, अदरक-लहसुन का पेस्ट,नींबू का रस, गरम मसाला, जीरा पावडर और लाल मिर्च का पेस्ट मिलाएं । सबको अच्छे  से मिक्स कर लें । मिलाने के बाद अब एक अलग कटोरे में दही, अदरक-लहसुन का पेस्ट,नींब्रू का  रस, गरम मसाला, जीरा पाउडर  और लाल मिर्च का पेस्ट मिलाए । सबको अच्छे से मिक्स कर लें । मिलाने के बाद इस मिश्रण क्रो चिकन में डालें और अच्छे से मिला लें । अब इसे एक घंटे के लिए ऐसे ही छोड़ दें ।\n\n• एक घंटे के बाद इसे फ्रिज में रखें । फिर इसे तंदूर पर  रखकर चिकन के मुलायम होने तक रोस्ट करें रोस्टैड चिकन एर मक्खन लगाकर एक मिनट के लिए फिर से रोस्ट करें । गोल को प्याज और नींबू रस से गार्निश कर गर्मागर्म परोसें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no10);
                       txt = ("•1 किलो मटन\n• डेढ़ बडा चम्मच अदरक-लहसुन का पेस्ट\n• 1 /2 किलो प्याज कटे  हुए\n• 25 गाम साबुत धनिया\n• 25 गाम जीरा\n• 25 गाम सूखा नारियल\n• 25 गाम इमली \n• 7-8 हरी मिर्च बीज निकाली हुई,\n• 1 /4 चम्मच हल्दी पावडर,\n•1 /4 चम्मच लाल मिर्च पाउडर \n• तेल और स्वादानुसार नमक ");
                        txt2 = ("•सबसे पहले साबुत धनिया, जीरा च सूखे नारियल क्रो भूनकर पीसकर रख लें । मटन क्रो नमक और अदरक-लहसुन के पेस्ट के साथ उबालें । जब मटन नर्म पड़ जाए तब उतारकर रख लें ।\n\n•हरी मिर्च क्रो तेल में  निकालकर एक तरफ रख दें। इसी तेल में प्याज भूना मसाला डालें । बचा हुआ अदरक-लहसुन का पेस्ट डालें । हल्दी और लाल मिर्च डालें तेज आँच पर पांच मिनट तक पकाये ।\n\n• सबसे पहले  साबुत धनिया, जीरा व सूखे नारियल क्रो भूनकर पीसकर रख लें । मटन क्रो नमक और अदरक-लहसुन के पेस्ट के साथ उबालें । जब मटन नर्म पड़ जाए तब उतारकर रख लें ।\n\n•हरी मिर्च क्रो तेल में तलें और निकालकर एक तरफ रख दें ।इसी तेल में कटे  प्याज और भूना मसाला डालें । बचा हुआ अदरक-लहसुन का पेस्ट डालें । हल्दी और लाल मिर्च डालें ।तेज आँच पर  पाँच मिनट तक पकाएँ।\n\n•मसालै में मटन के साथ इमली का पानी  डालें । स्वादानुसार नमक मिलाएँ। अब इसमें तली हरी मिर्च मिलाएँ और हल्के हाथ से मिक्स करें ।अब इसे गरमा-गरम चावल के साथ परोसें।.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no11);
                       txt = ("•70 ग्राम बोनलैस चिकन क्यूब्स.\n•एक बडे जाकर का टमाटर\n•एक बडे आकार की शिमला मिर्च \n•एक बडे आकार की प्याज \n•100 मिलीलीटर पानी  .\n• 1 नींबू.\n• 1 छोटा चम्मच सोशल चिकन मसाला\n• 1/2 छोटा चम्मच लहसुन और अदरक का पेस्ट\n•नमक स्वाद अनुसार .\n• छोटा चम्मच हल्दी पाउडर -1/2 छोटा चम्मच धनिया बीज पाउडर-1/2 छोटा चम्मच लाल मिर्च पाउडर .-1/2 छोटा चम्मच गरम मसाला \n•चुटक्री भर शाह जीरा .\n•3 लौग .\n•2 इलायची \n•1 टुकडा दालचीनी.\n•4 छोटा चम्मच घी ");
                        txt2 = ("•सबसे पहले कढाई गर्म करें, अब उसमे घी डालें, जब घी गर्म हो जाए तब उसमे टमाटर, शिमला मिर्च और प्याज डालकर 20-30 सेकंड  के लिए पकाये , अब यह पक चुकी हैं तो इसे निकाल लें.\n\n•अब उसी घी में जीरा, लौग और इलायची डालें, अब उसमें लहसुन और अदरक का पेस्ट , हल्दी पाउडर, धनिया बीज पाउडर, लाल मिर्च पाउडर और गरम मसाला डालकर कुछ देर  बाद पकाये .\n\n• अब उसमे मगज या तरबूज के बीज का पेस्ट डालें और कुछ मिनट के लिए पकऱएँ, 3-4 तक उठाने के बाद उसमें नींब्रू का  रस, दही, थोडा सा पानी  और थोडा सा रंग डालें.\n\n• अब उसमें थोडा सा  नमक स्वाद अनुसार और चिकन मसाला डालें और थोडा पकने दें, अब उसमें चिकन क्यूब्स डालें और 2 मिनट तक पकाए.\n\n•अब चिकन पक चूका हैं तो उसमें सारी सब्जियाँ डालें तो लीजिये चिकन टिवका मसाला परोसने के लिए तैयार हैं.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no12);
                       txt = ("•300 गाम चिकन हड्डियों के साथ .-1/2 अंडा फैटा हुआ.\n•2 छोटा चम्मच दही.\n•1/2 छोटा चम्मच अजीनौमोटौ .-1/2 छोटा चम्मच लाल मिर्च पाउडर .\n• 1/2 छोटा चम्मच गरम मसाला .\n• 1/4 छोटा चम्मच चिकन मसाला.\n•नमक स्वाद अनुसार.\n• 1 छोटा चम्मच मकई का आटा.\n• 1 छोटा चम्मच मैदा.\n• क्रुछ नूँदें डार्क सोया साँस के\n• 1/2 छोटा चम्मच ग्रीन चिली साँस.\n• 1/2 छोटा चम्मच टमाटर केचप.\n• 1/4 छोटा चम्मच लहसुन और अदरक का पेस्ट .\n• 5 हरी मिर्च 1/2 कटी  हुई.\n•4-5 को पत्ते \n•हरी धनिया ");
                        txt2 = ("•सबसे पहले  तेल गर्म होने रखें, अब एक कटोरे में फैटा हुआ अंडा, 1/4 छोटा चम्मच अजीनामोटो, 1/2 छोटा चम्मच लाल मिर्च पाउडर, 1 छोटा चम्मच गरम मसाला, 1/2 छोटा चम्मच चिकन मसाला, नमक स्वाद अनुसार, 1 छोटा चम्मच मकई का आटा , 1 छोटा चम्मच मैदा डालें.\n\n•अब उसमें कुछ डार्क सोया सॉस , 1/2 छोटा चम्मच लहसुन और अदरक का पेस्ट, 1/2 छोटा चम्मच टमाटर केम, 1/4 छोटा चम्मच हरी मिर्च को चटनी और कुछ  लाल रंग को डालकर अच्छी  तरह से सभी सामग्री क्रो मिलाएं और मिश्रण तैयार कर लें.\n\n• अब उसमें चिकन डालकर 10 मिनट के लिए मेरिनेट होने के लिए छोड़ दें, अब तेल गर्म हो चूका हैं तो चिकन क्रो 10-12 मिनट के लिए धीमी आच पे  तलें, 10-12 मिनट के बाद यह हलके भूरे रंग  का और क्रुरक्रुरा हो चूका हैं तो इसे निकाल लें.\n\n•एक कढाई में करीब 1 -2 छोटे चम्मच तेल डालें, जब तेल गर्म हो जाए तो उसमें सारा हरी मिर्च, थोडे कड़ी  पत्ते, 1 -2 छोटे चम्मच दही, थोडा सा रंग और चिकन डालकर 1-2 मिनट के लिए पकऱएँ.\n\n• अब चिकेन पकाये तैयार हैं तो आच क्रो बंद कर दें और हरी धनिया से इसे सजाएँ.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no13);
                       txt = ("•150 गाम चिकन \n• 1 छोटा चम्मच मकई का आटा  \n•1 छोटा चम्मच मैदा \n•नमक\n•1/4 छोटा चम्मच अजीनौमोटौ \n• 1/4 छोटा चम्मच काली मिर्च पाउडर \n•1/2 छोटा चम्मच सिरका \n•-1/2 छोटा चम्मच सोया सॉस \n• 1/2 छोटा चम्मच टोमैटो केचप \n• 1 छोटा चम्मच ग्रीन चिली साँस \n• 1 छोटा चम्मच बारीक कटा \n•2 छोटा चम्मच बारीक को हरी  बडा चम्मच बारीक कटे  प्याज कुछ ताजा धनिया पत्तियां )");
                        txt2 = ("•एक कढाई में तेल गर्म करें जब तक तेल गर्म हो तब तक मिश्रण बना लें, 1 अंडा फोड़े और एग वाइट क्रो अलग कर लें, उसमें मकई का आटा , मैदा, थोडा सा नमक, थोडा सा अजिंनोमोटो, थोडा सी काली मिर्च पाउडर और थोडा सा सोया डालें ।\n\n• अब सभी सामग्री क्रो अच्छी तरह से मिला लें ।\n\n•चिकन में से पानी  निकाल लें और चिकन क्रो मिश्रण में डालें और अच्छी  तरह से चिकन क्रो मिश्रण में मिलाएं ताकि चिकन मैं मिश्रण  चढ़ जाए, इसे एक तरफ 10 मिनट के लिए रख दे फिर इसै तलें ।\n\n• अब चिकन को  धीमी आंच पर पकाएँ,इसे चलाते रहे ताकि यह अच्छी  तरह से पक सके, 45 मिनट तक उठाने के बाद यह तैयार है तो इसे बाहर निकाल  लें ।\n\n• एक कढाई में 1 बडा चम्मच तेल गर्म करें, जब तेल गर्म हो जाए तब  लहसुन और बारीक़ कटे  प्याज डालकर तब तक पकाएँ जब तक यह  हलके सुनेहेरे रंग का  न हो जाए ।\n\n• अब उसमें बारीक़ कटी  हरी मिर्च, चिकन, ग्रीन चिली सॉस ,1/2 छोटा चम्मच टमाटर केचप, 1 छोटा चम्मच डार्क सोया सॉस , 1/2 छोटा चम्मच सिरका डालें । अब यह पूरी तरह से रेस्टोरेंट जैसा लग रहा है ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no14);
                       txt = ("•100 गाम चिकन बारीक़ पिसा हुआ\n• 1 छोटा चम्मच मकई का आटा \n•1/2 छोटा चम्मच अदरक और लहसुन का पेस्ट\n•चुटक्रीभर अजीनौमौटौ .\n•नमक स्वाद अनुसार.\n• 1/2 छोटा चम्मच गरम मसाला.\n• 1/4 छोटा चम्मच चिकन मसाला \n•टोमैटो क्रैचप .\n• 1 छोटा चम्मच लाल मिर्च पाउडर\n• 2 छोटा चम्मच बारीक़ कटी हुई हरी मिर्च\n• 4-5 छोटा चम्मच बारीक कटी हुई प्याज\n•1 नींब्रू का रस\n•1 कप ब्रेड \n•थोड़ा सा हरा धनिया \n•-1/2 अंडा.\n• 1 छोटा चम्मच चिकन मसाला  ");
                        txt2 = ("•सबसे पहले  एक अंडा फोड़े और अच्छी तरह से फैटें, सिर्फ 2 अडे का उपयोग करना  है, अब इसे चिकन में डालें.\n\n• अब उसमे अदरक और लहसुन का पेस्ट, लाल मिर्च पाउडर, 1/4 छोटा चम्मच गरम मसाला, नमक स्वाद अनुसार,चुटक्रीभर अजीनोमोटो, हरी मिर्च, बारीक कटी  हुई प्याज,थोडा सा हरा धनिया और निम्बू  का रस डालें.\n\n•सभी सामग्री क्रो अच्छी  तरह से मिलाएँ और कुछ  देर के लिए एक तरफ रख दें और तवा गर्म होने रखें.\n\n•अब उस मिश्रण में मकई का आटा, ब्रेड क्रम्स और 1/4 छोटा चम्मच चिकन मसाला डालें, अब मिश्रण तैयार हैं तो मिश्रण से छोटीं-छोटीं गेंदे बना लें और मकई के आटे से  गेंदों क्रो क्रश  करें और ब्रेड डालें ताकि यह ज्यादा कुरकुरे हो सके.\n\n•चाक्रू को मदद से गेंदों क्रो आकार  दें, अब तवे में थोडा सा तेल डालें और  तेल में तलें फिर तवे के ,एक तरफ रख दें, इन्हें 6-7 मिनट तक धीमी आंच पर पकाएँ.\n\n•तो लीजिये हैदरा बादी स्टाइल चिकन  तैयार हैं,टमाटर केचप से इन्हें सजाएँ.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.no15);
                       txt = ("• 500 गाम चिकन बोनलैस \n• 50 गाम काजू \n•50 गाम खसखस  \n•50 गाम मगजत्तरी \n•1 बडा चम्मच दही \n• 2 मध्यम आकार  मोटे तौर एर कटा हुआ टमाटर\n• 2 मध्यम आकार  मोटे तौर कटी हुई प्याज\n•.4-5 हरी मिर्च \n• 1 छोटा चम्मच गरम मसाला \n• 1 छोटा चम्मच लहसुन और अदरक का पेस्ट \n•1/2 छोटा चम्मच सुखी कसूरी मैथी -1/2 छोटा चम्मच धनिया और जीरा पाउडर \n•1/2 छोटा चम्मच हल्दी पाउडर \n• 1 छोटा चम्मच लाल मिर्च पाउडर \n•4-5 लौग \n• 2-3 इलायची \n•3-2 इंच दालचीनी \n•3-2 चुटकी जीरा \n•नमक स्वाद अनुसार ( प्राप्त )");
                        txt2 = ("•पहले प्याज, टमाटर और हरी मिर्च क्रो उबालें साथ ही साथ सूखे मेवे काजू खसखस और मगजतरी भी उबालें ।\n\n•चिकन के छोटे-छोटे टुकड़े  कर लें ।\n\n•काजू खसखस और मगजतरी में थोडा  पानी  मिलकर उसको प्यूरी बना लें, यह तैयार हैं ।\n\n•अब प्याज, टमाटर और हरी मिर्च को भी प्यूरी बना लें, तो अब यह भी तैयार हैं ।\n\n•मक्खन  गर्म करें उसमें 1 -2 बडे चम्मच  घी और सूखे गरम मसाले डालें, अब उसमें सूखे मेवे को डालें और इस तब तक चलाएं जब तक यह हलके रंग को न हो जाए ।\n\n•जब यह तेल छोड़ने लगे तब उसमें अदरक और लहसुन का पेस्ट डालकर 2-3 मिनट के लिए पकाये , अब उसमें हल्दी पाउडर, धनिया और जीरा पाउडर, लाल मिर्च पाउडर,  सुखी कसूरी मेथी, 1/2 छोटा चम्मच गरम मसाला डालें सभी सामग्री क्रो अच्छी  तरह से मिलाएँ ।\n\n•अब उसमें 1 चम्मच दही डालें, अब यह तेल छोड़ने लगा हैं तो उसमें प्याज को प्यूरी डालकर 5-6 मिनट के लिए पकाये .\n\n• अब उसमें थोडा सा रंग, चिकन, नमक और 100 मिलीलीटर पानी  डालकर ढक कर कुछ देर पकने दें ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                }
            }


            case "Punjabi Food Receipes": {
                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pu1);
                       txt = ("• मैदा 2 कप \n•सूजी 2 चम्मच \n•दही 1/2 \n•ब्रेकिंग पावडर 3/4 चम्मच\n•चीनी 1 छोटा चम्मच\n• तलने के लिए ");
                        txt2 = ("•मैदा,ओर सूजी  क्रो मिला के छान ले इसमें दो चम्मच तेल ब्रेकिंग सोडा, चीनी, और दही मिला दे \n\n•फिर गुनगुने पानी के सहायता से आटा गूंध ले. आटा गूंध  कर  किसी गरम जगह पर  कम से कम चार घंटे के लिए रख चार घंटे के बाद लोई बना के गोल आकार  में रख  ले.\n\n•कढाईं में तेल गरम करके  सुनहरा होने तक तल ले.इसी तरह से सारे भठूरे  तल ले\n\n•गरमा गरम भट्ठी छोले के साथ परोसे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pu2);
                       txt = ("•1 /4 कप राजमा\n •1 /4 कप चना दाल\n•1/2 कप काली उरद की दाल\n• 2-3 हरी मिर्च लम्बाई में  कटा हुए \n •2 प्याज बारीक कटा हुए\n• 8 - 10 लहसुन छील के कदूकस किये  हुए\n •1  टुकडा अदरक का कदूकस करा हुआ\n•2 बडे चम्मच तेल\n• 3 टमाटर बारीक को हुआ \n• 1 /2 चम्मच जीरा पाउड\n• छोटा चम्मच लालमिर्च पाउडर\n• चम्मच कसूरी मेथी\n• 2 चम्मच मक्खन\n• स्वादानुसार नमक\n• 1 /4 कप हरी धनिया बारीक कटा हुआ ");
                        txt2 = ("•दाल क्रो साफ करके  धोकर पानी  में रातभर के लिए या फिर 4-5 घंटे के लिए भीगा दे.\n\n• भीगने के बाद पानी  से निकल के कुकर  में डाले और 6 कप पानी  मिला के गलने तक पका ले \n\n• अब एक कढाई में तेल गरम करके  फिर कदूकस करा  हुआ लहसुन डाल के भूने, कटा हुआ प्याज, अदरक और हरीमिर्च डाल के प्याज के सुनहरा होने तक पकाए.\n\n• टमाटर, जीरा पाउडर, लालमिर्च पाउडर डाल के गलने तक पकाए.\n\n•उबली दाल , नमक और मक्खन डाल के धीमी आंच पर  10-12 मिनट तक और पकाए.\n\n•हरी धनिया और मसली कसूरी मेथी डाल के गैस से उतार के गरम गरम दाल और चावल के साथ परोसे \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pu3);
                       txt = ("• एक किलोग्राम सरसों के पत्ते डंठल समेत\n•250 गाम पालक या बथुआ  \n•2 शलगम कटे हुए \n•नमक स्वादानुसार\n•2 बडे चम्मच मक्के  का आटा \n•डेढ़ चम्मच पिसा हुआ गुड़\n•त्तड़के के लिए -\n• तीन  बडे चम्मच देसी घी,\n•एक इंच बारीक कटा हुआ अदरक का टुकडा\n•1 बडा प्याज बारीक कटा जा\n•2 हरी मिर्च बारीक कटा हुआ \n•4-5 लहसुन बारीक कटा हुआ\n•मक्के  को रीटीं-\n• 2कप मक्के का आटा \n•2 गेहू का आटा\n•गूंथने के लिए गर्म पानी \n•घी आधी कटोरी ");
                        txt2 = ("•सरसों के पत्तों क्रो अच्छी तरह साफ कर लें । पत्तों क्रो अलग कर लें और तने क्रो छील लें । इन्हें अच्छी तरह काट लें । ऊपरी नर्म हिस्सा  काटा  जा सकता है । पालक या बथुआ के  पत्तों  क्रो भी काट कर सरसों में मिलाएं ।\n\n• सारें साग क्रो दो तीन  बार धो कर साफ कर ले. एक पैन  में साधा कप पानी और कटा हुआ  साग डालें। साधा लहसुन,अदरक तथा हरी मिर्च क्रो अच्छी  तरह काटे और साग मे मिला दें । इसमें शलगम  भी बारीक काट के मिला दें । नमक मिला कर इसे आंच  एर रखें और गर्म होने दें ।\n\n•जब साग गलना शुरु हो जाए तो इसे ढक कर मध्यम आंच  15-20 मिनट तक पकाएं । आग  से हटा लें और ठंडा होने दें । इसे मिक्सी में डाल के पेस्ट बनने तक ग्राइंड करे।   ज्यादा बारीक न ग्राइंड न करें और इसे नर्म बनाएं । मक्के का आटा और गुड़ साग में मिलाएं और आंच  एर 15 मिनटके लिए पकऱएं।\n\n•त्तड़के के लिए देसी घी गर्म करें। आंच  क्रो कम करें और इसमें बारीक कटा लहसुन, प्याज, अदरक तथा हरी मिर्च मिलाएं । तब तक पकाएं जब तक अदरक का रंग  बदल न जाए ।\n\n• आंच पर  से उतार लें, घी क्रो गर्म साग में मिलकर हलके से मिश्रित  करे घर के बने ताजे मक्खन और  मक्के की रोटी के साथ इसे सर्व करें।मवक्री की रोटी-\n\nमक्के और गेहू का मिला के आटा  छान लें । गरम पानी से हल्के गुंथे  हुए इसे तैयार करें। बहुत पहले से ही इसे गूंथ ले ।\n\n•पुराने पॉलीथीन बैग क्रो दो हिस्सों में फाड़ लें । एक टुकडे को चकले  एर रखें । आटे का पेड़ा पॉलीथीन एर रखें । दूसरे पॉलीथीन के टुकडे को  से इसे ढक लें ।\n\n•इसे तब तक बेले रोल करें जब तक एक हल्की मोटी रोटी न बन जाए ।\n\n•धीमी आंच  एर रोटी के दोनों तरफ घी लगा कर इसे पकाएं ।थोडे से मक्खन और सरसों के साग के साथ इसे परोसे और खाइये \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pu4);
                       txt = ("•  250 गाम काबुली चना (छोले)\n• 2 चम्मच चाय पत्ती\n• 1 टुकडा दालचीनी\n• 2 लौग\n• 1 /2 चम्मच काली मिर्च\n• 2-3 हरी मिर्च\n• 1 इंच का टुकडा अदरक\n• प्याज 2 बारीक कटे  हुए\n• 1/2 चम्मच मीठा सोडा\n•3 चम्मच अमचूर पाउडर\n• 1 चम्मच गरम मसाला\n•1/2 कप टमाटर का पेस्ट\n•2 चम्मच तेल\n•नमक स्वादानुसार सूखे मसाले के लिए-\n• 1-2 तेज पत्ते\n• 2 चम्मच सरसों के दाने\n• 2 चम्मच जीरा\n• 2 चम्मच मेथी दाना\n•2-3 लौग\n• 1 -2 सूखी लाल मिर्च\n• 1 /2 चम्मच सौंफ");
                        txt2 = ("•एक पेन में मसाले को सभी सामग्री डालकर भून लें और बारीक पीस लें ।\n\n एक बर्तन में काबुली चना, मीठा सोडा पानी  में 6-8 घंटे के लिए भिगो दें\n\n•क्रुकर में भीगे हुए छोले डालकर उसमें चाय को  कपडे में  डालकर गलने तक उठाये, गलने के बाद चाय को पोटली को उसमें से निकल लें\n\n• अब लौग, दालचीनी, काली मिर्च, 2 हरी मिर्च और कद्दूकस बारीक पीस लें और इस पेस्ट क्रो उबले हुए छोलों में मिला ले \n\n• अब एक कडाही में सूखा मसाला, गरम मसाला, टमाटर पेस्ट, अमचूर पाउडर, काली मिर्च पाउडर डालकर उसमेंछोलो का पानी  भी डाल दें गाढा होने तक पकने दें, उबले हुए छोले क्रो उसमे मिला दे फिर अच्छी  तरह उठाये\n\n• एक पेन में घी गरम करके उसमे बारीक कटा प्याज डाले,जब प्याज सुनहरा हो जाये उसको छोले  एर डाल दे 15 मिनट तक ढक कर उठाये\n\n• गरमागरम छोले, बारीक कटा  धनिया, प्याज के छल्लो   और गोल कटे टमाटर से सजाकर सर्व करें\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pu5);
                       txt = ("•  छोटे  आलू - 500 गाम\n•जीरा- 1 चम्मच \n•हींग-1 चुटकी \n•प्याज- \n• अदरक-लहसुन पेस्ट - 1 चम्मच  \n•टमाटर- 3\n• लाल मिर्च पाउडर  1 चम्मच\n•जीरा पाउडर- 1 चम्मच\n• धनिया पाउडर… 1 चम्मच\n•हल्दी पाउडर… चम्मच\n•गरम मसाला पाउडर… चम्मच\n•नमक- स्वाद अनुसार\n• तेल\n•सरसों का तेल… 1 चम्मच\n•पानी- 2 कप\n• धनिया घत्तील- गार्निश  के लिये");
                        txt2 = ("•आलू को छील कर उसमें फोर्क को सहायता से कुछ छेद कर दीजिये  ।\n\n• फिर इन आलू को 15 मिनट के लिये नमक मिले पानी  में डाल दे  \n\n• उसके बाद इसे पैन  में तेल डाल कर डीप फ्राई करें।\n\n• अब आलूओ  क्रो निकाल कर पेपर एर रखें और दुबारा कम तेल यैन में जीरा और हींग डालें ।\n\n• फिर हुई  प्याज  डाल कर गोल्डन  ब्राउन करें।\n\n• फिर अदरक का पेस्ट  डाल कर 3 मिनट तक फ्राई करें। उसके बाद टमाटर, नमक, जीरा पाउडर, हल्दी पाउडर, लाल मिर्च पाउडर डाल कर 5 मिनट तक भूने ।\n\n•जब टमाटर गल जाए तब उसमें आधा कप  पानी डालें और अच्छे से मिक्स करें।\n\n• अब उसमें फ्राई किये हुए आलू छील कर 5 मिनट के लिये पकाये , फिर उसमें गरम मसाला पाउडर डाल कर चलाएं ।\n\n•जब आलू में ग्रेवी  अच्छे से समा जाए तब गैस छंद कर दें और कटी हुई हरी धनिया उस एर छिडक कर सर्व करें।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pu6);
                       txt = ("•मक्के  का आटा  - 1 कप (350 गाम)\n•गेहूं का आटा - 1/4 कप (35 गाम)\n•ब्रूरा - 1 कप (350 गाम)\n•घी- 1/2 कप (300 गाम)\n•दूध- 1 कप\n•काजू- 50 गाम\n•अखरोट  - 50 गाम\n• बादाम - 50 गाम (पिसे हुए)\n•गोंद … 25 गाम\n• इलायची पाउडर - 1 छोटी चम्मच");
                        txt2 = ("•एक बडे प्याले में मकके का आटा निकल लीजिए, गेहूं का आटा और 4 छोटे चम्मच घी डालकर अच्छी  तरह मिलाइये.दूध की  मदद से हल्का नरम आटा मूंथ कर तैयार कर लीजिए. मूंथे आटा क्रो 10 मिनिट के लिए ढककर रख दीजिए, यह सैट होकर तैयार हो जाएगा.\n\n• गुंथे आटा को  3 बराबर भागों में बांटकर तैयार कर लीजिये.नान स्टिक पेन या तवा गरम क्रीजिए. आटे का एक भाग उठाइये और गोल कीजिये, थोडा सा दबाकर चपटा करके लीई बना लीजिए, लीई  को गेहूं के सूखे आटे में लपेट कर प्याले एर रखिये और मोटा पराठा बेल  लीजिए.\n\n•पैन गरम होने एर इसमें थोडा घी डाल कर चिकना कर लीजिए. बेले हुए परांठे को  पैन  में रोकने के लिए डाल दीजिए. परांठे की  नीचे को और से हल्का सिलने के बाद दूसरी तरफ़ पलट दीजिए और जब परांठे के सरे भाग में सुनहरी चित्ति आने लगे तो परांठे के पहले  भाग के ऊपर घी डालकर इस क्रो चारों तरफ़ अच्छी तरह से फैला दीजिए. परांठे को  दूसरी तरफ़ पलटे तथा इस भाग पर भी घी डालकर अच्छी तरह से चारों और फैला दीजिए. परांठे के दोनों और सुनहरी चित्ति आने  तक अच्छे से सेक  लीजिए तथा इसको प्लेट में निकाल कर रख लीजिए और इसे थोडा ठंडा होने दीजिये .\n\n•इसी तरह से दो और लोई से भी परांठे बना कर तैयार कर लीजिए. काजू को  बारीक काट कर तैयार कर लीजिए, 10 काजू  2 भागों में काट लीजिये, ये पिन्नी के ऊपर लगायेंगे. अखरोट  भी छोटा काट लीजिए.\n\n•गोंद क्रो भून लीजिये, पैन  में घी डालकर हल्कऱ गरम कर लीजिए, गोद डालकर धीमी आंच एर भून लीजिए. गोद के और हल्के ब्राउन हो जाने एर प्लेट में निकाल कर रख लीजिये. ठंडा होने एर इसे प्लेट में ही बेलन से दरदरां पीस\n\n•परांठों के ठंडा हो जाने के बाद इन्हें छोडिये और मिक्सर जार में डाल कर पीस लीजिए. मिश्रण क्रो प्याले में निकाल  लीजिए. गोद, बूरा, को कटे   काजू अखरोट, पिसे हुए बादाम और इलाइची पाउडर डाल कर सभी  चीजों को अच्छी तरह से मिला लीजिए, बचा हुआ घी भी डाल कर मिला दीजिए.\n\n• लड्रडू बनाने का मिश्रण तैयार हे. थोडा सा मिश्रण हाथ से और अपने पसन्द के अनुसार छोटे बडे किसी भी साईज़ के गोल-गोल लड्रडू बनाकर लीजिए, लड्रडू के ऊपर 1 काजू लगा कर इसे सजा दीजिए. इतने मिश्रण से लगभग  15 -16 लड्र बन कर तैयार हो जायेंगे, पिन्नी क्रो 1-2 घंटे खुला रख दीजिये , यह खुश्क हो जाएंगी, अब आप  भी कन्टेनर में भर कर रख लीजिये, इम्हें 10-12 दिन तक प्रयोग कीजिये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pu7);
                       txt = ("• उड़द दाल … 3/4 कप ( 150 गाम)\n•चीनी - 1.5 कप (300 गाम)\n•मावा … 3/4 कप ( 150 गाम)\n•घी - 1 कप (225 गाम)\n• इलायची पाउडर - 2 छोटी चम्मच\n•गोंद - 2 टेबल स्पून \n• काजू - 20-25\n• बादाम … 30-35\n•सूजी - 1 कप (40 गाम)");
                        txt2 = ("•उड़द दाल क्रो साफ कर लीजिए, धोकर पीने वाले पानी  में 2 घंटे के लिये भिगो दीजिये. दाल से अतिरिक्त पानी  निकाल दीजिये, भीगी  हुई दाल क्रो मिक्सर जार में डाल दीजिए और थोडा सा पानी  डालकर जितना कि दाल पीसने के लिये आवश्यक  हैं, हल्का दरदरा पीस लीजिए.\n\n•1पैन में घी डालकर हल्का गरम कर लीजिये, 50 गाम घी बचा लीजिए जिसका उपयोग ड्राई फ्रूट  और गोद भूनने इत्यादि में करना  होगा. घी के मेल्ट हो जाने एर इसमें सबसे पहले  सूजी डाल दीजिए इसके बाद पिसी हुई उड़द दाल डाल दीजिये.\n\n•कलछी से चला चला  कर दाल क्रो मिडियम आग पर भूनिये. दाल के अच्छे से भून जाने एर दाल का कलर चेंज होने  लगता है दाल गोल्डन  ब्राउन हो जाती  है दाल से घी अलग होता दिखता है और अच्छी महक भी आने  लगती हे.दाल भूनकर तैयार हे. गैस बंद कर दीजिए और दाल को  प्लेट में निकाल लीजिए.\n\n•मावा  को  भूनें. पैन  गरम क्रीजिए और मावा क्रो संबल करते हुए पैन में डाल दीजिए. मावा क्रो धीमी आंच पर लगातार चलाते हुए हल्कऱ ब्राउन होने तक भून लीजिए.माया क्रो अलग प्याले में निकाल लीजिए.काजू और बादाम क्रो छोटे-छोटे टुकडों में काट लीजिए. 1 काजू के 5-6 टुकडे करते हुए काट लीजिए. इसी तरह 1 बादाम के भी 5-6 टुकडे करते हुए काट लीजिए और कुछ बादाम क्रो 2 भाग करते हुए काट कर तैयार कर लीजिए.\n\n•गोंद क्रो भी पैन में डाल कर भूनें. इसके लिए पैन में बचाकर रखे हुए घी क्रो डाल लीजिए. घी के हल्कऱ गरम होने पर  इसमें गोद डाल दीजिए और धीमी आग  एर लगातार चलाते हुए गोद क्रो अच्छे से फूलने तक और हल्कऱ ब्राउन होने तक भून लीजिए. गोद क्रो मीडियम आंच  एर ही भूनें क्योंकि तेज आंच एर भूनने एर गोद बाहर से तो ब्राउन हो जाती  है लेकिन अदर से कच्ची  ही रहेगी. भूमी गोद क्रो अलग प्लेट मेंनिकाल लीजिए. गोद के हल्कऱ सा ठंडा हो जाने एर इसेऋम  या बेलन को मदद से दबाव देते हुए बरीक करलीजिए.\n\n•बचे हुए घी में बारीक को हुए काजू और बादाम डालकरहल्कऱ सा कलर चेंज होने तक भून लीजिए. भूने हुए काजूऔर बादाम क्रो भी प्लेट में निकाल लीजिए.\n\n•पिन्नी के लिए चाशनी बनाए इसके लिए यैन में चीनी और४2 कप से थोडा सा ज्यादा यानी डालकर गैस अग्रेन करलीजिए और चीनी क्रो यानी में अ छी तरह से धुल जाने तकएका लीजिए. चाशनी क्रो जमने वानी य२नसिष्टिज्यों कोबनाकर तैयार वरना हे. जब चाशनी में उबाल जाने लगे तोइसको 2-3 मिनट तक और अ छी तरह से एका लीजिए.(चाशनी को 2-3 बूंदे चम्मच को मदद से प्लेट में निकालकररख लीजिए. अब इसको उंगली और अगूठे के बीच में लेलीजिए, यदि अऱपक्रो चाशनी में से चिरा-धिय महसूस होतीहै और इसमें से 2 या 1 लम्बा तार निकता दिखाई यड़े तोअऱपक्री चाशनी बनकर तैयार हो चुको हैं) . गैस को जाती क्रोबंद कर दीजिए, चाशनी बनकर तैयार हो चुको हे.\n\n•गैस बंद कर दीजिए और चाशनी क्रो हल्कऱ ठंडा होने। . चाशनी में भून कर रखी हुई दाल डाल कर मिला दीजिए, इसमें भूने हुए काजू… बादाम और पिसी हुई गोद भीडालकर अच्छे से मिला दीजिये और मिश्रण क्रो इतना ठंडाहोने दीजिए कि उसे आराम से हाथ में ले सके.\n\n• मिश्रण में इलायची पाउडर और माया डाल कर मिलादीजिए और चा हुआ घी भी इस मिश्रण में डालकर सभीचील क्रो मिलने तक मिक्स क्रीजिए. पिन्नी बनाने के लियेमिश्रण तैयार हे.\n\n•मिश्रण क्रो थोडा… थोडा हाथ में लीजिये और दबा दबा करअपने मन पसन्द जाकर के लड्रडूबना कर थाली में रखिये.सारे मिश्रण से लड्रडूबना कर थाली में रख लीजिये. अबइन लड्रडूओँ क्रो जायतात्ठारशेष में अच्छे से दबाकर तैयार कर लीजिए और को ये दो बादाम लगा कर इसे सजादीजिए. जाए पिन्नी अपनी पसंद ज सार जायतात्प्त८चौकोर या गोल लड्रडूके रूप में जैसे ' बना सकते हैं.\n\n•उड़द दाल माया पिन्नी तैयार हैं. पिन्नी क्रो अच्छे से ठंडाऔर सैट हो जाने एर एअर टाइट कन्टेनर में भर कर रखलीजिये और 1 महिने तक जब भी आपका मन को कन्टेनरसे निकाल कर खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pu8);
                       txt = ("•अलसी - 500 गाम ( 4 कप )\n•गेहूं का आटा - 500 गाम ( 4 कप)\n•'देशी घी - 500 गाम \n•गुड़ या चीनी - 800 गाम ( 4 कप)\n•काजू- 300 गाम\n•बादाम - 300 गाम\n•पिस्ता - 1 टेबलस्कृना\n•क्रिशमिश - 1 टेबल म्पून\n•गोंद … 300 गाम\n•इलाइची - 1 5 (छील कर क्रूट लीजिये)");
                        txt2 = ("•अलसी  की  थाली में डालकर अच्छी तरह छान बीन कर साफ कर लीजिये.\n\n•अलसी को  सूखी कढाई में डालिये, रोस्ट कीजिये  और मिक्सी से पीस लीजिये. इन्हें थोडे दरदरे पीसिये, एकदम बारीक मत कीजिये.\n\n•गेंहू के आटे  क्रो आधा  घी डाल कर ब्राउन होने तक और अच्छी महक आने  तक भून लीजिये. भूने आटे  क्रो किसी थाली  में निकल कर रख लीजिये.गोंद क्रो बारीक तोड़ कर बचे हुये घी में तलिये, गरम घी में थोडा गोद डालिये, गोद फूल जाता है हल्का  ब्राउन होने पर  थाली में निकालिये और सारा गोद इसी तरह तल कर निकाल लीजिये. ठंडा होने एर तले हुये गोद क्रो चकने एर या किसी थाली में बेलन की  सहायता से दबा दबा और बारीक कर लीजिये.\n\nगोद तलने के बाद जो घी बचा हुआ है उसमें पिसी हुई अलसी को  डालिये और कलछी से चला चला कर मीडियम और धीमी आंच  पर  अच्छी महक आने  तक भूनिये और थाली में निकाल लीजिये.\n\n•काजू बादाम और पिस्ते छोटा छोटा काट लीजिये.\n\n•गुड़ या चीनी की मात्रा का आधा पानी  मिलकर कढाई में डालिये और चाशनी बनने के लिये रखिये. चीनी घुलने तक चमचे से चलाइये और 1 तार की  चाशनी तैयार कर लीजिये-चाशनी के टैस्ट के लिये चमचे से 1 बूंद चाशनी प्याले  में गिरायें और ऊंगली अंगूठे के बीच चिपका कर देंखेंकि जब ऊंगली और अंगूठे को  अलग करें तो चाशनी से तार निकलना चाहिये) . आग  बन्द कर दीजिये.चाशनी में भूना आटा , अलसी, काटे हुये मेवे, गोद और इलाइची डाल कर अच्छी  तरह मिला दीजिये. हल्कऱ गरम रहने एर हाथ से थोडा थोडा (एक के बराबर) मिश्रण निकाल कर लड्रडू बनाकर थाली में . सारे मिश्रण  से लड्रडू बनाकर तैयार कर लीजिये या हाथ से चौकोर आकार  देते हुये बरफ्री बना लीजिये.\n\n• अगर आप बर्फी जमाना चाहते हैं तब आप गरम मिश्रण क्रो घी से को चिकनी की  गई थाली में डालिये और एक आकार  करके जमा दीजिये. आधा  घंटे या बरफ्री के जमने के बाद अपना मन  पसन्द टुकडों में काट लीजिये.\n\n• अलसी की  पिन्नी तैयार है अलसी की  पिन्नी क्रो खाइये और बची हुई पिन्नी किसी एयर   टाइट कन्टेनर में भर कर रख लीजिये और 1 महिने तक रोजाना अलसी की  पिन्नी  खाइये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pu9);
                       txt = ("•  उबले  आलू - 2\n• पनीर  - 100 गाम\n• अंजीर - 4 (पानी में भीगे हुए)\n• कॉर्न फ्लोर - 2 टेबल म्पून\n• नमक - 1/2 छोटी चम्मच\n•काली मिर्च पाउडर… 1/4 छोटी चम्मच\n•तेल- तलने के लिए और ग्रेवी  बनाने के लिए  सामग्री-\n•टमाटर- 150 गाम टमाटर\n•हरी मिर्च… 2\n•काजू - 20-25\n•हरा धनियां - 2 टेबल स्पून  (बारीक कटा हुआ )\n• अदरक पेस्ट - 1 छोटी चम्मच\n•जीरा -1 छोटी चम्मच\n• हल्दी पाउडर - 1 /4 छोटी चम्मच\n• लाल मिर्च पाउडर … 1 /4 छोटी चम्मच\n•गरम मसाला … 1 /4 छोटी चम्मच\n•धनिया  पाउडर - 1 छोटी चम्मच\n•नमक - स्वादानुसार रा छोटी चम्मच)");
                        txt2 = ("•उबले  आलू  क्रो छील लीजिए. एक प्याले में आलू और पनीर  क्रो कदूकस कर लीजिए. इसमें नमक, काली मिर्च और थोडा सा हरा धनियां और कॉर्न फ्लोर डालकर सारी सारी चीजें अच्छी तरह मिक्स कर लीजिये और इसे आटे  अच्छी तरह मसल… मसल कर चिकना करते हुए  कर लीजिए अंजीर  क्रो छोटे- छोटे टुकडों में काट लीजिये \n\n•एक गोले क्रो उठाइये और हाथ एर रख कर उंगली और अगूठे की  सहायता से बडा कर लीजिये, अजीर के 3-4 टुकडे गोले के ऊपर रखिये और चारों और से स्टफिग क्रो बंद कर दीजिए. गोले क्रो हाथों से अच्छी  तरह गोल करके प्लेट में रख दीजिए. इसी तरह सारे कोफ्ते भर कर तैयारकर लीजिये.\n\n•कढाई में तेल डाल कर गरम कीजिये. तेल पर्याप्त गरम होने एर 4-5 कोफ्ते गरम तेल में डालिये और गोल्डन ब्राउनहोने तक तल  कर प्लेट में रखिये, सारे क्रोफ्त इसी तरह तल कर निकाल लीजिये.\n\n•क्रोफ्ते के लिये ग्रेवी-टमाटर, हरी मिर्च और काजूक्रो मिक्सी से बारीक पीस लीजिये. कढाई में बचा तेल निकाल कर केवल 2 टेबल म्पून तेल रहने दीजिए. गरम तेल में जीरा डाल दीजिये   जीरा भूनने एर, हल्दी पाउडर, धनियां पाउडर डाल कर मसाले क्रो थोडा सा भून लीजिए. अब इसमें अदरक  पेस्ट और टमाटर, काजू हरी मिर्च का पेस्ट मसाले में डाल कर तब तक तलिये  जब तक, मसाला तेल न छोड़ने लगे, मसाले में लाल पाउडर डाल दीजिए और बीच-बीच में चलाते हुए भूनें.\n\n• मसाले से तेल अलग होने एर मसाला भून कर तैयार है इसमें 1 कप यानी डाल दीजिए, नमक, गरम मसाला और कटा हरा धनिया डाल कर मिक्स करते हुए एक उबाल जाने तक पकाए. ग्रेवी  में उबाल आने  के बाद गैस को आंच को  धीमा कर दीजिए और ढककर के 3-4 मिनिट पकने दीजिए.\n\n•ग्रेवी बनकर तैयार है गैस बंद कर दीजिए और ग्रेवी  क्रो प्याले में निकाल  लीजिए व कोफ्ते डाल दीजिए, उपर से हरा धनियां डाल कर सजाइये. अंजीर क्रोफ्तऱ को बनकर केतैयार है इसे जाए चपाती, परांठे, नान, पूरी किसी के भीसाथ परोसिये और खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pu10);
                       txt = ("•  करेले  - 300 गाम (8-9 करेले)\n•सरसों का तेल - 4-5 टेबल म्पून\n•जीरा - आधा  छोटी चम्मच\n•हींग - 1 -2 र्पिच\n• खसखस - 1 टेबल म्पून\n•सोंफ पाउडर - 2 छोटे चम्मच\n• धनिया पाउडर - 2 छोटे चम्मच\n• हल्दी पाउडर - 3/4 छोटी चम्मच\n• दही … 2 टेबल म्पून\n• सोंठ पाउडर - आधा  छोटा चम्मच\n•गरम मसाला - आधा  छोटी चम्मच\n• नमक - स्वादानुसार (1 छोटी चम्मच)\n• अमचूर पाउडर - 1 छोटी चम्मच\n•हरी मिर्च - 1 -2 (बारीक कतरी हुई)");
                        txt2 = ("•करेले  क्रो दोंनो और से डंठल काट कर अच्छी  तरह धो लीजिये, धुले कोने छलनी में रखिये और अतिरिक्त पानी  हटा दीजिये, करेले  क्रो इस तरह कसिये  कि चह दूसरी और से जुड़ा रहे , आधा  छोटी चम्मच नमक लीजिये और सारे करेले के कटे भाग  में थोडा थोडा नमक लगा कर रख\n\n•किसी बर्तन में इतना पानी  लीजिये जिसमें कि करेले  आसानी से डूब सकें पानी को  गरम करने पर रख दीजिये, पानी में उबाल जाने के बाद उबलते पानी में करेले  डालिये और ढककर मीडियम आग  एर करेले नरम होने तक उबलने दीजिये , ध्यान रहे कि करेले इतने नरम न हों के वे मैस होने लगे .उबाल हुये करेले छलनी में डालिये और पानी  निकाल दीजिये, करेले जब एकदम  हो जायं, तब उनके अन्दर से अतिरिक्त पानी हो तो हटा दीजिये. करेले के अन्दर के बीज चाकू की  सहायता से निकाल कर प्लेट में रखिये और बीज निकाले करेले  किसी दूसरी प्लेट में रखिये, सारे करेले  के बीज निकाल कर एक प्लेट में और करेले  दूसरे प्लेट में रख लीजिये.\n\n•कढाई में 2 टेबल म्पून तेल डाल कर गरम कीजिये, गरम तेल में जीरा, खसखस और हींग डालिये, जीरा भूनने एर,साधा छोटी चम्मच हल्दी पाउडर, सौंफ पाउडर और धनियां पाउडर डालिये, मसाले में करेले  के बीज डालिये और चमचे चमचे से चलाते हुये 2 मिनिट भूनिये, भूने मसाले में दही डालिये और जब तक भूनिये कि दही का पानी  सूख जाय और मसाले दही क्रो अपने अन्दर शोक ले, जाग बन्द कर दीजिये और इस मसाले में सौंठ पाउडर, गरम मसाला, नमक,अमचूर पाउडर और कपूरी हुई हरी मिर्च डालकर मिलाइये.कोने में भरने के लिये मसाला तैयार हे.\n\n•जिंतने करेले  हैं, मसाले क्रो उतने भागों में बांट लीजिये.एक करेला उठाइये और मसाला भर कर प्लेट में रखिये,इसी तरह सारे कोने मसाला भर कर प्लेट में रख लीजिये.\n\n•कढाई में तेल डालकर गरम कीजिये, तेल में 1 /4 छोटी चम्मच हल्दी डालिये और करेले  सिकने के लिये तेल में लगाकर रख दीजिये, मीडियम आंच एर करेले  सिकने दीजिये, 3-4 मिनिट बाद कोने को साइड साचधानी से चमचे और चिमटे को सहायता से पलट कर बदल दे, इस तरह सभी तरफ से कोने ब्राउन होने तक सेक  लीजिये. 12-15 मिनिट में कोने गोल्डन सिक कर खाने के लिये तैयार हो जाते हैं.\n\n•सिके हुये भरवां करेले   किसी प्लेट में निकाल कर रखें, चपाती, परांठे या चावल के साथ परोस\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pu11);
                       txt = ("•स्वीटकार्न - 150 गाम (एक कप )\n•पालक  - 750 गाम (एक छोटा बन्च )\n•-सोया   - 200 गाम\n• टमाटर - 3-4 (मध्यम आकार  के)\n•हरी मिर्च - 1 -2\n• अदरक - 1 इंच लम्बा टुकडा\n•जीरा - 11 /2 छोटी चम्मच\n•दाना मैथी - 1 छोटी चम्मच \n•धनिया - 1 छोटी चम्मच\n•तेल - 2 बड़ी  चम्मच\n•बेसन  - 1 बड़ी  चम्मच\n•'हल्दी पाउडर - आधा  छोटी चम्मच\n•नमक - स्वादानुसार (एक छोटी चम्मच\n•लाल मिर्च - एक चौथाई छोटी चम्मच से कम");
                        txt2 = ("•पालक  से डंडिया तोड़ लीजिये और धोकर बारीक काट लीजिये, सोया   से डंडिया हटा कर , धोकर, बारीक काट लिजिये. स्वीटकार्न धोकर साफ कर लीजिये. \n\n•तवे एर जीरा, मैथी और धनिया डालकर हल्का ब्राउन होने तक भून लीजिये.\n\n•टमाटर धोइये, टुकडे कीजिये, हरी मिर्च धोइये, डंठल निकाल दीजिये, अदरक छीलकर धोइये और टूकड़े  कीजिये. सभी क्रो मिक्सर में डालिये और साथ में भूने मसाले डालकर बारीक पीस लीजिये.\n\n•बेसन क्रो किसी छोटी कढाई में डालकर सूखा ही हल्का  ब्राउन होने तक भून कर  प्लेट में रख लीजिये.\n\n•कढाई में तेल डाल कर गरम कीजिये, गरम तेल में छोटी साधा चम्मच जीर डालिये, जीरा भूनने एर हल्दी पाउडर डालिये और अब पिसा मसाला डाल दे , मसाले क्रो तब तक भूनिये जब तक कि मसाले के ऊमर तेल न दिखने लगी \n\n•भूने मसाले में क़तरा हुआ पालक, सोया और स्वीटकार्न और एक कप पानी  में बेसन घोल कर डाल दीजिंये(सब्जी  में तरी क्रो अगर पतला करना  है तो आवश्यकताअनुसार  पानी  डाल सकते हैं) . नमक और लाल मिर्च भी डालकर मिला दीजिये. सब्जी  में उबाल आने  के 12 -15 मिनिट सब्जी को  एक सार होने तक पका  लीजिंये(सब्जी  चमचे से गिराने एर पानी के साथ साथ गिरे)\n\n•पालक सोया  स्वीटकार्न करी  तैयार है सब्जी  को प्याले में निकालिये और मवखन डालकर सजाइये. गरमा गरम स्वीटकार्न पालक  सोया तरी, मवखन डली हुई, चपाती, नान या चावल के साथ परोसिये \n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pu12);
                       txt = ("• मटर - 1 कप\n•पनीर  - 250 गाम\n•टमाटर - 250 गाम\n•हरी मिर्च - 2\n•तेल - 3-4 टेबल स्पून \n•-क्रीम- 1/2 कप ( 300 मिली)\n•हरा धनिया - 3-4 टेबल ट्यून (बारीक कटा हुआ \n• अदरक पेस्ट - 1 छोटी चम्मच\n•जीरा - 1 /2 छोटी चम्मच\n•हींग - 1 र्पिच\n• हल्दी पाउडर - 1 /2 छोटी चम्मच\n• धनिया पाउडर - 1 छोटी चम्मच\n•लाल मिर्च पाउडर … 1 /4 छोटी चम्मच\n•गरम मसाला … 1 /4 छोटी चम्मच या स्वादानुसार");
                        txt2 = ("•पनीर को 1 -1 इंच के टुकडों में काट कर तैयार कर लीजिए. पैन  में 2 छोटी चम्मच तेल डालकर गरम कीजिए. तेल के गरम होने एर एमीर के टुकडे डाल कर स्नेक लीजिए. पनीर के टुकडों को पलट कर 2 और से गोल्डन ब्राउन होने तक रोके और प्लेट में निकल लीजिये.\n\n• अब पैन  में मटर के दानों को डालकर 2 मिनिट के लिए ढक कर के धीमी आंच एर पका लीजिए. 2 मिनिट बाद इन्हें चैक क्रीजिए, मटर के दाने हल्के नरम हो गये हैं, इम्हें प्याले में निकाल लीजिए.\n\n• टमाटर, हरी मिर्च क्रो मिक्सी से बारीक पीस लीजिये. \n\n•ग्रेवी बनाने के लिए पैन  में 2 टेबल स्पून  तेल डालकर गरम क्रीजिए. गरम तेल में जीरा, हींग, हल्दी पाउडर, धनिया पाउडर और अदरक का पेस्ट डाल कर हल्कऱ सा भूनिये, और अब टमाटर, हरी मिर्च का पेस्ट और लाल मिर्च पाउडर डाल कर मसाले क्रो तब तक भुनिये जब तक मसाले के ऊमर तेल तैरता दिखने लगे.\n\n•मसाला भून जाने एर इसमें क्रीम डाल दीजिए और मसाले क्रो लगातार चलाते हुए तब लक भूने जब तक की  उबाल न जा जाए मसाले में उबाल आने  एर इसमें 1 कप पानी  डालकर मिक्स क्रीजिए और ग्रेवी को  फिर से लगातार चलाते हुए उबाल जाने तक पकाए.\n\n•ग्रेवी में उबाल आने  एर इसमें नमक, गरम मसाला और बारीक कटा हुआ हरा धनिया डाल कर मिला दीजिए. अब ग्रेवी में भूना हुआ पनीर  और मटर के दाने डाल दीजिए, सभी  क्रो अच्छे से मिला दीजिए. सब्जी  क्रो ढककर के 4-5 मिनिट धीमी आच एर पकने दे . \n\n•सब्जी  क्रो चैक क्रीजिए, सब्जी  बनकर तैयार हैं. इसे प्याले में निकाल लीजिए और हरे धनिये क्रो ऊप्पर  से डाल कर सजाइये. गरमा गरम मटर एमीर को सब्जी, परांठे, नॉन या चपाती किसी के भी साथ परोसिये और खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                }
                break;
            }

            case "South Indian Receipes": {
                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);
                        img.setImageResource(R.drawable.su1);
                       txt = ("•1 कप ओटस (पिसा सूजी)\n•1/2 कप सूती\n•1 कप दही\n• 1 मध्यम आकार  का प्याज (बारीक कटा हुआ )\n• 2 बडे चम्मच गाज़र (कदूकस करी हुई)\n• 2 बडे चम्मच पत्तागोभी (बारीक कटी या कदूकस करी )\n•2 बडे चम्मच शिमला मिर्च (ककदूकस करा हुआ)\n• 1 -2 हरी मिर्च बारीक कटी हुई \n• 1 बडा चम्मच हरी धनिया (बारीक कटी हुई)\n• स्वादानुसार नमक\nसेकने  के लिए तेल");
                        txt2 = ("•एक बडे बर्तन में सूजी , ओटस और दही और थोडा पानी डाल के अच्छे से मिला दे. फिर आधे घंटे के लिए ढक के रख दे.\n\n• आधे घंटे के बाद मिश्रण में सारी सब्जिया और नमक  मिला दे . अगर बहुत गाढा लगे तो थोडा पानी मिला के दोसे जैसा मिश्रण तैयार कर ले.\n\n• एक नॉन स्टिक तवा या पेन गरम करे थोडा तेल डाल के चिकना कर ले. फिर एक बडा चम्मच मिश्रण डाल के गोल फैला दे. आंच धीमी करके हर तरफ से थोडा तेल डाल दे.\n\n• जब उत्पम  किनारे से उठने लगे तो पलट दे और दूसरी  तरफ से भी थोडा तेल डाल के सेक  ले.\n\n•तवे से उतार के गरम गरम उत्तपम नारियल को चटनी या किसी भी मन पसंद चटनी के साथ परोसे.\n\n•सारे मिश्रण से इसी तरफ से उत्तपम बना ले.\n\n•साचधानी- उत्तपम ज्यादा बडे न बनाये नहीं तो पलटने  में टूट जायेगे\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }

                    case 1: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.su2);
                       txt = ("•3 ब्रेड स्लाइसेस \n •3 बडे चम्मच सूजी\n•1 कप फेटा हुआ दही\n•-1/2 कप बारीक कटी  प्याज-1/2 कप बारीक कटा हुआ टमाटर\n• 1 हरी मिर्च बारीक कटी  हुई\n•1 बडा चम्मच हरी धनिया बारीक कटी  हुई\n•-1/2 छोटा चम्मच काली मिर्च पाउडर\n• स्वादानुसार नमक\n•सेकने  के लिए तेल");
                        txt2 = ("•ब्रेड की  स्लाइसेस से किनारे काट के ब्रेड को छोटे टुकडो में काट ले.\n\n•दही को थोडा पतला करले, ब्रेड को दही में 5 मिनट के लिए भीगा दे.\n\n•सूजी  मिला के हैण्ड मिक्सर से अच्छे से फेट के रमूथ बैटर बना ले .\n\n• प्याज, टमाटर, हरी मिर्च, धनिया, नमक और काली मिर्च डाल के मिला दे.\n\n•तवा गरम करे , थोडा तेल डाल के चिकना कर ले, फिर बैटर डाल के गोल फैला दे. चारों तरफ से तेल डाल के करारा और सुनहरा होने तक सेक ले,  पलट के दूसरी तरफ से भी सेक ले. इसी तरह से सारे उत्तपम बना ले.\n\n•हरी चटनी या नारियल को चटनी के साथ परोसे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.su3);
                       txt = ("•कप आटा \n 3/4 कप चावल का आटा \n•-1/2 कप खट्टा दही\n•1/2 कप बारीक कटा हुआ प्याज\n•हरी मिर्च बारीक कटी  हुई\n•बड़ा चम्मच हरा धनिया बारीक कटी  हुआ\n•-1/2 छोटा चम्मच राई\n •8-10 को पत्ते\n•-1/2 छोटा चम्मच जीरा\n• स्वादानुसार नमक\n• कप पानी \n•तेल");
                        txt2 = ("•दही में पानी  मिला के पतला कर ले.\n\n• आटा , चावल का आटा  छान के एक बडे बर्तन में निकल ले.\n\n•उसमै कटा हुआ प्याज, हरी मिर्च, हरी धनिया मिला दे.\n\n• दही और पानी  का घोल डाल के अच्छे से मिला दे,गुल्थी नहीं पड़नी चाइये \n\n • पतला घोल बना ले, अगर पानी  कम लगे तो और मिला ले.\n\n• एक तड़का पेन मे एक चम्मच तेल डाल के गरम करे , राई, जीरा और को पत्ता डाल के भूने गैस बंद करके तडके क्रो जाते के घोल के ऊपर डाल दे.\n\n• नमक डाल के अच्छे से मिला दे.\n\n• नॉन स्टिक तवा या डोसा तवा गरम को एक चम्मच तेल डाल के चिकना करे.\n\n• साधा कप आटे  का मिश्रण थोडा ऊपर से तवे के ऊपर डाले (करीब 4-5 इंच ऊपर से) मध्यम आंच एर पकने देचारों तरफ से तेल डाल दे. जब डोसा एक तरफ से पकजाये तो पलट के दूसरी तरफ से  पका  ले.\n\n•इसी तरह से सारे मिश्रण से दोसे बना ले.\n\n•गरम गरम डोसा नारियल को चटनी या हरी चटनी के साथ परोसे. \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.su4);
                       txt = ("•टमाटर - 4-5\n•जीरा - 1 छोटी चम्मच\n•काली मिर्च - 8-3 0\n•लौग - 2-3\n•दाल चीनी - एक टुकडा\n•लाल मिर्च -1\n• अदरक - 1 इंच लम्बा टुकडा (कटा हुदा)\n•तेल या मक्खन - 2 छोटी चम्मच\n•नमक- स्वादानुसार\n•हरा धनिया- 2 टेबल म्पून (कतरा हुदा)\n•त्तड़के के लिए.\n•गोल या मक्खन… 1 टेबल म्पून से कम\n• जीरा - आधा  छोटी चम्मच\n•राई - साधा छोटी चम्मच\n•हींग - 1 -2 र्पिच\n•करी पत्ता - 8-10");
                        txt2 = ("•सारे टमाटरों क्रो धो कर इन्हें बड़े-बड़े टुकडों में काट लें.\n\n• एक कढाई में तेल या मक्खन गरम कर लें. इसमें जीराडाल कर त्तड़का लें. अब काली मिर्च, लौग, दाल चीनी, लालमिर्च डालें और हल्का सा भून लें   बाद टमाटर का पेस्ट डाल दें. 4 कप यानी और नमक डाल कर इसे उबाल जाने तक पका  लें. स्वादिष्ट टमाटर रस तैयार हे.\n\n•इसे किसी प्याले में निकाल कर ऊपर से हरा धनिया डालकर सजाएं और गरमा-गरम टमाटर रस क्रो चावल के साथ खाएं या फिर सूप को तरह पिएं.\n\n•अगर आपको  प्याज और लहसुन पसंद है तो 5-6 कलियां लहसुन और 1 प्याज क्रो बारीक काट लें. जीरा भूनने केबाद इन्हें भूनें और फिर बताई विधि अनुसार बना लें\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.su5);
                       txt = ("•राई (काली सरसों) - 2 टेबल म्पून \n•पीली सरसो- 2 टेबल म्पून\n•  कच्चे आम  - 200 या 300 गाम (मीडियम आकार  के)\n• अदरक - 2 इंच लंबा टुकडा\n•-हरी मिर्च - 4-5\n•लाल मिर्च - 1 /2 छोटी चम्मच\n•जीरा - 1 छोटी चम्मच\n• धनिया पाउडर - 2 छोटी चम्मच\n•चीनी - 1 छोटी चम्मच \n•सरसों का तेल - आधा  कप\n• हींग - 1 /4 छोटी चम्मच से कम\n•हल्दी पाउडर - 1 छोटी चम्मच\n• सिरका - एक चौथाई कप\n•नमक - 2 छोटी चम्मच (स्वादानुसार)");
                        txt2 = ("•एक बर्तन में पानी  लेकर उसमें नमक और हल्दी डाल कर अच्छे से मिला लें. ध्यान रहे कि पानी  इतना हो जिसमें केले के चिप्स आसानी  से डूब सके.\n\n• केलों क्रो अच्छे से धो कर छील लें. छीलने के बाद चिप्स कटर को मदद से केलों के चिप्स काट लें. सारे चिप्स क्रो तैयार किए यानी में डाल कर 5 मिनट के लिए ऐसै ही रहने 5 मिनट बाद इन्हें निकाल कर किसी सूती के कपडे  पर पानी  डाल कर इनका सारा पानी  सुखा लें.\n\n• पारम्परिक तरीके से केले के चिप्स क्रो नारियल के तेल में तला जाता हे. लेकिन आप  इसे रिफाइंड तेल में भी तल सकते हैं. चिप्स क्रो तलने के लिए एक कढाई में तेल डाल कर गरम करें.\n\n•थोडे से केले के चिप्स लेकर इन्हें गरम तेल में डालें. चिप्स क्रो करारा  होने तक हिलाते हुए तल लें और फिर किसी प्लेट में लें. बाक्री सारे चिप्स क्रो भी इसी तरह तल कर निकाल लें.\n\n•केले के स्वादिष्ट और करारे चिप्स तैयार हैं. गरमा- गरम चाय के साथ इनका मजा ले .बाक्री बचे हुए चिप्स क्रो किसी एअर टाइट कंटेनर में भर कर रख सकते हैं. ये चिप्स 1महीने तक खराब नहीं होते. फिर जब भी आपका  मन हो इन्हें निकाल कर खा लें.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.su6);
                       txt = ("•चावल - 1 कप\n•ताजा  कच्चा  नारियल - 2-3 टेबल ट्यून (कदूकस क्रिया हुआ )\n•तेल - 2-3 टेबल ट्यून\n•नमक - 1/2 छोटी चम्मच या स्वादानुसार");
                        txt2 = ("•चावल क्रो साफ करके, धोकर 2-3 घंटे के लिये पानी में भिगो दीजिये.\n\n•चावल से अतिरिक्त पानी निकाल दीजिये और चावल क्रो मिक्सर में डालिये साथ ही नारियल क्रो भी इसी के साथ डालकर एकदम बारीक पीसकर पेस्ट बना लीजिए.\n\n•चावल और नारियल के पेस्ट क्रो प्याले में निकाल लीजिए.मिश्रण में डेढ़ कप पानी डाल कर मिक्स कर लीजिए.मिश्रण क्रो एकदम पतला पेस्ट बनाकर तैयार करना  होता है  मिस्रण   में नमक डालकर इसे अच्छे तरह मिक्स कर लीजिये \n\n• दोसा बनाने के लिये  नॉनस्टिक  तवा गरम कीजिये और तवे पर  थोडा सा तेल डालकर चारों और फैलाइये, मिश्रण से 2-3 चमचा घोल लेकर तवे एर डाल कर पतला फैलाइये. थोडा सा तेल चम्मच  के चारों और डालिये. तेज और मीडियम गैस पर  दोसे   क्रो नीचे की  और से हल्कऱ ब्राउन सिकने दीजिये.\n\n•दोसा निचली सतह एर ब्राउन सिकने पर  इसे पलट कर रोकने को आवश्यकता  नहीं है क्योकि  यह इतना पतला होता  है कि यह नीचे से सिकने  पर  ही पूरी तरह पक जाता है. दोसे  क्रो फोल्ड करके उतार कर प्लेट में रख लीजिये और दूसरा दोसा बनाने के लिये तवा पोछिए  और घोल डाल कर दोसा फैलाइये और नीचे से हल्कऱ ब्राउन होने तक सेक  कर फोलड करके उतार लीजिये, सारे दोसे  इसी तरह बना कर तैयार कर लीजिये.\n\n•इतने घोल से 7- 8 नीर दोसा बनकर तैयार हो जायेंगे, नीर डोसा क्रो नारियल को चटनी, मूंगफली को चटनी या साम्भर  के साथ परोसिये और खाइये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.su7);
                       txt = ("•रवा (सूजी) - 300 ग्राम  \n•दही … 300 ग्राम  \n• नमक - स्वादानुसार या 1 छोटी चम्मच\n•ईनो साल्ट - 3/4 छोटी चम्मच\n•तेल - 2 बड़ी  चम्मच\n•राई - एक छोटी चम्मच\n•कड़ी कटी हुई - 10 - 12\n•उरद दाल … 1 छोटी चम्मच\nहरी मिर्च - 1 (बारीक कटी हुई)पिट्ठी बनाने के लिये-\n•उबले  आलू - 2 मीडियम आकार  के\n•पालक- एक कप बारीक कटा हुआ\n•हरी मिर्च - 1 (बारीक कटी  हुई)\n• अदरक पेस्ट - 1 छोटी चम्मच\n• नमक - साधा छोटी चम्मच\n•तेल - 2 छोटी चम्मच");
                        txt2 = ("•सबसे पहले  दही क्रो फैट लीजिये.\n\n• किसी बर्तन में सूजी छान लीजिये और उसमें दही डाल कर अच्छी तरह मिला लीजिये. घोल गाढा है इसमें थोडा सा पानी  इतना कि घोल पर्याप्त गाढा रहे, नमक डाल कर घोल क्रो फैट लीजिये, मिश्रण के अन्दर गुठलियों न रहे. सूजी के घोल क्रो 15 मिनिट के लिये रख दीजिये ताकि सूजी फूल कर तैयार हो जाय.\n\n•किंसी छोटी कढाई में 2 छोटी चम्मच तेल डालकर गरम कीजिये, राई डालिये, राई के त्तड़कने पर , उरद दाल  दाल क्रो हल्कऱ ब्राउन होने तक भून लीजिये,हरी मिर्च डालकर थोडा सा भून लीजिये, सारे मसाले मिश्रण में मिला दीजिये.\n\n• पिट्ठी  बना लीजिये\n\n• आलू क्रो छील कर बारीक तोड़ लीजिये, कढाई में तेल  गरम कीजिये, राई डालिये, राई त्तड़कने के बाद,हरी मिर्च और अदरक डालिये, पालक डालकर नरम होने तक पकाइये नमक डालिये और अच्छी  तरह मिला दीजिये, इडली में भरने के लिये पिट्ठी  तैयार हे.\n\n•इडली बनाने के लिये:-\n\n•क्रुकर में 2 - 3 कप यानी डालकर कर  रख दीजिये पानी  क्रो गरम होने दीजिये.\n\n• मिश्रण में ईनो साल्ट डालकर  चमचे से हिलाकर कर अच्छी तरह  मिला लीजिये… जैसे ही  मिश्रण फैलने  लगता है चमचे  चलाना बन्द कर दीजिये (ईनो साल ट डालने के बाद मिश्रण क्रो ज्यादा नहीं मिटना होता)\n\n•इडली  क्रो थोडा थोडा तेल लगा कर चिकना कर लीजिये. मिश्रण क्रो चमचे की  सहायता से इडली के प्रत्येक खाने में थोडा थोडा आधे खाने से कम भर दीजिये. पिट्ठी  उठाइये और मिश्रण के ऊप्रर प्रत्येक खाने में रखिये, मिट्ठी के ऊप्रर से चमचे से मिश्रण डालकर पिट्ठी  क्रो ढक दीजिये. इडली  के सारे खांचे इसी प्रकार भर कर तैयार कर लीजिये.\n\n•एक बार में इडली स्टैंड  के अनुसार 12 या 18 इडली बन जाती है . इडली स्टैंड में खाचों क्रो जमा कर लीजिये और कूकर के पानी  में भाप आने  पर  इडली स्टैंड कुकर में रख कुकर का दक्कन  लगा दीजिये लेकिन दक्कन  से सीटी हटा लीजिये.\n\n•तेज आंच पर इडली क्रो 10 मिनिट तक पकने  दीजिये,कुकर का दक्कन  खोलिये  (देखने के लिये कि इडली बन गई है इडली के अन्दर चाकू गोद कर  देख  लें यदि चाकू से मिश्रण नहीं चिपकता  तब इडली बन चुको हैं) इडली स्टैंड क्रो कुकर से निकलिये, खांचे  अलग कर लीजिये, ठंडा होने पर  चाक़ू की  सहायता से खाचों से इडली निकाल कर प्लेट में रख लीजिये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.su8);
                       txt = ("•चावल 1 कप\n•पानी 2 कप\n•दूध 1 कप\n•फ्रेटा हुआ दही 1 कप\n• राई 1/4 चम्मच\n• चना और उरद दाल 1/2 चम्मच\n• हरी मिर्च लम्बी  कटी  हुई 2\n• कड़ी  पत्ता 5-6\n•हींग 1 चुटकी\n•तेल 1 चम्मच\n• नमक स्वादानुसार\n• धनिया, अनार के दाने और अंगूर सजाने के लिए");
                        txt2 = ("चावल क्रो धोकर, 2 कप पानी के साथ कुकर में पका  ले.\n\n•पकने के बाद उसमें नमक और एक कप दूध मिला के अच्छे से मसल ले.\n\n• एक कढाई में तेल गरम करके  राई डाले जब राई त्तड़क जाये,तो दाल डाले और सुनहरा होने दे \n\n•हींग करी पत्ता और हरी मिर्च डाले \n\n•चावल मिला दे  और गैस बंद कर दे \n\n•फैटा  हुआ दही अच्छे से मिला दे तो दाल डाले और सुनहरा होने दे \n\n•हींग करी पत्ता और हरी मिर्च डाले \n\n•चावल मिला दे  और गैस बंद कर दे \n\n•फैटा  हुआ दही अच्छे से मिला दे \n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.su9);
                       txt = ("•1 छोटी ताजी लौकी\n• 1 प्याज कटा हुआ \n•1 -2 टमाटर कटे  हुए\n• 2 चम्मच ताजा कदूकस करा हुआ नारियल\n• 3 चम्मच भुनी  मूंगफली\n• 5- 6 लहसून\n• 2- 3 हरी मिर्च \n•1/4 चम्मच हल्दी\n•1/4 चम्मच लाल मिर्च पाउडर\n• -1/2 चम्मच जीरा\n• 2 चम्मच तेल ।\n •नमक स्वादानुसार\n•हरी धनिया 1 चम्मच (बारीक कटी  हुई)");
                        txt2 = ("•लौक्री क्रो छीलकर छोटे- छोटे टुकडो में काट ले.\n\n• एक कुकर में लौक्री, टमाटर, नमक, हरी मिर्च और हल्दी डालकर बिना पानी  के एक सीटी आने पका  ले. (लौकी पानी  छोड़ देगी)\n\n• एक कढाई में 1 चम्मच तेल गरम करके  और उसमे प्याज और लहसुन क्रो पका  ले.\n\n• ठंडा होने के बाद प्याज लहसुन, क्रोक्रोनट, और मूंगफली क्रो मिलाकर पेस्ट बना ले .\n\n• अब फिर से कढाई में तेल गरम करके , उसमे जीरा डाले और पिसा हुआ पेस्ट डालकर २ मिनट के लिए उठाए और उबली हुई लौकी , नमक और लालमिर्च पाउडर डालकर 5मिनट और उठाए, गैस छंद करदे.\n\n• गरमागरम लौकी को सब्जी  हरी धनिया से सजा कर रोटी के साथ परोसे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.su10);
                       txt = ("•कटहल- 400 गाम\n•काजू- 50 गाम ( 25 - 30)\n• टमाटर - 300 गाम ( 4-5 )\n•-हरी मिर्च - 2-3\n•अदरक - 1 इंच लम्बा टुकडा\n•रिफाइन्ड तेल - 2-3 टेबल म्पून\n•हींग - 1 -2 र्पिच\n•जीरा - साधा छोटी चम्मच\n• हल्दी पाउडर - एक चौथाई छोटी चम्मच\n•धनियां पाउडर - एक छोटी चम्मच\n•लाल मिर्च पाउडर - एक चौथाई छोटी चम्म\n•नमक - स्वादानुसार ( एक छोटी चम्मच)\n•गरम मसाला - एक चौथाई छोटी चम्मच\n•हरा धनियां - एक टेबल म्पून (बारीक कटा हुआ )");
                        txt2 = ("•कटहल का छिलका तो दूकान दार से ही उतरवा कर कटहल लाइये. कटहल धोइये, हाथों क्रो थोडा सा तेल लगाकर चिकना कीजिये. कटहल के 1 या 2 इंच के टुकडे काट लीजिये.\n\n कटहल के टुकडे कुकर में डालिये और साधा गिलास यानी एक चौथाई चम्मच नमक डालकर , एक सीटी आने  तक उबाल लीजिये, इन्हे  हम माइक्रोवेव में भी उबाल सकते हैं.उबाले हुये कटहल के टुकडों से पानी  बिलकुल हटा दीजिये.कटहल  के बीजो से छिलके छील कर निकाल दीजिये.\n\n• तरी : हरी मिर्च के डंठल  छोडिये, अदरक छीलिये और धो लीजिये, टमाटर भी धोकर साफ कर लीजिये और इन सबको मिक्सर से पीस कर पेस्ट तैयार कर लीजिये.\n\n•काजू क्रो गरम यानी में आधा घंटे के लिये भिगो दीजिये.भीगे हुये काजू बारीक पीस कर पेस्ट तैयार कर लीजिये.\n\n•कड़ाई में तेल डाल कर गरम कीजिये. आंच  धीमी कर लीजिये. गरम तेल में हींग और जीरा डालिये, जीरा हल्कऱ बाउन होने एर, हल्दी पाउडर, धनियां पाउडर और पिसा हुआ काजू का पेस्ट  डालिये, 2-3 मिनिट भूनिये, टमाटर, हरी मिर्च  अदरक का पेस्ट डालिये, मसाले क्रो जब तक भूनिये तब तक कि मसाला के ऊमर तेल न तैरने लगे.\n\n•भूने हुए  मसाले में उबाले हुये कटहल  के टुकडे डाल कर 2मिनिट भून लीजिये. आवश्यकताअनुसार पानी  (एक गिलास पानी) डालिये. नमक और लाल मिर्च भी डाल कर मिला दीजिये. उबाल आने  के बाद, ढककर सब्जी  क्रो 4 - 5मिनिट तक एकदम धीमी आंच  पर  पकने दीजिये, ताकि सारे मसाले कटहल  के अन्दर तक चले जायं, आंच  बन्द कर दीजिये, गरम मसाला और हरा धनियां डाल कर कटहल  करी में मिलाडये.\n\n•कटहल को गरमा गरम सटजी चपाती, नान, परांठे या चावल किसी के साथ परोसिये और खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.su11);
                       txt = ("•चावल एक कप\n• सूजी एक बड़ी चम्मच\n• खमीर के दोनों चौथाई  छोटी चम्मच\n• चीनी दो बड़े चम्मच\n• नारियल एक\n• नमक चौथाई छोटी चम्मच\n• काजू किशमिश बादाम चार चार ");
                        txt2 = ("•चावल  क्रो तीन  घंटे के लिये भिगो दें और इसे मिक्सी में एकदम बारीक पीस लें.\n\n•सूजी क्रो एक कप पानी  में डालकर लगभग पांच मिनट तक पका  लीजिये और गैस से उतार कर ठंडा करने के लिये रख .\n\n• एक कटोरी में आधा चम्मच चीनी, खमीर के दाने और एक बडा चम्मच गुनगुना पानी  मिला कर घोल लें. अब पिसे हुये चावल, पक्री हुई सूजी और खमीर के मिश्रण क्रो अच्छी  तरह मिला कर लगभग 8 घंटे के लिये रख दें ताकि इसमें खमीर उठ जाय.\n\n•नारियल और चीनी क्रो मिलकर मिक्सी में एकदम बारीक पीस लें और इस फूले हुये मिश्रण में मिला दें. बाटे अप्पम बनाने के लिये मिश्रण तैयार है.गैस जला कर कुकर में 2 गिलास पानी   डाल कर रख दें और कुकर के स्नेषरेटर में थोडा सा घी लगादें. मिश्रण क्रो सेपरेटर में फैला दें. फैले हुये मिश्रण को ऊंचाई लगभग एक इंच होमी चाहिये. इस मिश्रण के ऊपर काजू बादाम काट कर सजा दें सेपरेटर  क्रो कुकर में इस तरह रखे कि वह  कुकर के तले क्रो न छुए. कुकर बन्द कर दें लेकिन ढचकन में सीटी नहीं लगायें. 15 मिनिट में यह बन जाता हे. यह देखने के लिये कि यह पक गया है इसमें चाकू की नोंक गुसोढ़कर  देखिये. यदि बन गया है तो मिश्रण उससे चिपकता नहीं है.\n\n•क्रुकर से सेपरेटर  क्रो निकाल लें और 2 या 3 मिनिट बाद  होने एर चाकू को सहायता से उसे प्लेट में निकाल लें.आपका बाटे अप्पम तैयार हे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.su12);
                       txt = ("•चावल का आटा  - 200 गाम(1 कप )\n•सूजी - 100 गाम (आधा कप)\n• पके हुये केले - 2-3\n•गुड या चीनी - 75 गाम (1/3 कप))\n•नारियल - आधा  कप (कदूकस क्रिया हुआ )\n•छोटीं इलाइची - 4-5 (छील कर क्रूट लीजिये )\n•ईनो साल्ट या खाना सोडा … 1 /4 छोटी चम्मच\n•तेल - थोडा सा, सेकने  के लिये");
                        txt2 = ("•चावल क्रो 1 घंटा के लिये भिगो दीजिये, चावल से पानी  निकलिये, चाहें तो मोटे कपडे पर  फैला दीजिये ताकि वह चावल का पानी  सीख ले, चावल का बारीक आटा पीस लीजिये\n\n•चावल के आटे  और सूजी क्रो किसी बडे बर्तन में निकालिये. नारियल और चीनी पीस कर मिलाइये.\n\n•केले क्रो अच्छी तरह मैश कीजिये और मिश्रण में मिलाइये.इलायची और भी मिला दीजिये, आवश्यकताअनुसार  पानी  मिलाइये, घोल क्रो इडली के घोल जैसा गाडा रखना  हैं. घोल को अच्छी तरह हैंड ब्लेंडर से  फैटिये और  आधा  घंटे के लिये रख दीजिये.\n\n•मिश्रण में ईनो साल्ट मिलाइये. आप  ब्रेकिंग पाउडर भी मिला सकते हैं,लेकिन मेरा यह अनुभव है कि यदि आप  ब्रेकिंग पाउडर के बजाय ईनो साल्ट मिलते है  हैं तो मिश्रण अधिक फूलता हे.\n\n• अप्पा मेकर  क्रो गैस फ्लेम पर   रखिये और गरम कीजिये, प्रत्येक खाने में एक चौथाई छोटी चम्मच से भी कम तेल डालिये. (आप चाहें तो बिना तेल के भी बना सकते हैं) चमचे से मिश्रण लीजिये और प्रत्येक खाने क्रो आधा भर दीजिये, गैस धीमी ही रखिये, थोड़ी  ही देर में ये अप्पम फूल कर खाने क्रो पूरा भर देंगे, नीचे की  तरह से ब्राउन होने प्रर यूनी अप्पम क्रो पलटिये  और  दूसरी तरफ ब्राउन होने तक सेकिये .\n\n• सिके हुये उन्नीअप्पम क्रो निकाल कर प्लेट में रखिये और दूसरे उन्नीअप्पम  इसी प्रकार सेकिये , सारे उन्नीअप्पम तरह तैयार कर लीजिये.\n\n•गरमा गरम उन्नीअप्पम  तैयार है प्ररोसिये और खाइये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.su13);
                       txt = ("•राई (काली सरसों) - 2 टेबल स्पून \n• पीली  सरसों - 2 टेबल स्पून \n• कच्चे जाम - 2 या 300 गाम (मीडियम आकार  के)\n•अदरक - 2 इंच लंबा टुकडा\n•-हरी मिर्च - 4-5\n•लाल मिर्च - 1 /2 छोटी चम्मच\n•जीरा - 1 छोटी चम्मच\n• धनिया पाउडर - 2 छोटी चम्मच\n•चीनी - 1 छोटी चम्मच\n•सरसों का तेल - आधा  कप\n• हींग - 1 /4 छोटी चम्मच से कम\n•हल्दी पाउडर - 1 छोटी चम्मच\n• सिरका - एक चौथाई कप\n• नमक - 2 छोटी चम्मच (स्वादानुसार)");
                        txt2 = ("•आम  को धोकर छीलिये और गूदा  निकल कर काट लीजिये, राई और पीली सरसों को अच्छी  तरह से साफ कर लीजिये, हरी मिर्च के डंठल हटा कर मिर्चों को धो लीजिये और अदरक को छील कर धोकर उसके टुकडे कर लीजिये।\n\n•मिक्सर में राई, पीली सरसों,  आम का गुदा , हरी मिर्च,अदरक के टुकडे, जीरा, धनिया पाउडर, हींग, हल्दी पाउडर च चीनी डालकर बारीक पीस लीजिये और यदि ये मसाले पीसते समय पानी की आवश्यकता  लग रही हो तो 1 -2 टेबल  स्पून मिलकर सभी मसालों को अच्छी तरह पीस लीजिये ।\n\n•अब कढाई में तेल गर्म कीजिये और उसमें पिसे हुए मसाले डालकर धीमी गैस एर 3-4 मिनट तक अच्छी तरह भूनिये ।जब मसालों से भूनने को महक जाने लगे तो गैस छंद कर दीजिये और मसालों के इस मिश्रण में सिरका व नमक मिलाकर इसे किसी कांच के कटेनर में भर कर धूप में रख।\n\n• 3-4 दिन बाद जब जाए देखें कि कसूदी के ऊमर तेल तैरने लगा हैं तो समझ  लीजिये कि कसूदी खाने के लिये तैयार हैं ।\n\n• अब इसे आप  गरमा गरम पालक या गोभी आलू के पकोड़ो  के साथ परोस कर खाइये और बची हुई कसूदी क्रो फ्रिज में रखकर 6 महिने तक कभी भी खाइये ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                }
                break;
            }


            case "Soup Receipes": {
                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sp1);
                       txt = ("•मशरूम - 1 पेक (200 गाम\n• मक्खन - 2 टेबल स्पून \n•हरा धनिया - 1-2 टेबल स्पून \n•क्रीम  - 2 टेबल स्पून \n• नीबू – 1\n•कार्न फ्लोर - 2 टेबल स्पून \n•नमक - 1 छोटी चम्मच (स्वादानुसार)\n•काली मिर्च ताजा कुटी … 1 /4 छोटी चम्मच\n•अदरक पेस्ट - 1 /2 छोटी चम्मच");
                        txt2 = ("•सबसे  पहले  मशरूम क्रो कपडे से पोंछ लीजिये और डंठल एक  तरफ से थोडा काटकर  छोटा छोटा काट लीजिये. पैन  में 1 या 2 टेबल म्पून मक्खन डालकर मेल्ट होने तक गरम कर लीजिये. मक्खन में अदरक डालिये और हल्का सा भून लीजिये मशरूम, नमक, काली मिर्च डाल कर ,सारी चीजो के मिलने तक मिला दीजिये, और इन्हें ढक कर धीमी गैस एर 3-4 मिनिट तक पकने दीजिये, और चैक कीजिये. मशरूम के अन्दर से काफी जूस निकल जाने के बाद. 2 मिनिट खुले ही पका  लीजिये, ताकि मशरूम नर्म हो जाय\n\n• थोडे से  मशरूम 1 /4 भाग मशरूम कढाई में साबुत  टुकडे और 3/4 भाग मशरूम के टुकडे मिक्सर जार में डालिये और हल्के दरदरे पीस लीजिये. पिसे मशरूम उसी कढाई में डाल दीजिये जिसमें साबूत टुकडे हैं. 2 कप पानी  डाल दीजिये, उबाल आने  के बाद, कार्न फ्लोर क्रो 2-3 टेबल रसून स्पून  में गुठलियां खत्म  होने तक घोलिये और सूप में मिला दीजिये, सूप क्रो 2-3 मिनिट उबलने दीजिये , 1 टेबल स्पून क्रीम  डाल दीजिये, गैस बन्द कर दीजिये और 2 छोटे चम्मच नीबू का रस डालकर मिला दीजिये.\n\n•बहुत ही अच्छा  मशरूम का सूप बनकर तैयार प्याले में डालिये, क्रीम  और हरे धनिये से गार्निस गरमा गरम सूप पीजिंये. \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sp2);
                       txt = ("•टमाटर - 2 (मीडियम आकार  का )\n• गाजर - 1 (मीडियम का  का)\n•शिंमला मिर्च - 1 (मीडियम आकार का\n•हरे मटर - आधा  कटोरी (छिल हुये दाने \n•नूडल - 50-60 गाम\n• मक्खन - 2 बडे चम्मच\n•हरी मिर्च - 2 ( बारीक काट  लीजिये)\n• अदरक - 1 इंच लम्बा टुकडा (कदूकस कर लीजिये)\n•नमक - स्वादानुसार\n•काली मिर्च - साधा छोटी चम्मच\n•गोद मिर्च - आधा  छोटी चम्मच\n• आधा  नीबू का रस\n•हरा धनियां - 1 टेबिल ट्यून (बारीक कटा  हुआ )");
                        txt2 = ("•टमाटर और गाजर धोकर बारीक काट लिजिये. शिमलामिर्च धोकर, बीज निकाल  कर बारीक काट लीजिये.\n\n• किसी मोटे बर्तन में मक्खन डालकर गरम करें. मक्खन में हरी मिर्च और अदरक डाल दीजिये. चम्मच  चला कर 1 मिनिट तक भूनिये. मटर डालकर 2 मिनिट तक भूनिये, अब टमाटर, गाजर और शिमला मिर्च डाल कर 3-4 मिनिट तक भूनिये.\n\n• सब्जियां भूनने के बाद 700 गाम पानी  डाल दीजिये. पानी  में उबाल आने  के बाद नूडल डालये, फिर से उबाल आने  के बाद 4-5 मिनिट तक धीमी गैस यर कभी कभी चलाते हुये पकाइये \n\n•नमक, गोद मिर्च और काली मिर्च डाल कर धीमी गैस पर  1-2 मिनिट तक पकने दीजिये. गैस बन्द कर दीजिये. नीबू का रस डाल दीजिये. आपका  वेजिटेबल नूडल सूप तैयार हैं.\n\n•गरभा गरम वेजिटेबल नूडल सूप, मक्खन और हरा धनियां डाल कर परोसिये .\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sp3);
                       txt = ("•चुकन्दर - 1 मीडियम आकार का ( छोटा छोटा काट लीजिये)\n•लाल पत्ता  गोभी - एक कटोरी कटा हुआ\n•गाजर - 1 मीडियम आकार को ( छोटी छोटी काट लीजिये)\n•लाल शिमला मिर्च - 1 मीडियम आकार को ( छोटी छोटी काट लीजिये)\n•वेबी कार्न - 4-5 लम्बे लम्बे टुकडे काट लीजिये\n•ब्रोकली - एक छोटी कटोरी कटा हुआ\n•कार्न फ्लोर - 1 बडा चम्मच\n•मक्खन - 2 टेबिल स्पून \n•अदरक- 1 इंच लम्बा टुकडा ( कदूकस क्रिया हुआ या 1छोटी चम्मच पेस्ट)\n•सफेद मिर्च- आधा  छोटी चम्मच\n• काली मिर्च- आधा  छोटी चम्मच\n• नमक - स्वादानुसार\n•चिल्ली सास - 1 बडा चम्मच\n• नीबू - छोटे नीबू का रस");
                        txt2 = ("•सारी सब्जियां हमने धोकर, काटकर तैयार कर लीजिये.\n\n• कार्न फ्लोर लीजिये, आधा  छोटी कटोरी पानी में घोलिये,(घोल में गुठलियों नही बननी चाहिये) .\n\n• भारी तले के बर्तन में 1/2  टेबिल स्पून   मक्खन डालकर गरम कीजिये. अदरक का पेस्ट और अंदर डालिये,और 2 मिनिट तक मीडियम गैस पर  अब बची हुई सारी सब्जियां डाल दीजिये. सब्जियां क्रो 2-3 मिनिट तक चमचे से चलाते हुये भूनिये. अब सब्जियों क्रो ढककर 2 मिनिट तक धीमी गैस एर पकने दीजिये. इन सब्जियों में 700 गाम पानी , कार्न प्लोर का घोल, काली मिर्च, नमक और बिनी सास डाल दीजिये.\n\n•सूप क्रो उबाल आने  तक चमचे से लगातार चलाते रहिये.\n\n•उबाल जाने के बाद धीमी गैस एर 3-4 मिनिट तक पकने दीजिये. लाल वेजिटेबल सूप बन गया हैं. गैस बन्द करदीजिये. सूप में नीबू का रस मिला दीजिये.\n\n•सुप क्रो बाउल में निकालिये. मक्खन और हरे धनिये से सजा कर परोसिये\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sp4);
                       txt = ("•ब्रोकली - 300 ग्राम (एक ब्रोकली का फूल)\n• टमाटर - 150 ग्राम ( 3 टमाटर मध्यम आकार के)\n•आलू- 350 ग्राम (2 लालू)\n• अदरक - 1 इंच लम्बा टुकडा\n•काली मिर्च - 7-8\n• लोंग – 4\n•दाल चीनी - एक टुकडा\n• नमक - स्वादानुसार (छोटी  एक चम्मच)\n•मक्खन  - 1/2 टेबल स्पून  \n•हरा धनियां - आधा  टेबल स्पून   (बारीक कटा हुआ )");
                        txt2 = ("•ब्रोकली के टुकडे करके अच्छी  तरह पानी से धो लीजिये.\n\n• किसी बर्तन में इतना पानी भर कर गरम करने रखिये कि उसमें ब्रोकली के टुकडे डूब जांय. पानी में उबाल आने  के बाद ब्रोकली के डंठल के टुकडे पानी में डाल कर ढक दीजिये, 2 मिनिट बाद आग  बन्द कर दीजिये. ब्रोकली के टुकडों क्रो 5 मिनिट के लिये ढके रहने दीजिये.\n\n•टमाटर धोकर, बडे टुकडों में काट लीजिये. आलू छील ' कर पतले टुकडे कर लीजिये. ब्रोकली के डंठल छील कर टुकडे कर लीजिये. अदरक छील कर छोटे टुकडे कर लीजिये.\n\n•दूसरे बर्तन में एक टेबल स्पून मक्खन डाल कर गरम कीजिये. काली मिर्च, लोंग और दाल चीनी मक्खन में डालकर हल्का  सा भूनिये. टमाटर और ब्रोकली के डंठल के टुकडे डालकर मिलाइये और थोडा पानी ढककर, पकने रख दीजिये. 6-7 मिनिट के बाद दक्कन  खोल कर देखिये आलू  नरम हो गये हैं, अगर नहीं तो 2-3 मिनिट के लिये ढककर और पका  लीजिये. आग  बन्द कर  दीजिये.\n\n•ठंडा होने पर  ये नरम आलू  टमाटर मसाला और आधे  किये  गये ब्रोकली के टुकडे मिक्सी से बारीक पीस लीजिये.\n\n•पिसा हुआ  मसाला ब्रोकली बर्तन में डालिये, चार कप पानी  और स्वादानुसार नमक मिलाइये. सूप में उबाल आने  के बाद 3-4 मिनिट तक उबालिये. आग  बन्द कर दीजिये.\n\n• ब्रोकली  सूप तैयार हे. सूप मे कटा हुआ  धनियां डाल कर मिलाइये. गरमा गरम ब्रोकली सूप क्रो सूप प्याले में डालिये और थोडा मक्खन डाल कर परोसिये और पीजिंये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sp5);
                       txt = ("•पालक - 500 गाम (एक छोटा बन्च)\n•टमाटर - 3- 4 (मध्यम आकार के)\n• अदरक -1 इंच लम्बा टुकडा\n•सादा नमक - 3/4 छोटी चम्मच\n• काला नमक - आधा  छोटी चम्मच\n•काली मिर्च - एक चथाई छोटी चम्मच से कम\n• नीबू - 1\n•मक्खन   -1-2 टेबल स्पून\n• क्रीम - 2 टेबल स्पून\n•हरा धनियां - 1 टेबल स्पून बारीक कटा  हुआ");
                        txt2 = ("•पालक  की   डंडिया  हटा  कर साफ कर लीजिये, पालक के पत्तों  को 2 बारी पानी  में डुबो कर अच्छी  तरह धो लीजिये. टमाटर भी धोकर  , अदरक छील कर धो लीजिये.\n\n•पालक, टमाटर और अदरक मोटा मोटा काटकर 2-3 बडे चम्मच पानी  डालकर उबालने रख दीजिये. पालक नरम होने एर आंच  बन्द कर दीजिये.\n\n•पालक टमाटर को ठंडा होने के बाद, मिक्सर से बारीक पीस लीजिये.\n\n•पीसे हुये मिश्रण में 1 लीटर (5-6 कप पानी  ) मिलाइये और छान लीजिये, छाने गये सूप को फिर से आंच पर रखिये, सादा नमक, काला नमक और काली मिर्च डालिये फिर  से उबाल आने  के बाद 2-3 मिनिट और पका ले \n\n•पालक का सूप बन गया हैं, आग  बन्द कर दीजिये, सूप में डालिये और मिलाइये, नीब्रू का  रस डाल कर मिला ले \n\n•गरमा गरम पालक का सूप प्याले में निकल लीजिये और सूप के ऊपर क्रीम और हरा धनियां डाल कर सजाइये.गरमा गरम पालक के  सूप को सूप स्टिक या कुरकुरी ब्रेड के साथ  परीसिये \n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sp6);
                       txt = ("•गाजर - 1 मीडियम आकार की (छोटी छोटी कतर लीजिये)\n•फूल गोभी - एक चौथाई गोभी (एक कटोरी कटा हुआ  )\n•हरे मटर के दाने - आधा  कटोरी\n•शिंमला मिर्च - 1 मीडियम  आकार की (बीज निकल कर ,बारीक काट  लीजिये)\n•अदरक - 1 इंच लम्बा टुकडा (बारीक कदू कस कर लीजिये या 1 छोटी चम्मच पेस्ट)\n• कार्न फ्लोर - 1 बडा चम्मच\n•मक्खन - 2 बडे चम्मच\n•काली मिर्च - आधी  छोटी चम्मच\n• गोद मिर्च - साधा छोटा चम्मच\n•चिल्सी सास - 1 बडा चम्मच\n• नमक - स्वादानुसार\n• नीबू - आधा  \n•हरा धनिया - 1 बडा चम्मच (कटा हुआ)");
                        txt2 = ("•सब्जिया सभी धोकर, पहले से काट ली गयीं हैं.\n\n• कार्न फ्लोर क्रो, 2 बडे चम्मच पानी  में घोल लीजिये (गुठलियों न पडे) .\n\n•एक भारी तले के बर्तन में, मक्खन डाल कर गरम कीजिये. अदरक का पेस्ट, सारी कटी  हुई सब्जियां डाल दीजिये. सब्जियों क्रो मक्खन में चला कर 2 मिनिट तक धीमी गैस एर भूनिये. अब सब्जियों ढक कर 2 मिनिट तक धीमी गैस पर  पकने दें.\n\n•सब्जी  में 600 गाम पानी , कार्न फ्लोर का घोल, काली मिर्च, गोल   मिर्च,  सास, और नमक डालिये. सूप क्रो उबाल तक  लगातार चलाते रहें.उबाल आने  के बाद 3-4 मिनिट तक धीमी गैस एर पकायें. गैस बन्द कर दीजिये. सूप में नीबू का रस और हरा धनियां और थोडा मरन्द्रन डाल कर मिला दीजिये.\n\n•  मिक्स वेजिटेबल सूप  तैयार हैं. गरमा गरम परीसिये और पीजिये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sp7);
                       txt = ("•पोदीना  के पत्ते - आधा  कप\n•धनिये के पत्ते - आधा  कप\n•नीब्रू- 2 मीडियम आकार  के\n•रायते वाली  बूंदी … आधा  कप\n•अदरक - 1 /2 …1 इंच टुकड़ा\n•हींग - 1 \n•काली मिर्च - 3/4 छोटी चम्मच\n• जीरा - 2 छोटी चम्मच\n• काला नमक - 1 छोटी चम्मच\n•साधा नमक - साधा छोटी चम्मच या स्वादानुसार");
                        txt2 = ("•पोदीना  और धनियां क्रो अच्छी  तरह साफ करके और  धोकर, पानी  सुखाकर ले लीजिये. अदरक छील कर धो लीजिये.मसालों क्रो बारीक पीस कर तैयार कर लीजिये. हरा धनियां और आटा  जार में डाल दीजिये,\n\n•अदरक को छोटा छोटा काट कर डाल दीजिये, काली मिर्च, भूना जीरा, चीनी, हींग,  काला नमक और सादा नमक डाल दीजिये, थोडा सा पानी  डाल कर मसालों क्रो एक दम बारीक पीस लीजिये.\n\n• पिसे मसाले जार में डाल दीजिये, और 4 कप ठंडा पानी डाल दीजिये, अच्छी तरह मिक्स कर लीजिये, नीब्रू का  रस निकाल कर मिला दीजिये, ताजा जल जीरा बनकर तैयार हैं.गिलास में जलजीरा डालिये और 1 -2 छोटी चम्मच बूंदी  डाल दीजिये, ताजा और ठंडा जल जीरा पीजिये और ताजगी महसूस कीजिये\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sp8);
                       txt = ("•स्वीट कॉर्न  3 कप\n•पानी 4 कप \n•बटर 1 बडा चम्मच\n• काली मिर्च पाउडर 1 छोटा चम्मच\n•नमक स्वादानुसार");
                        txt2 = ("•एक कुकर में बटर गरम करे , उसमें मकई के दाने डाल  कर कुछ देर भूने, फिर पानी और नमक मिला के सिटी  लगा दे,एक सिटी आने के बाद  5 मिनट धीमी आंच पर  5 मिनट और पका ले  ठंडा होने दीजिये.\n\n• ठंडा होने के बाद दो बडे चम्मच दाने अलग  निकाल  के रख लीजिये, बाकी दानों क्रो मिक्सर में बारीक पीस लीजिये,पिसे हुए  दानों क्रो फिर से कुकर में डाल के गैस एर रख एक उबाल आने  तक पका ले ., अगर पानी कम लगे तो और मिला सकते है काली मिर्च पाउडर और बचे हुए दानों क्रो मिला कर गर्मागर्म परोसिये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sp9);
                       txt = ("•1/2 कप धुली मूंग दाल \n• कप बडे टुकडो में कटा हुआ प्याज \n•कप बडे टुकडो में कटा हुआ \n•बड़े चम्मच गोभी बारीक कटी  हुई \n•बड़े चम्मच गाज़र बारीक कटी  हुई \n• स्वादानुसार नमक \n• 1 चम्मच बटर या आयल  \n• स्वादानुसार काली मिर्च का पाउडर\n•2 चम्मच नीबू का रस");
                        txt2 = ("•दाल क्रो धोकर अलग रख ले.\n\n• अब एक कुकर में तेल या बटर डाल के गरम करे , प्याज डाल के कुछ देर भूने आलू  मित्ना के कुछ देर और भूने,दाल, नमक और 4 कप पानी डाल के कुकर बंद करके 4-5 सिटी  आने  तक पका  ले.\n\n•क्रुकर ठंडा होने दे, कुकर खोल के गाज़र और गोभी डाल के गलने तक उठाए \n\n•गैस बंद करके नीबू का रस और काली मिर्च का पाउडर डाल के गरम गरम परोसे.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sp10);
                       txt = ("•गोभी कदूकस को हुई 2 कप \n• बारीक कटा पालक 1 कप \n•बारीक कटा अदरक 1 छोटा चम्मच \n•कटीं हरी मिर्च 1 छोटा चम्मच  \n• दालचीनी 1 इंच का टुकडा \n•लौग 2 \n•कालीमिर्च 4-5 \n•मक्खन 1 बडा चम्मच \n• कॉर्न फ्लोर 1 चम्मच, 1/2 व्य, \n•नमक स्वादानुसार");
                        txt2 = ("•एक बरतन  में मक्खन पिघलाएं, दाल चीनी, लौग, काली मिर्च डाल दे \n\n•अदरक, हरी मिर्च, पालक, गोभी डालकर धीमी आंच पर भूनें  \n\n• 5 मिम्ट बाद 3 कप पानी  और नमक डालें, धीमी आंच पर  पकने में\n\n•जब गोभी अच्छी  तरह गल जाए\n\n•दूध भी मिला दें, 2 मिनट और पकाये  हँ कांच से उतार के काली मिर्च पाउडर और स्वादानुसार बना ले \n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sp11);
                       txt = ("•1 /2 कप धुली मसूर को (धुली और भीगी हुई) \n• बारीक कटा हुआ पालक \n• 2-3 लहसुन को कली \n• चम्मच मक्खन \n• 1 /2 कप कटा हुआ प्याज \n• 1  से टमाटर कटा हुआ\\n• 1 /2 कप दूध\n• 1 /2 छोटा चम्मच कालीमिर्च का पाउडर \n• स्वादानुसार नमक \n• 1 चम्मच मक्खन\n• ब्रेड स्टिक");
                        txt2 = ("• मक्खन डाल के गरम को फिर उसमे लहसुनऔर प्याज डाल के कुछ स्नेक्रंडस तक भूने फिर क्या जा टमाटर और धुली है दाल डाल दे, दो कप यानी डालदुकुकर को छंद 2 सीटी जाने तक एका ले.\n\n•क्रुकर ठंडा होने के बाद पके हुए मिश्रण को मिक्सर मेंडाल के पीस ले.\n\n• मिश्रण को एक गहरे बर्तन में निकल के गैस एर चढाये,उसमे दूध, कटा हुआ पालक, नमक, और काली मिर्च डाके मिलाये.\n\n• एक कप पानी  डाल के अच्छे से उबाल जाने तक पकाए.\n\n• गैस छंद करके गरमगरम सूप मक्खन डाल के ब्रेड के साथ परोसे. \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sp12);
                       txt = ("•1 /4 कप पत्तागोभी बारीक कटी  हुई\n• 1 /4 कप गाजर बारीक कटी  हुई\n•1 /4 कप बीन्स  बारीक कटी  हुई\n• 1 /4 कप शिमला मिर्च बारीक कटी हुई\n• 4-5 मशरूम बारीक कटी हुए\n• 4-5 हरे प्याज बारीक कटे  हुए\n•2 छोटे चम्मच कदूकस करा हुआ लहसुन\n• 2 छोटे चम्मच कदूकस करा हुआ अदरक\n• 1  बडा चम्मच हरा धनिया\n•2 हरी मिर्च बारीक कटी   हुई\n• 2 चम्मच सोया सॉस \n• 2 बडे चम्मच कॉर्न फ्लोर 1 कप पानी  में घुला हुआ\n• 2 बडे चम्मच तेल या बटर\n• 1 चम्मच कुटी हुई काली मिर्च\n•4कप पानी\n•स्वादअनुसार  नमक\n•ऊप्पर  सजाने के लिए\n• 1 कप तले हुए नुडल्स");
                        txt2 = ("•एक कढाई में तेल या बटर डाल के गरम को फिर उसमे अदरक , हरी मिर्च और लहसुन डाल के तेज आंच एर कुछ कटीं हुई पत्ता गोभी, बीन्स, मशरूम, गाजर, शिमला मिर्च और  हरे प्याज डाल के दो तीन  मिनट तक भूने.\n\n•हरी धनिया डाल के 1 मिनट और भूने फिर 4 कप पानी  डाल के पकने दे.\n\n• नमक, काली मिर्च, पानी  में घुला हुआ कॉर्न फ्लोर और सोया सीस मिला के लगातार चलाते हुए गाढा होने तक पकाए.\n\n•गैस से उतार के ऊपर   से तले हुए नुडल्स डाल के तुरंत ही गरम गरम परोसे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.sp13);
                       txt = ("•छोटीं गाजर कदूकस की  हुई\n• 4-5 बडे चम्मच पत्तागोभी बारीक की हुई\n•4-5 बडे चम्मच फूलगोभी कदूकस की  हुई\n•बड़े चम्मच बीन्स बारीक की  हुई\n• 2-3 बडे चम्मच हरा प्याज बारीक कटा हुआ\n• 3-4 बडे चम्मच बारीक कटा हुआ शिमला मिर्च\n•बड़ा मशरूम पतले स्लऱइस में कटा हुआ\n•हरी मिर्च लम्बाई में कटी  हुई\n• 1 छोटा चम्मच अदरक कदूकस की  हुई\n•1 छोटा चम्मच लहसुन कदूकस किया  हुआ\n• 1 छोटा चम्मच सोया सॉस \n• 1 छोटा चम्मच चिली सॉस  (इच्छाअनुसार)\n•1 छोटा चम्मच सफेद  सिरका\n• 1 1/2 चम्मच क्रोर्न फ्लोर\n• स्वादानुसार नमक\n•पानी  या वेजिटेबल स्टॉक\n• 1 बडा चम्मच बटर या तेल");
                        txt2 = ("•एक कढाई में तेल या बटर डाल के गरम करे \n\n•अदरक,लहसुन और हरी मिर्च डाल के कुछ देर भूने.\n\n•गाज़र, बीन्स,पत्ता गोभी, फूल गोभी, डाल के कुछ देर भूने,मशरूम और हूँग़धा हरा प्याज डाल दे.\n\n• चार कप यानी या वेजिटेबल स्टॉक, नमक, काली मिर्च डाल के उबलने दे.\n\n• मिला के 1 -2 मिनट तक पकने दे.\n\n•सोस, बिनी सीस और विनेगर मिला के गैस छंद कर .टुचेसेहुए हरे प्याज से सजा के गर्मागर्म होति एंड सौर सूप परोसे .\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }



                }
                break;
            }


            case "Gujarati Food Receipes": {
                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.g1);
                       txt = ("•बेसन - 1 कप\n•सूजी - 1/4 कप\n• नीबू- 1 मीडियम आकार का\n• अदरक - आधा इंच टुकडा, कद्दूकस  क्रिया हुआ\n• चीनी - 2 छोटे चम्मच\n•नमक - 3/4 छोटी चम्मच\n•ईंनो फ्रूट  साल्ट - 1 छोटी चम्मच\n•ढोकला को तड़कने के लिए:\n• हरी मिर्च - 2 लम्बी कटी हुई\n• हरा धनियां - 2 टेबल म्पून बारीक कटा हुआ\n• तेल - एक टेबल स्पून \n• कच्चा  नारियल - 1 टेबल स्पून \n• राई - आधा छोटी चम्मच\n• कड़ी पत्ता - 5-6\n• तिल - 1 छोटी चम्मच ");
                        txt2 = ("•एक बर्तन में बेसन और सूजी लेकर पानी डाल कर घोल बनाए घोल को ना तो ज़यादा पतला बनाएं और ना ही ज़यादा गाढा. ध्यान रखें कि घोल में गांठें बनी रहे \n\n• अब इस घोल में अदरक, नमक, 1 चम्मच चीनी और 1 नींबू का रस मिलाकर अच्छे सै घोल दें और इसै 20 मिनट के लिए रख दें ताकि घोल फूल कर अच्छे से  तैयार हो जाए\n\n• अब 7-8 इंच का माईंक्रोवेव सैफ प्याला लेकर उसमें थोडा तेल लगकर उसे गर्म  कर लें. अब फूले हुए घोल में ईंनो फ्रूट  साल्ट डाल कर अच्छे से मिलाकर तैयार किए प्याले में डाल दें और खटखटा कर सैट कर लें. अब इसे  ढक कर 3 मिनट के लिए माईंक्रोवेव में अधिकतम तापमान पर रखें.\n\n• निश्चित समय के बाद ढोकला में यहीं डालकर चैक करे. अगर यहीं पर बटर  नहीं चिपकता तो इसका  मतलब आपका ढोकला तैयार है. और अगर बटर  यहीं पर चिपक जाए तो  1 मिनट के लिए और पका लें. इस तरह ढोकला अच्छे से  तैयार कर लें.\n\n•- तड़का लगाए\n\n•1 पेन में तेल गर्म करके राई डालकर तड़काएं और फिर कड़ी  पत्ता डाल कर तिल डाले और हल्का भून कर हरी मिर्च डाल कर पकाए.\n\n•2. हल्का पका कर तड़के में आधा कप पानी डालकर बची हुई 1 चम्मच चीनी डाल कर उबाल आने दे. जब चीनी पानी में घूल कर पक जाए तो ढोकले तैयार डै.\n\n• ढोकले के चारों तरफ़ चाक़ू घूमा कर  कर इसे प्याले सै अलग कर लें और फिर किसी प्लेट पर उलटा करके ढोकले को  प्याले से निकाल ले. अब इसै अपने मनचाहे आकार में काटें .\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.g2);
                       txt = ("•एक कप गेहू  का आटा (चपाती का आटा )\n•1 / 3 टी  स्पून  हल्दी पाउडर, वैकल्पिक\n• 1/2 टी स्पून  लाल मिर्च पाउडर, वैकल्पिक\n•1 /2  टी स्पून  धनिया पाउडर, वैकल्पिक\n• 1 /4  टी स्पून  काली मिर्च पाउडर, वैकल्पिक\n• 2  टी स्पून  तेल । तलने के लिए\n•नमक\n•पानी");
                        txt2 = ("•एक परात में गेहूं का आटा, हल्दी पाउडर, लाल मिर्च पाउडर, धनिया पाउडर, काली मिर्च पाउडर, नमक और 1  टी स्पून  तेल डालें । अच्छी तरह से सभी सामग्री को मिला लें ।\n\n• जरूरत के अनुसार  धीरे-धीरे पानी डाले और पराठे के आटे के जैसा , सख्त आटा  गूंथ लें । उसे ढककर 10 मिनट के लिए रोट होने दें ।\n\n•- 8-10 मिनट के बाद, आटा  के ऊपर 1 टीं स्पून तेल डाले और फिर से गूंथ लें । आटे  मैं 6 बराबर भागों में बाँट ले  । प्रत्येक भाग को  गेंद क्री तरह गोल आकार दे और हथेलियों के बीच दबाकर लोई बना लें ।\n\n•एक लोई लो और उसे एक बूंद तेल से बना कर लें । इससे पूरी बेलने में आसानी होगी । उर्स प्याले के ऊपर रखे और बेलन से लगभग 3-4 इंच व्यास के गोल आकार में बेल लें । इसै बहुत ज्यादा पतला या मोटा न करे  अन्यथा यह समय देगी नहीं ।\n\n• बाकी बची लोईंया में  भी पूरी बैल लें ।\n\n•एक चौडे  वाली कड़ाही में तेल गर्म करें। जब तेल मध्यम गर्म तब उसमें बेली हुई पूरी डाले । पूरी तुरंत  ही सतह पर आ  जाएगी। पूरी को चमचे या करछी से हल्के से दबाये । तेल पर्याप्त गर्म होने नहीं देने  के लिए थोडा सा आटा तोड़ के तेल में डालिये और अगर आटा तुरन्त ही सतह पर आ  जाता है।\n\n•जब पूरी गेंद की तरह  आती  है और नीचे क्री सतह हल्के भूरे रंग क्री हो जाती है तब पलटे और दूसरी तरफ भी हल्के सुनहरे भूरे रंग क्री होने तक तले ।इस तलने क्री प्रक्रिया में अधिक स्ने अधिक 30 सै 60 ही लगते है।\n\n• उर्स एक प्लेट में निकाले । कड़ाही के आकार के अनुसार आप  एक साथ 2-3 पूरी भी तल सकते हैं ।बाकी की पूरी भी इसी  तरह तल लें । गरमा गरम पूरी तैयार कर रहे हैं उन्हें आलू क्री सबजी के साथ परोसें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.g3);
                       txt = ("•25 लहसुन क्री कलियाँ\n• 3 टीस्पून  लाल मिर्च पाउडर\n• 1/2 टी स्पून जीरा \n• 2 टी स्पून धनिया पाउडर\n•1 /2 टीस्पून नमक (या स्वाद अनुसार)");
                        txt2 = ("•लहसुन क्री कलियाँ, जीरा, धनिया पाउडर, लालमिर्च पाउडर और नमक मिक्सी को  छोटी जार में डालें । उन्हें हल्का दरदरा पीस ले ।\n\n• उसे एक परोसने के कटोरे में निकाले और गुजराती भाकरी या बाजरी रोटला और सैव टमाटर क्री सब्जी  के साथ रात के खाने में परोसें । आए  इसै एक सप्ताह के लिए फ्रिज में एक छोटे कंटेनर में रख सकते हैं ।\n\n•सुझाव और विविधता:\n\n• भेल पुरी, सैव री या किसी भी चाट के लिए लहसुन क्री चटनी बनाने लिए 3 टेबल स्पून  पानी और 1टी स्पून  नींबू का रस डालें ।\n\n• पारंपरिक तरीके से  लहसुन क्री चटनी बनाने के लिए मिक्सी के ब खरल का उद्योग करें।इससे बनी चटनी का स्वाद और भी स्वादिष्ट होता है ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.g4);
                       txt = ("•लौकी - 2 कप (कदूकस क्री हुई)\n• गेहू का आटा -  25 गाम (1 कप )\n• सूजी  - 100 गाम (3/4 कप)\n•बेसन - 100 गाम (3/4 कप)\n•हरी मिर्च - 2 पतली कटी हुई\n•अदरक - 2 इंच लम्बा टुकडे का पेस्ट\n•हल्दी पाउडर - 1 /4 छोटी चम्मच\n•तेल - 1 टेबल म्पून\n•नमक - स्वादानुसार (3/4 छोटी चम्मच)\n•चीनी - 2 छोटी चम्मच\n•खाने का सोडा - आधा छोटी चम्मच\n• हरा धनियां - 2 टेबल म्पून (बारीक कतरा हुआ)\n•तड़के के लिए:\n• तेल - 2 टेबल म्पून\n• जीरा - 1 छोटी चम्मच\n• राई - 1 छोटी चम्मच\n•तिल - 1 टेबल म्पून\n•करीषत्ता- 0-2\n•हींग - 2-3 पिंच\n• नमक - एक चौथाई छोटी चम्मच\n• नीबू - 1\n•हरा धनियां - 1 टेबल म्पून(बारीक कतरा हुआ)");
                        txt2 = ("•कदूकस क्री हुई लौकी सै सारा पानी निचोड़ कर अलग बर्तन में निकाल लें. आटा  बनाते समय ज़रूरत पड़ने पर इसी पानी का इस्तेमाल करें.\n\n• किसी बर्तन में आटा,बेसन और सूजी छान लें. अब इसमें कदूकस क्री लौकी, अदरक का पेस्ट, कटी हरी मिर्च और बाकी सारी दी हुई सामग्री डाल कर मिला लें और आटे को अच्छे सै गूंथ लें. पानी क्री ज़रूरत लगे तो लौकी वाले पानी को  डाल लें. अब आटे को 15-20 मिनट के लिए ढक कर रख दें.\n\n हाथों पर थोडा-थोडा तेल लगाकर आटे  सै छोटीं-छोटीं बेलनाकार  बना लें. इन्हें पकाने के लिए मोमोज़ के बर्तन या इडली स्टैंड का इस्तेमाल करें और किसी पानी वाले बर्तन में  भाप में 25-30 मिनट तक पका लें.\n\n•चाकू डालकर देखें. गैस बंद करके मुठिया ठंडी कर  तड़का लगाने के लिए आधा इंच मोटे टुकडों काट .\n\n•कढाई में तेल गर्म करके जीरा, राई, कड़ी पत्ता, हींग और तिल डालकर तड़का लें. नींबू का रस, नमक और हरा धनिया डाल कर दें और 5- 6 मिनट तक चलाते हुए भूने.तैयार है लौकी को  गर्म -गर्म मुठिया हरे धनिया या पुदीने की चटनी के साथ परोसे \n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.g5);
                       txt = ("•बाजरे का आटा - 1 कप\n• गेहूं का आटा - 1 कप\n• लौकी - 1 कप कदूकस क्री हुई\n•दही - 1 / 2 कप \n• हरा धनियां - 2 टेबल स्पून  बारीक कटा हुआ\n• हरी मिर्च - 1 -2 बारीक कटी हुई\n• अदरक का पेस्ट - 1 छोटी चम्मच\n•हींग - 1 पिंच\\n•लाल मिर्च पाउडर - 1 /4 छोटी चम्मच\n• धनिया  पाउडर - 1 /4 छोटी चम्मच\n• तिल - 1 छोटी चम्मच \n•नमक - आधा छोटी चम्मच से  थोडा ज्यादा ");
                        txt2 = ("•एक बडे बर्तन में बाजरे का आटा और गेहूं का आटा डाल कर मिला लें. अब इसमें कद्दूकस  क्री हुई लौकी नमक, हरी मिर्च, अदरक, लाल , 1 टेबल स्पून  तेल, तिल, हींग, हल्दी पाउडर, हरा धनिया और दही डाल कर मिला लें.\n\n•इसमें ज़रूरत अनुसार 1 -2 चम्मच पानी डाल कर नरम आटा गूंथ ले.अब इसै 10-15 मिनट के लिए ढककर रख दें ताकि ये फूल कर सैट हो जाए\n\n• तवे को गरम करें. हाथों पर तेल लगा कर आटे को मसल  लें. अब इस आटे सै लोईंयां बना लें.\n\n• एक लोई को गेहूं के आटे  में लपेटकर, प्याले पर 6-7 इंच के व्यास में बेल लें. इसे हल्का दबाते हुए बेलें.\n\n•बेल कर गरम किए तवे पर डालें. जब ा रंग थोडा उपर से डार्क हो जाए तो इसे पलट दें.अब इस पर 1 छोटी  चम्मच तेल लगा कर के  दें और फिर से  पलट दें.\n\n• अब दूसरी तरफ भी तेल लगा कर पलट लें. थेपलै को दोनों तरफ ब्राउन चित्ती आने  तक पलट-पलट कर सेक  लें. जब थेपला सिक कर तैयार हो जाए तो इसे प्लेट पर रखी प्याली पर उत्तार कर रख लें.\n\n•बाजरा लौकी थेपला तैयार डै. इसै अपनी मनपसंद सकती, चटनी, आचार या दही के साथ खाए\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.g6);
                       txt = ("•मैदा - 1 कप\n•तेल - 2 टेबल स्पून (मैदा में डालने के लिये )\n•नमक - 1 /4 छोटी चम्मच\n•कलोंजी - 1 /4 छोटी चम्मच\n•चाट मसाला … 1 /4 छोटी चम्मच\n•तेल - निमक्री तलने के लिये \n•मैदा … 1 टेबल स्पून \n•देशी घी - 1 टेबल स्पून ");
                        txt2 = ("•मैदे को एक बर्तन में निकल कर उसमें तेल, नमक और कलोंजी डाल कर मिला लें. अब इसमें थोडा… थोडा पानी डालते हुए पूरी के आटे  से भी सख्त गूथ ले\n\n• आटे  को गूंथ  कर 15-20 मिनट के लिए ढक कर रख दें ताकि ये फूल कर सैट हो जाए\n\n• अब 1 टेबल स्पून  मैदा और घी क्रो मिला लें.\n\n• जब आटा  फूल कर सैट हो जाए तो इसे मसल… मसल कर गोल लोई बना लें. अब इस लोई क्रो 10-12 इंच के व्यास में परांठे को तरह पतला खेल लें.\n\n• तैयार किए आटा  को बेली हुई शीट एर डाल कर सब तरफ फ्रेला दें. इस पर  उपर से चाट मसाला भी छिड़क दें.\n\n• तैयार शीट क्रो रोल करके इसमें से 3-4 सेंमी. को चौडाई में गोले काट लें. इन सारे गोलों क्रो अलग- अलग करके इनसे गोल लोईंयां बना कर तैयार कर लें.\n\n• कढाई में तेल डालकर इसे मीडियम गरम करें. इसमें जितनी निमक्री आसनी से एक बार में तली जा सके डाल कर तल लें.\n\n• हल्की और मीडियम आच एर निमक्री क्रो गोल्डन ब्राउन होने तक तल लें. लगभग 10-12 मिनट में ये तल कर तैयार हो जाती  हैं. सारी निमक्री  तल कर नैपकिन पेपर से  प्लेट में निकाल लें.\n\n• खस्ता निमक्री तैयार हैं. इन्हें ठंडा कर लें और एअर टाइट कंटेनर में भर कर रख लें. निमक्री क्रो 2 महीने तक आराम से खाएं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.g7);
                       txt = ("•लसोड़े … 1/2 किग्रा.\n•हल्दी पाउडर - एक छोटी चम्मच\n•राई या पीली सरसों - 2 टेबल स्पून  (दरदरी पिसी हुई)\n•नमक - 1 /2 छोटी चम्मच (स्वादानुसार)\n•लाल मिर्च पाउडर … 1 /4 छोटी चम्मच\n•सरसों का तेल - 2 टेबल स्पून \n•हींग - 1 पिंच ");
                        txt2 = ("•लसूड़े के डंठल को तोड़ कर अच्छे से धो लें. एक बर्तन में पानी उबालें.पानी इतना हो की जिसमें सारे लसोड़े  आसानी से डूब जाए\n\n•जब पानी  में उबाल जा जाए तो इसमें लसॉड़े क्रो डाल दें.फिर से उबाल जाने के बाद भी इन्हें 3-4 मिनट तक उबालते रहें. फिर गैस बंद करके   इन्हें पानी  में रखे रखे ही ढक दें.जब ये ठंडे हो जाएं तो इनसे पानी  निकल दें.\n\n• अब सबसे पहले  लसोड़े क्रो पानी  में डालकर . जिसके लिए 1 लीटर पानी  क्रो उबालने के लिए रख दें और उबलने के बाद इसे ठंडा कर लें. उबाल हुए लसोड़े क्रो  प्लास्टिक के किसी कंटेनर में भर लें.\n\n•इनमें 1 छोटी चम्मच हल्दी पाउडर, 2 छोटी चम्मच नमक,1/4 चम्मच लाल मिर्च, पीली सरसों और सरसों का तेल डाल कर अच्छे से मिला दें.\n\n• अब इन मसाले में मिले लसोडों में उबला ठंडा पानी  भी मिला दें. चम्मच से चला कर कंटेनर का ढबक्तन बंद कर दें.\n\n• 3-4 दिन में लसोड़े को स्वादिष्ट पानी  बन कर तैयार हो जाएगी. इसे दिन में एक बार चम्मच से ज़रूर चला दें.आचार  बनाते समय साफ़ बर्तन ही इस्तेमाल करें.\n\n•लसोड़े  काजी क्रो चाहें  चपाती और परांठे के साथ खा भी सकते हैं. 15 दिन में काजी  लसोड़ पीले और खट्टे हो जाएगे.\n\n• साथ ही लसोड़े  भी खत्म हो जाएगा. काजी लसोड़े निकाल कर अलग कर लें.\n\n•लसोडों को आप  खा भी सकते हैं. इससे ये आचार  साल भर खराब नहीं होगा. इसके लिए लसोडे क्रो साफ कंटेनर में भर लें.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.g8);
                       txt = ("•मैदा - 500 गाम \n• नमक - एक छोटी चम्मच\n•जीरा - एक छोटी चम्मच\n• अजवायन - एक छोटी चम्मच\n•काली मिर्च - 20 दरदरी कुटी हुई  -125 गाम (आधा कप से थोडा अधिक\n•तेल (रिफाइन्ड) - कसी पूरी तलने के लिये");
                        txt2 = ("•मैदे में नमक मिला कर इसे किसी बर्तन में छान लें. हाथ से मैदे के बीच में जगह बना कर इसमें अजवायन, जीरा,\n\n•काली मिर्च डीप  डाल लें. अगर आप  मोयन के लिए तेल डाल रहे हैं तो इसे ऐसै ही डाल लें लेकिन अगर घी डाल रहे हैं तो इसे पिघला कर डालें. इसके लिए घी क्रो बस पिघला हैं. इसे बहुत ज्यादा  गरम करने को ज़रूरत नहीं हैं.\n\n•अब धीरे-धीरे इसमें गुनगुना पानी  डालते हुए आटे को  सख्त मूंथ लें. इसके लिए एक छोटा गिलास या 150 ग्राम पानी काफी रहेगा. गूंथने के बाद आटे  क्रो सैट होने के लिए आधे घंटे के लिए ढक कर रख दें.\n\n• गुंथे आटे  क्रो 4 बराबर भागों में बांट कर इनसे गोल लोईंयां तैयार करके रख लें. एक लोई की  मोटी पूरी को तरह 11 -12 इंच के व्यास में गोल बेल लें.\n\n•एक छोटी चम्मच तेल इस दुई पूरी एर डाल कर चारों तरफ़ अच्छे से फ्रेला दें.\n\n•पूरी के सिरे क्रो उठाते हुए इसे मोड़ना शुरु करें और फिर मौड़ते हुए इसका रोल बना लें. चाकू लेकर इस रोल से साधा- साधा इंच के गोल टुकडे काट लें. एक टुकडे क्रो हाथ से दबाते हुए गोलाई में चपटा आकार  दें.\n\n•इसे किसी अलग प्लेट में रख लें. आटे की बाकी सीन लोईयों को  भी इस तरह खेल कर रोल तैयार करें और फिर काट करके रख लें.\n\n•जब सारे चपटे रोल तैयार हो जाएं तो  हमें इन्हें  मठरी को तरह थोडा मोटा खेलना हैं.\n\n• एक कढाई में तेल गरम करें. इसमें जतनी पूरी आसानी से तली जा सके उतनी डाल लें. इन्हें पलटते हुए ब्राउन होने तक तल लें. सारी पूरियों क्रो इसी तरह तल कर किसी प्लेट में निकाल लें.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.g9);
                       txt = ("•मैदा … 1 कप\n• बेसन … 1 /4 कप\n• सूखा नारियल … 1 /4 कप\n•तिल -1/4 कप\n• लाल मिर्च पाऊडर … 3 चम्मच\n• नमक स्वादनुसार\n•तेल");
                        txt2 = ("•सबसे पहले  मैदा में नमक ओर 1 चम्मच तेल डालकर आटा  मूंथ लें ओर इसे तीन  घंटे के लिए ढंक कर रख ।\n\n• अब एक  कटोरे में सूखा नारियल, लाल मिर्च पाऊडर, तिल ओर नमक डाल लें । इन सारे मिश्रण को अच्छी  तरह आपस में मिला लें ।\n\n•  गूथे हुए आटे को मोटी आकार में रोटी बेल लें । अब ऊपर पहले  से बनाया गया बेसन का मिश्रण डाल ले ।\n\n• रोटी को गोल करके रोल कर लें । रोटी को लपेट कर 10 मिनट के लिए साइड में रख दें।\n\n अब रोटी को तेल में डीप फ्राई कर लें । तलने के बाद इसे  आकार में काट लें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.g10);
                       txt = ("•2 बडे चम्मच घी\n• 2 बडे चम्मच चीनी\n• 1 छोटा चम्मच कटा अदरक \n• 1 छोटा चम्मच जीरा\n• 8 कटी  शिमला मिर्च\n•-1/2 छोटा चम्मच काली मिर्च पाउडर\n• 2 चुटकी हिंग पाउडर\n• 3 बडे चम्मच दूध\n• 2 कटी  हरी मिर्च\n• 2 बडे चम्मच आटा \n• 2 कप मकई के उबले दाने\n• नमक स्वादानुसार ");
                        txt2 = ("•कढ़ाई  में घी गरम कर जीरा ,हींग भून लें ,\n\n•हरी मिर्च… -अदरक  भी भूनें आटे  को धीमी आच एर चलाते हुए ब्राउन होने तक सेंक लें\n\n• फिर उबली मकई और शिमला मिर्च मिला दें , दूध भी डाल दें और गाढा होने तक पकाये  ।\n\n• अब नमक ,काली मिर्च और चीनी मिलकर  आंच  से उतारकर गरमा-गरम सर्व करे ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.g11);
                       txt = ("•एक कप पोहा \n•आधा  कप सूजी\n• एक कप दही\n• एक छोटा चम्मच हरी मिर्च का पेस्ट\n• आधा  छोटा चम्मच चीनी\n• स्वादानुसार नमक\n• एक छोटा चम्मच ईनो फ्रूट सॉल्ट\n•त्तड़का बनाने के लिए\n• 1 बडा चम्मच तेल\n•एक छोटा चम्मच राई \n•2 हरी मिर्च लंबाई में कटी  हुई\n• 6-7 को पत्ता\n• एक बडा चम्मच \n• एक चुटकी हींग");
                        txt2 = ("•एक बाउल में एक कप दही और एक कप पानी  डालकर अच्छी  तरह फैट लें.\n\n•पोहै क्रो भिगो कर 10 मिनट के लिए रखें. फिर पानी  निथारकर अलग रख लें.\n\n•अब दही में पोहा, सूती, मिर्च का पेस्ट, नमक और चीनी डालकर अच्छी  तरह मिक्स कर लीजिए.\n\n•ले इसमें ईनो और 2 बडा चम्मच पानी  डालें और मिला दे \n\n• एक 3 इंच गहरे बर्तन में तेल लगाकर चिकना कर लें.\n\n•तैयार मिश्रण क्रो इसमें डालें और हिलाकर बराबर कर लें.मीडियम आंच में प्रेशर क्रूकर या स्टीनर में 3 कप पानी  डालकर गरम करे. फिर जाली  वाल स्टैड रखकर मिश्रण वाला बर्तन रखै. ढककर 12-15 मिनट तक पकने के लिए रखें.\n\n• 15 मिनट के बाद ढोकले पर  चाकू डालकर चेक कर लें.अगर चाकू में ढोकला चिपकता नहीं हैं तो समझिए ढोकला पक गया हैं. अगर नहीं पका  तो 2-3 मिनट और ढककर पका  लें.\n\n• आंच से उतारकर ढोकले के बर्तन क्रो सावधानी से बाहर निकालें.\n\n• अब एक तड़के वाले पैन  में तेल डालकर गरम करें. फिर इसमें राई, हरी मिर्च और हींग डालकर पकाये .आंच बंद कर दें और तड़के क्रो ढोकला पर  डाल दें.\n\n•तैयार पोहा ढोकला क्रो काटकर हरी धनिया से सजाकर सर्व करें और खुद भी गर्मागर्म खाएं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.g12);
                       txt = ("•बेसन … 2\n• कपदही … 2\n•चम्मच बेकिंग सोडा … 1 /4\n•चम्मच मैथी पत्ती … 2.5\n•कप चीनी  … 2\n•चम्मच नमक … स्वादानुसार\n•'हल्दी पाउडर … 1 /2\n•तिल … 2 चम्मच\n•धनिया पाउडर … 1 चम्मच\n•जीरा पाउडर … 1 चम्मच\n•लाल मिर्च पाउडर … स्वादानुसार\n•निम्बु का रस … 2 चम्मच\n• अदरक हरी मिर्च का पेस्ट स्वादानुसार\n•तेल … तलने के लिए\n•पानी … उबालने के लिए\n•राई … 1/2 चम्मच\n•हिंग … 1 चुटकी\n•कड़ी  पत्ता … 8-10\n•हरा  नारियल");
                        txt2 = ("•सारी सामग्री मिला कर मूंथ लें ।तैयार आटे को 1 5-2 0मिनट ढक कर रख दें । आधे-आधे आटे से 2 लम्बे रोल बना लें ।गरम यानी में 15-20 मिनट उबालें ।\n\n• निकल कर थोडा ठंडा करें । 1 इंच के टुकडों में काट कर गरम तेल में सुनहरा होने तक तल लें ।हरा धनिया च नारियल डाल कर चटनी के साथ घरीसें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.g13);
                       txt = ("•रवा… 3 कप\n•तेल- 3 चम्मच\n•लाल मिर्च… 2\n•कडी पत्ते… 7\n•राई- 1 चम्मच\n•दही- 1 कप\n• नमक");
                        txt2 = ("•पैन  में तेल गरम करें, उसमें कटी  लाल मिर्च, कडी पत्ते और राई डाल कर फ्राई करें ।\n\n• उसके बाद उसमें सूजी पानी  रवा डाल कर हल्की आंच पर पकाये।\n\n• फिर आंच बंद  कर दें और उसे ठंडा होने के लिये छोड़ दें ।\n\n•जब सामग्री ठंडी हो जाए तब उसमें दही मिला कर  घोल तैयार करें ।\n\n• घोल  में नमक डालें और घोल को  गरम जगह पर  करीबन 10 मिनट के लिये रख दें ।\n\n• 10 मिनट बाद इडली वाले बरतन में घोल डाल कर उसे पका  लें और फिर सर्व करें।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 13: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.g14);
                       txt = ("•5 दाहिनी पाव (दाहिनी बना\n• 1 टेबल स्युन मीठी चटनी\n• 2 टेबल स्युन लहसून चटनी\n• 2-3 टेबल स्युन नायलॉन सैव (बारीक रोब)\n• 2 टेबल स्युन अनार के दाने\n• 3 टेबल स्युन बटर\n•भरावन के लिए\n•3 आलू\n•2 टेबल स्युन दाहिनी मसाला\n• 1 टेबल स्युन सेकी हुई, मूंगफली के दाने\n• 3 टेबल स्युन अनार के दाने\n•त्प्तए बारीक को प्याज\n•1 टेबल स्युन तेल\n•चुटक्री भर हल्दी पाउडर\n•चुटक्री भर हींग\n• 1 टेबल ट्यून हरा धनिया, बारीक कटा हुआ\n• नमक स्वादानुसार");
                        txt2 = ("•सबसे पहले आलू क्रो धोकर प्रेशर कुकर में 2 सीटी जाने तक पकाइये  ।\n\n•अब प्रेशर कुकर को ठंडा करके आलू  को छीलकर मसल कर महिम बनाइए ।\n\n• एक कढाई में तेल गर्म कीजिये । तेल गर्म होन एर हींग और मसले हुए आलू , हल्दी पाउडर, नमक, दाहिनी का मसाला डालकर अच्छे से मिश्रित करें और 2 से 3 मिनट तक थोडे से मूंगफली के दाने और अनार के दाने डालकर मिलाइए । गैस क्रो बंध कीजिये और बारीक कटा हुआ हरा धनिया डालिए ।\n\n•इस मिश्रण क्रो एक कटोरे में निकालकर साइड एर रखिए  इसे आलू  से बीच में से काट\n\n• इस तरह से काटिए दो साइड से जुडा रहे । अब पाच के अंदर ऊपर और नीचे को तरफ चम्मच से मीठी चटनी और लहसुन चटनी फैलाए ।\n\n•इसमै  तैयार क्रिया हुआ आलू  का भरावन  रखे, थोडे से प्याज, मूंगफली के दाने और थोडी सी नमकीन डालिये और बन के ऊपर वाले हिस्से क्रो दबाकर बंध कीजिये ।\n\n• अब एक तवे क्रो गर्म करें और उस एर चम्मच से थोडा सा बटर लगाएं, और  भूरा रंग होने तक रोके ।\n\n• अब इसे पलटकर चम्मच से दूसरी और भी बटर लगाए  हल्का सा क्रुरक्रुरापन आने  तक दोनों तरफ से ए ।\n\n•इसी तरह से सारी दाहिनी तैयार कीजिए । अब इसे एक प्लेट में रखे और ऊपर डालें । दाहिनी मीठी चटनी या टमाटर के साथ परोसें ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.g15);
                       txt = ("•सूजी- 1 कप (380 गाम)\n•दही- 3/4 कप (350 गाम)\n•हरा धनिया 2 से 3 टेबल स्पून  (बारीक कटा हुआ )\n•अदरक का टुकडा… 1 इंच (बारीक कटा हुआ )\n•हरी मिर्च… 2 (बारीक कटी  हुई)\n•नमक- 3/4 छोटी चम्मच या स्वादानुसार\n•बेकिंग सोडा- 1/4 छोटी चम्मच से कम\n•तेल- तलने के लिए");
                        txt2 = ("•सूजी के बड़े बनाने के लिए सबसे पहले बटर तैयार कर लीजिए. इसके लिए, एक बडे प्याले में सूजी और दही डाल दीजिए. दोनों सामग्री को अच्छे से मिक्स कर लीजिए. इसके बाद, सूजी -दही के मिश्रण में अदरक, हरी मिर्च, नमक डाल दे . सभी मसालों को मिश्रण में अच्छे से मिक्स कर दे \n\n•बटर  में थोडा सा पानी  मिला लीजिए. बटर  एकदम उड़द को दाल से बनने वाले बटर  जितनी गाढी कन्सिस्टेन्सी का बनना चाहिए बटर  क्रो 10 से 15 मिनिट के लिए ढककर रख दीजिए ताकि सूजी फूल जाए\n\n• 10 मिनिट बाद, सूजी फूल चुकी है. इसमें हरा धनिया और ब्रेकिंग सोडा डालकर मिला ले . बटर हल्का सा गाढा है इसमें 1 छोटी चम्मच पानी  डाल दीजिए. चूड़े  बनाने के लिए बटर  तैयार हे. (इस पूरे बटर  में तकरी बन 2 से 3 टेबल स्पून पानी  का इस्तेमाल करे )\n\n• कढ़ाई  में बड़ी  को  तलने के लिए पर्याप्त मात्रा  में तेल डालकर गरम कर लीजिए. तेल चैक करने के लिए, कडाई के थोडा ऊपर हाथ रखकर देखिए. अब, आंच मध्यम कर \n\n•चूड़े  दो तरह से बनाए जा सकते हे. पहले  तरीके के लिए,हाथ एर थोडा सा पानी  पहले  गीला  कर लीजिए और चम्मच से बटर  उठाकर हाथ पर  निकालिए और इसे गोल करके बीच  में अंगूठे से मोटा छेद कर दीजिए.\n\n•दूसरे तरीके से बड़े  बनाने के लिए, एक कटोरी क्रो कपडे से पूरा ढक लीजिए और पीछे की  और से कपडे क्रो कटोरी समेत पकड़ लीजिए. इस कपडे पर पानी लगा लीजिए. फिर, इस  पर   1 से 2 छोटी चम्मच बटर रखिए.\n\n•इसे हाथ से गोलाकार कर लीजिए और बीच में उंगली से छेद कर दीजिए. इसे सावधानी कपडे से उतारकर दूसरे हाथ में रखिए और फिर, कडाई में तलने डाल दीजिए. (इस तरीके से वडे बनाना ज्यादा आसान है) जैसे ही वडा नीचे की  और  से सिक जाए, वैसे ही इसे दूसरी और तलने दीजिए. इसी तरह से वडे बनाकर कडाई में तलने डाल दीजिए.\n\n•बड़ो  क्रो पलट-पलट कर अच्छे गोल्डन ब्राउन होने तक तल लीजिए.\n\n•वडे गोल्डन ब्राउन होकर तैयार हो गए हैं, इन्हें नैपकिन बिली प्लेट में निकाल लीजिए. बहीं क्रो निकालते समय,इन्हें कलछी में कडाई के किनारे एर तिरछा करके रखिए ताकि इनमें से अतिरिक्त तेल कडाई में ही वापस चला जाए इसी प्रसार, बाक्री वडे भी बनाकर व तलत्6र प्लेट में निकाल लीजिए. इतने बैटर में 7 वडे बने हैं.\n\n• गरमागरम सूजी के वडे बनकर तैयार हैं. बाहर से करारे और अंदर से नरम, इन सूजी के बहीं क्रो हरे धनिये को चटनी और मूंगफली के दानों को चटनी के साथ परोसिए और चाव से खाइए.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                }
                break;
            }


            case "Bengali Food Receipes": {
                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b1);
                       txt = ("•फूल क्रीम दूध - 1/2 लीटर (दूध को गाढा करने के लिए)\n•चीनी - 1 कप (225 गाम)\n• पाउडर चीनी - 1/4 कप (40-50 गाम)\n•नींब्रू- 1 बडा सा -केसर - 15-20 धागे\n•छोटीं इलायची - 4-5\n•पिस्ते - 7-8");
                        txt2 = ("•दो अलग-अलग बर्तन लीजिए, एक में दूध गाढा होने के लिए रख दीजिए और दूसरे में छेना बनाने के लिए\n\n• छेना बनाईये\n\n• नीबू का रस निकाल कर उसमें उतना ही पानी  मिला लीजिये-दूध में उबाल आने  के बाद, दूध को  गैस से उतार लीजिये, दूध को  हल्का  सा ठंडा होने दीजिये, यानी की वह  3-4 मिनिट रखने के बाद, थोडा नींबू का रस डालते हुए  चमचे से चलाइये, दूध जब पूरा फट जाय, दूध में छेना और दूध अलग  दिखाई देने लगे तो नींबू का रस डालना बन्द कर दे \n\n• छेना को  कपडे में छानिये और ऊपर से ठंडा पानी  डाल कर निकाल दीजिये ताकि नींबू का स्वाद छेना में न रहे.\n\n• कपडे को  चारों और से उठाकर हाथ से दबा कर अतिरिक्त पानी  निकाल दीजिये. रसगुल्ला  बनाने के लिये छेना तैयार है \n\n•दूध गाढा कीजिये \n\n•खीर के लिये दूध में उबाल जाने एर गैस धीमी कर दीजिये और गाड़ा  होने दीजिए, थोड़ी थोड़ी  देर में दूध  को चलाते रहिये, ताकि दूध  कढाई के तले मे लगे \n\n•  इलायची का पाउडर बना लीजिए और पिस्ते को  छोटे-छोटे टुकडों में काट लीजिए.\n\n•  दूध गाढा होने एर, इलाइची पाउडर, केसर के धागे और पाउडर चीनी डालकर मिला दीजिये.\n\n• छेना के गोले  बना लीजिये:छेना को  किसी थाली में निकाल लीजिये और 5-6 मिनिट छेना को  मसल मसल कर चिकना कर लीजिये,\n\n•छेने से थोडा थोडा छेना निकाल  छोटे छोटे गोले बना कर प्लेट में रख लीजिये. इतने छेना से लगभग 60- 65 के करीब छेना गोले बनकर के तैयार हो जाते हैं.\n\n•कुकर  में चीनी डालिये, हाफ  कप पानी  मिलाइये और आग पर  चाशनी बनाने के लिये रख दीजिये. चीनी को  पानी  में अच्छी  तरह से घूलने तक और उबाल जाने तक पक्काए\n\n•चीनी में उबाल आने पर,छेना से बनी गोलियों डाल दीजिए,कुकर को  बंद कर दीजिये, और कुकर में एक सीटी जाने के बाद, गैस धीमी करके 10 -12 मिनिट के लिए धीमी आंच एर पकने दीजिए. गैस बन्द कर दीजिये\n\n•चीनी में उबाल आने  एर, छेना से बनी गोलियों डाल दीजिए, कुकर को  बंद कर दीजिये, और कुकर में एक सीटी आने  के बाद, गैस धीमी करके 10 -12 मिनिट के लिए धीमी आंच एर पकने दीजिए. गैस बन्द कर दीजिये\n\n•क्रुकर के प्रेशर समाप्त होने एर कुकर में से छेना को  निकाल लीजिए और ठंडा होने दीजिए. छेना के ठंडा होने एर इसे गाढे दूध में डाल दीजिए और धीमी आंच एर 5-6 मिनिट के लिए पकने दीजिए.\n\n•खीर बनकर तैयार हैं, -\n\n•इसे प्याले में निकाल लीजिए और पिस्ते से सजाइए . छेना और खीर  1 -2 घंटे के लिए फ्रिज में ठंडा होने के लिए रख दीजिए. ठंडी छेना और परोसिये और खाइये .\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b2);
                       txt = ("•मावा - 1 कप ( 250 गाम)\n•चीनी पाउडर - 1 /2 कप से थोड़ा   अधिक ( 100 गाम )\n•पनीर  - 1 कप क्रमबल   क्रिया हुआ ( 200 गाम)\n•चीनी … 3/4कप  (350 गाम)\n•कॉर्न फ्लोर - 2 छोटे चम्मच\n•नींब्रू- 1 नीब्रू का रस\n•पीला कलर - 1 पिंच  -केसर - 10-12 धागे\n•फूल क्रीम दूध - 500 गाम");
                        txt2 = ("•स्सकदम बनाने के लिए सबसे पहले  छेना बनाकर तैयार कर लीजिए. दूध गरम होने के लिए रख दीजिए जब दूध मे  उबाल आ  जाए तो गैस बंद  कर दीजिए और दूध को  थोड़ा सा  ठंडा होने दीजिए.\n\n•दूध के 80% गरम रह जाने एर, नींबू के रस में 2 चम्मच पानी  मिला कर , थोडा… थोडा डालते हुये मिलाइये.\n\n•दूध पूरी तरह से फट जाए तो दूध में से पानी  अलग तथा छेना अलग हो जाता हैं. तब आप  नींबू का रस डालना बंद कर दीजिए.\n\n• छेना को  एक साफ़ कपडे, सूती कपडे में डाल कर छान लीजिए, हाथ से दबा कर सारा पानी  निकाल दीजिये. तथा छेना के ऊपर ठंडा पानी  डाल दीजिए,\n\n• ऐसा करने से इसमें से नींबू का सारा स्वाद हट जाएगा.कपडे को  चारों तरफ़ से हाथों से उठाकर दबाते हुए छेना का सारा पानी  निकाल दीजिए. रसगुल्ले बनाने के लिए छेना तैयार हो चुका हैं.\n\n•छेना को  अलग थाली में निकाल लीजिए, और हाथों से मसल-मसलकर चिकना क्रीजिए. कॉर्न फ्लोर और पीला रंग  मिलाते हुए, छेना को  मलिये और चिकना कर लीजिये .\n\n• रसगुल्ले  बनाने के लिए छेना तैयार हैं. छेना से छोटे-छोटे गोले  बनाकर  कर थाली में रखते जाइए. सारे गोले बना लीजिये\n\n• चाशनी बनाकर रसगुल्ले  पकाइये\n\n•क्रुकर में चीनी और 2 कप यानी डालकर उबलने के लिए रख दीजिए, चीनी को  पानी  में घुलने तक पका  लीजिये,चाशनी में केसर के धागे डाल दीजिये और चाशनी में उबाल आने  दीजिये.\n\n•उबलती चाशनी में छेना से बने हुए गोले डाल दीजिए.कुकर को  बन्द कर दीजिए और 1 सीटी आने  तक पकने दे\n\n•सीटीं आने  के बाद गैस को  धीमा कर दीजिए और रसगुल्लो को  धीमी मीडियम आंच एर 8-10 मिनिट पकने दीजिए.\n\n•इसके बाद गैस बंद कर दीजिए और कुकर का प्रेशर समाप्त होने एर रसगुल्लों  को  निकालें.\n\n• रसगुल्लो को  2-3  तक चाशनी में ही रहने दीजिए इसके बाद इन्हें छलनी की  मदद से छान लीजिए ताकि सारी चाशनी निकल  आए \n\n•पनीर  कद्दूकस  कर लीजिए और कढाई में डालकर लगातार चलाते  हुए भून लीजिए. पनीर ड्राई होकर हल्कऱ ब्राउन हो जाने एर गैस बंद कर दीजिए और भूने पनीर को  प्लेट में निकाल लीजिये.\n\n•कदूकस किए हुए मावा  में पाउडर चीनी डालकर अच्छी … तरह मिक्स कर लीजिए. अब मावा  से लड्रडू के आकार  के लगभग 11 छोटे-छोटे गोले तोड़ लीजिए.\n\n• एक गोले को  उठा कर इसको चपटा करके थोडा बडा कर लीजिये. फिर इसमें एक रसगुल्ला रखकर चारों और  से बंद करके गोल लड्रडू का आकार  दे दीजिए.\n\n•इस गोले  भूने पनीर पर  लपेट  कर थाली में रख दीजिए सारे रसकदम इसी तरह बनाकर तैयार कर लीजिए.\n\n•रसकदम को  1 घंटे के लिए फ्रिज में रख कर उसके बाद सर्व क्रीजिए. रसकदम फ्रिज में रखकर 3-4 दिन तक खाये जा सकते हैं.\n\n•सुझाव …\n\n•रसकदम बनाने के लिए रसगुल्लो को चाशनी को  पूरी  तरह से छान कर ही इस्तेमाल करना  चाहिए अगर चासनी  रसगुल्लो में से पूरी तरह नहीं निकली होगी तो मावा  में रसगुल्ले भरने एर चाशनी उसमें से निकलने लगेगी और रसकदम भी ढीले ढीले बनकर तैयार होंगे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b3);
                       txt = ("•फूल क्रीम मिल्क - 1 लीटर \n•नींब्रू- 2 \n•पाउडर चीनी - 1 कप (50 गाम)\n•इलायची - 5\n•-केसर - 20-25 धागे\n•-पिस्ते - 10 - 12");
                        txt2 = ("•दूध को किसी भारी तले वाले बर्तन में डाल कर गरम कीजिये. दूध में उबाल  आने  के बाद, दूध को गैस से उतार लीजिये\n\n•दूध को हल्का सा ठंडा होने दीजिये.निम्बू के  रस में थोडा सा पानी  मिला दीजिए और दूध को  हल्का सा ठंडा होने एर इसमें थोडा थोडा नींबू का रस डालते हुये चमचे से चलाइये, जब पूरा फट जाय, दूध में छेना और पानी  अलग दिखाई देने  लगे तो नींबू का रस डालना बन्द कर दीजिये.\n\n• छेना क्रो कपडे से  छानिये और ऊपर से ठंडा पानी  डाल दीजिये ताकि नींबू का स्वाद छेना में न रहे. कपडे क्रो चारों और से उठाकर हाथ से दबा कर अतिरिक्त पानी  निकाल दीजिये.\n\n• संदेश बनाने के लिये छेना तैयार हैं.\n\n• छेना क्रो किसी थाली में निकाल लीजिये और 5-6 मिनिट छेना क्रो मसल-मसल कर चिकना कर लीजिये.\n\n• इलायची क्रो कूट  कर पाउडर बना लीजिए. पिस्तों क्रो पतला पतला काट लीजिए.\n\n• अब छेना में केसर और पाउडर चीनी डालकर अच्छे से 2-3 मिनिट तक मिक्स कर लीजिए.\n\n• नॉन स्टिक पैन लीजिए इसे गैस एर रख कर इसमें छेना क्रो डालकर एकदम धीमी आंच एर लगातार चलाते हुए 3-4 मिनिट तक भून लीजिए.\n\n•गैस बंद कर दीजिए और छेना क्रो प्लेट में निकाल लीजिये .छेना क्रो थोडा ठंडा होने दीजिए और हल्कऱ ठंडा हो जाने एर इसमें इलायची पाउडर डालकर अच्छे से मिक्स कर लीजिए.\n\nअब इस छेना से थोडा सा मिश्रण निकालिये, गोल और चपटा करके प्लेट में रखिये. इसी तरह थोडा… थोडा मिश्रण निकाल कर ,\n\n•छोटे-छोटे गोले बना कर प्लेट में रख लीजिये. बारीक कटे  हुए पिस्तों क्रो इन संदेश के ऊपर लगाकर इनकी गार्निश कर दीजिए स्वादिष्ट संदेश बनकर तैयार हैं.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b4);
                        textView3.setText(Text2);img.setImageResource(R.drawable.b4);
                       txt = ("• फुल क्रीम दूध - 1 लीटर\n• इलायची - 4\n•दही … 3-4 टेबल ट्यून\n•चीनी- 300 गाम (1/2 कप)");
                        txt2 = ("•दूध  को बर्तन में डालकर पाले तेज अग्रेच एर उबाल आने तक गरम कर लीजिए, जब इसमें उबाल जाने लगे, तब जाग को धीमा कर दीजिए और दूध को बराबर चलाते हुए साधा होने तक उबालते रहिए (दूध को अ छी तरह से चलाना जरूरी होता हैं ताकी यह बर्तन के तले एर न चिपके.\n\n•दूध उबल कर गाढा होकर साधा रह जाए, गैस छंद कर दीजिए. अक्चधी चीनी और इलायची का पाउडर डालकर मिला दीजिए. बची हुई चीनी को क्रैरेमलाइज कर लीजिए.\n\n•चीनी को क्रैरेमलाइज करने के लिये भारी तले के बर्तन में चीनी डालकर मध्यम गैस एर रखिये और चीनी को चमचे से लगातार चलाते रहिये.\n\nथोडी देर में चीनी पिघलना शुरु हो जायेगी. चीनी क्रो लगातार चलाते रहिये. चीनी अ छी तरह पिघलने एर,क्रैरेमलाइज हो जाने एर इसे दूध में डालकर अ छी तरह से मिला दीजिए.\n\n•चीनी मिले दूध को  जमाने के लिए मिट्ठी के बने क्रुल्हड़ ले लीजिए और इसमें दूध को  डाल दीजिए. दूध न ज्यादा गर्म ओहेन ज्यादा ठंडा होना चाहिए, दूध मध्यम गरम होना\n\n•दूध से भरे क्रुल्हण में दो चम्मच दही को डालकर इसे मिला लीजिए और ढककर जमने के लिए किसी गर्म स्थान एर रख दीजिए (मिष्टी दीई जमाने के लिए कोई अन्य बर्तन भी लिया जा सकता हैं\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b5);
                       txt = ("•आटा  लगाने के लिये\n• मैदा - 2 कप\n• घी - 3 टेबल स्पून \n• नमक - 1 पिंच \n• दूध - आधा  कप\n•तेल - तलने के लिये\n• चाशनी के लिये\n•चीनी - 2 कप\n•छोटीं इलाइची … 4-5");
                        txt2 = ("•मैदा को किसी बडे प्याले में ले लीजिये, नमक और घी डालकर मैदा में अच्छी  तरह मिला लीजिये, और थोडा थोडा दूध डालकर पूरी तरह  सख्त आटा  लगा लीजिये. आटे को ढककर 20 मिनिट के लिये रख दीजिये.\n\n•20 मिनिट बाद आटा  क्रो थोडा मसल कर चिकना कीजिये और जाते से छोटी छोटी लोइयां बनाकर तैयार कर लीजिये,इतने जाते से 21 - 22 लोइयां तोड़ लीजिये और गोल बना कर दबा कर पेडे जैसा बना लीजिये.\n\n•लोइयों क्रो ढककर रख लीजिये, 1 लोई उठाइये चकने एर रखिये और  5 - 4 इंच के व्यास में पतला खेल लीजिये,\n\n•क्रिनारों से साधा सेमी. छोड़ते हुए ,3/4 रोगी, मोटे शेड्स  काट लीजिये. अब शेड्स  क्रो फोल्ड करते किनारे बांध लीजिये और चपटा कर दीजिंये.\n\n•एलो झेलो को बेलकर , बनाकर थाली में लगा लीजिये. सारे एलो झेलो  को  खेल कर बनाकर तैयार कर लीजिये.\n\n•एलो झेलो को  तलने के लिये कढाई में तेल डालकर गरम कीजिये, मीडियम गरम तेल में एलो झेलो जितने कढाई में आ जाय उतने डाल दीजिये, 4-5 एलो होती कढाई में डाल दीजिये, और एलो झेलो को  मीडियम और धीमी आंच  एर पलट पलट कर गोल्डन ब्राउन होने तक तल कर निकाल लीजिये  . सारे एलो झेलो इसी तरह तल कर निकाल कर एलो झेलो के ऊपर चाशनी चढा लीजिये एलो झेलो के ऊपर चाशनी चढाने के लिये 2 तार को चाशनी चाहिये. चाशनी के लिये किसी बर्तन में चीनी और एक कप पानी  डाल कर उबलने के लिये रख दीजिये.\n\n• चीनी को  पूरी तरह घुलने तक पका लीजिये, 2-3 मिनिट और पकाकर चाशनी को  चैक दिजिये, चाशनी को 1-2 बूंदे किसी प्याली में गिराइये और ठंडी होने के बाद उंगली और अंगूठे के बीच चिपका कर देखिये.\n\nचाशनी से 2 तार निकल रहे हैं तो चाशनी बन कर तैयार हैं,और अभी तार नहीं बन रहे हैं , तो चाशनी को  थोडा और एका कर फिर से चैक करके 2 तार  वाली कंसिस्टेंसी को\n\nचाशनी बना लीजिये.\n\n चाशनी बनने के बाद उसे थोडा ठंडा होने दीजिये, लगभग 10-15 मिनिट तक चाशनी को  ठंडा होने दीजिये. एक झेलो  होती उठाइये.\n\n• चाशनी में अच्छी  तरह से डुबाकर निकाल लीजिये, और किसी प्लेट में रखने दीजिये . एक एक करके सारे झेलो  होती चाशनी में डुबाकर निकाल लीजिये.बहुत ही स्वादिष्ट एलो झेलो  बनकर तैयार हैं. एलो झेलो  को  पूरी तरह सूखने के बाद कन्टेनर में भर कर रख लीजिये,और 2 महिने तक खाते रहिये.सुझाव :एलो झेलो  का आटा  गूथते समय, घी की  जगह रिफाइन्ड तेल भी डाला जा सकता हैं. एलो झेलो  को तैल की  जगह घी में तला जा सकता हैं.\n\n•एलो झेलो का आटा  गूथते समय आप  चाहें तो 1 /4 छोटी चम्मच कलोंजी डाल सकते हैं.\n\n• अगर आप  अधिक मीठे एलो झेलो  खाना चाहते हैं तब चाशनी को 2 तार वानी कंसिस्टेंसी  से थोडा सा और गाढा दिजिये, या एलो झेलो  को  एक बार चाशनी से निकालने एर उन्हें ठंडा होने के बाद दूसरी बार पानी  कि फिर से चाशनी में डुबाकर निकाल लीजिये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b6);
                       txt = ("• दूध - 1.5 लीटर (7.5 कप)\n•चीनी - 1 किग्रा. (4 कप) \n•अरारोट  - 2 छोटी चम्मच\n•टाटरी (टार्टरिक एसिड) - आधा छोटी चम्मच या 3 चने के बराबर टुकडे\n•काजू - 10-12\n•पिस्ते - 1 टेबल स्पून \n•छोटीं इलाइची … 6-7");
                        txt2 = ("•राजभोग बनाने के लिये सबसे पहले  छेना बनाकर तैयार करना  हैं: छेना बनाने के लिये दूध को गर्म करने के लिये गैस पर  रख दीजिये.\n\nछेना फाड़ने के लिये टाटरी (टार्टरिक एसिड) को आधा  कप पानी  में घोल कर टाटरी का घोल बना लीजिये.\n\n•दूध में उबाल आने  के बाद गैस बन्द कर दीजिये, दूध को  गैस से उतार लीजिये और थोडा सा ठंडा होने दीजिये.\n\n•दूध को  80०/० गरम रहने के बाद उसमें थोडा थोडा टाटरी का पानी  डालिये और चमचे से मिलाते हुये चलाइये.\n\n•जब तक दूध फटने न लगे तब तक टाटरी का पानी मिलाते और दूध को  चलाते रहे, जैसे ही दूध फट जाय टाटरी का पानी  मिलाना बन्द कर दीजिये. दूध 2 मिनिट में अच्छी  तरह तैयार हो जाता हे.\n\n• अब सूती, गोद, प्याले कपडे को  सोलर छलनी के ऊपर फैलाये  ओर छलनी को  किसी बडे बर्तन के ऊपर रख\n\n•फटे दूध को  कपडे पर  डालिये, छेना कपडे के ऊपर रह जायेगा, और पानी नीचे के बर्तन में आ जायेगा. कपडे को  चारों और से उठा  कर छेना को  दबाकर सारा पानी  निचोड़ दीजिये. छेना तैयार हे.\n\n•छेना को  किसी बड़ी  प्लेट में निकाल लीजिये, और दोनों हाथो को उंगलियों से मथ मथ कर चिकना कीजिये, चिकने किये हुए छेना में अखरोट  डालिये और अच्छी  तरह मलते हुये मिक्स कीजिये. राजभोग के लिये छेना तैयार हो गया हे.\n\n पिट्ठी बना लीजिये:\n\n•काजू को  छोटे छोटे टुकडे में काट लीजिये, पिस्ते को  भी छोटे छोटे टुकडे में काट लीजिये (आप चाहें तो पिस्ते को  गरम पानी  में डाल कर थोडा रख लीजिये, और उसका छिलका उतार लीजिये) .\n\n•इलाइची को  छील कर क्रूट कर पाउडर बना लीजिये. 1 टेबल स्पून  छेना और सारी कटे  हुये मेवे, इलाइची पाउडर अच्छी  तरह मिलकर पिट्ठी तैयार कर लीजिये. (पिट्ठी में पसन्द के अनुसार, पीला या लाल फूड कलर डाल सकते हैं) -\n\nराजभोग के गोले बनाकर तैयार कर लीजिये:\n\nछेना को  बराबर बराबर के छोटे छोटे टुकडों में तोड़ लीजिये(इतने छेना को  12-14 टुकडों में तोड़ लीजिये) .\n\n•छेना का एक टुकडा उठाइये, हथेली एर रखकर थोडा बडा कर , बीच में थोड़ी  सी गहराई बना लीजिये, गहराई के ऊपर 1 /4 छोटी चम्मच पिट्ठी रख लीजिये, छेना को  चारों और से उठाकर पिट्ठी को  बन्द कर दीजिये, और अच्छी तरह दोनों हाथों की  सहायता से गोल कर लीजिये, तैयार गोले को  प्लेट में रखिये, \n\n• चाशनी बना लीजिये :\n\n•किंसी बर्तन में चीनी डालिये, और 2-5 कप पानी  डाल दीजिये, और चाशनी को  चीनी घुलने तक पकने दीजिये.\n\n•चीनी अगर साफ न हो तो चीनी पानी  में घुलने के बाद आधा  कप दूध चाशनी में डालिये, उबल कर जो गन्दे से जो झाग चाशनी के  ऊप्पर आ जाए  उन्हें चमचे से निकाल कर हटा दीजिये.\n\n•चाशनी को  1 तार या 2 तार देखना आवश्यक  नहीं है चाशनी में अच्छी तरह   उबाल आने  एर राजभोग को  1 - 1करके अच्छी  तरह उबलती चाशनी में डालिये, गैस प्लेम तेज रखिये, चाशनी हमेशा उबलती रहनी चाहिये.\n\n•बर्तन को  ढककर राजभोग को  पकाइये ताकि चाशनी के ऊप्पर  भरपूर झाग बनते रहे, ये चाशनी के झाग राजभोग को  पकने में मदद करते हैं. 8-10 मिनिट में चाशनी गाडी होने लगती है अब चमचे से 1 -1 चमचा पानी  डालें, लेकिन ध्यान रहे कि चाशनी में हमेशा उबाल बना रहे, धीरे धीरे एकदम थोडा थोडा पानी  डालते रहे कि चाशनी पतली बनी रहे.\n\n• राजभोग को  उबलती चाशनी में 20 मिनिट तक एका लीजिये.\n\n• चाशनी में बड़े  राजभोग हो जाय तब थोडा 1 -2 चुटक्री पीला फूड कलर या केसर एक टेबल स्पून  पानी  में घोल कर चाशनी में डालकर मिक्स कर दीजिये, पीले गोल्डन, बहुत अच्छे राजभोग तैयार हे.\n\n• राजभोग को  चाशनी में डुबो कर फ्रिज में रखिये और एक सप्ताह तक खाते रहिये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b7);
                       txt = ("•दूध -1 लीटर (5 कप , फुल क्रीम मिल्क )\n•चीनी -300 ग्राम (1.5 कप)\n•निम्बू -2 (रस लीजिये )");
                        txt2 = ("• किंसी बर्तन को  थोडा पानी  डालकर धो  लीजिये और दूध डालकर गरम करने के लिये रखिये. दूध में उबाल आने  पर  दूध को  आग  से नीचे उतार लीजिये, और थोडा सा ठंडा कर लीजिंये(दूध को  80 प्रतिशत तक गरम रहने दीजिये) . नीबू के रस में जितना रस है उतना ही पानी  मिला दीजिये.\n\n• दूध में थोडा थोडा 1-1 टेबल स्पून  करके नीबू का रस डालिये और  मिक्स कीजिये, दूध को अच्छी  तरह फटने तक नीबू का रस डालिये, और मिक्स करते जाइये, जैसे ही दूध अच्छी  तरह फट जाय नीबू का रस डालना बन्द कर दीजिये,और फ़टे दूध को  किसी सूती, साफ कपडे में छान\n\n•कपडे को  छलनी के ऊपर बिछाया और नीचे कोई बर्तन रख र्दीजिंये, फटे हुये दूध को  कपडे के ऊपर डालिये.\n\n•फटे दूध से निकला पानी , नीचे रखे बर्तन में आ जायेगा और छेना कपडे में रह जायेगा. छेना के ऊपर 1 -2 कप ठंडा पानी  डालिये, छेना ठंडा भी हो जायेगा और छेना से नीबू का खट्टा स्वाद भी खत्म हो जायेगा.\n\n•कपडे को  चारों और से उठाकर, हाथ से छेना को  दबाते हुये  आने पहले को अच्छी और फ़टे दुबारा  पानी  निचोड़ दीजिये. नरम नरम छेना बनकर यार \n\n• छेना को  किसी प्लेट में निकालिये, हाथ और उंगलियों से छेना को  दबाते ये, पलट पलट कर 4-5 मिनिट तक मल मल कर नरम चिकना कीजिये. नरम जिये हुये छेना को  10 -12, भागों में बांट लीजिये.\n\n•एक भाग उठाइये और हाथ से लड्रडू क्री तरह दबाकर पाले उसे बाइन्ड कीजिये, और अब गोल आकार  देकर चिकना कीजिये.\n\n•तैयार गोले को  किसी प्लेट में लगा कर रखिये. सारे गोले बनाकर तैयार कर लीजिये.\n\n• रसगुल्ले कुकर में पका  लीजिये, कुकर में रसगुल्ले बहुत जल्दी पक जाते हैं, क्यों कि खुले भगोने को अपेक्षा कुकर में तापमान अधिक हो जाता है रसगुल्ले उठाने के लिये,ज्यादा तापमान को आवश्यकता  होती हे. चीनी और 4 कप पानी  डालिये, उबाल आने  पर  छेना के बने गोले कुकर में एक एक करके डालिये, और कुकर का दक्खन  बन्द कर दीजिये.कुकर में 1 सीटी जाने के बाद, आग  मीडियम कर दिजिये,और रसगुल्ले को  7-8 मिनिट तक और पकने दीजिये, जाग बन्द कर दीजिये.\n\n•किंसी बर्तन में पानी  ले लीजिये उसमें कुकर को  रखकर ठंडा कीजिये या कुकर  के नीचे लगा ङ्कग्रे, ताकि वह जल्दी से ठंडा हो जाय और खुल जाय.\n\n• सावधानी से दक्खन  खोलिये , कुकर से रसगुल्ले चाशनी के साथ निकाल कर किसी प्याले में रखिये और रसगुल्ले को  ठन्डे  होने दीजिये, 5-6 घंटे के बाद रसगुल्ले अच्छे मीठे और बहुत ही स्वादिष्ट हो जाते हैं.\n\n• ठन्डे  ठन्डे रसगुल्ले परोसिये और खाइये.\n\n•  रसगुल्ले  को  फ्रिज में रखकर 7 दिन तक खा सकते हैं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b8);
                       txt = ("•चावल  का आटा - 1 कप\n•गाजर  - 1 ( छोटे टुकडे में कटा हुआ )\n•गाजर-1(छोटे  टुकड़े में कटीं हुई)\n•हरी मटर के दाने - आधा  कप\n•तेल - 2- 3 टेबल स्पून \n•जीरा - 1 /4 छोटी चम्मच हींग - 1 र्पिच\n• अदरक - 1 इंच टुकडा (कदूकस क्रिया हुआ )\n•हरी मिर्च - 1 ( बारीक कटी  हुई)\n• हल्दी पाउडर - 1 /4 छोटी चम्मच\n• धनियां पाउडर - आधा  छोटी चम्मच\n• लाल मिर्च - 2 र्पिच\n• नमक - आधा  छोटी चम्मच (स्वादानुसार)\n• अमचूर - 1 /4 छोटी चम्मच\n•गरम मसाला … 1 /4 छोटी चम्मच\n•हरा धनियां - 2 टेबल स्पून  (बारीक कटा हुआ )");
                        txt2 = ("•चावल  का पिठ्ठा बनाने के लिये सबसे पहले  चावल का आटा गूथ कर तैयार कीजिये. किसी बर्तन में 11/4 कप यानी डालकर गरम करने रख दीजिये, चौथाई कप पानी  किसी प्याली में अलग निकाल कर रख लीजिये.\n\n• एक कप उबलते पानी  में, गैस धीमी करके, नमक और 2 छोटे चम्मच तेल डाल दीजिये, और अब चावल का आटा  डालकर मिला दीजिये, गैस बन्द कर दीजिये.\n\n• आटा  को  ढककर 5 मिनिट के लिये रख दीजिये ताकि चावल का आटा  नरम हो जायेगा \n\n• अब आटा को  किसी डोगे में डालकर मसल मसल कर , एकदम नरम चापात्ती जैसा आटा  होने तक गूथिये. नरम थे आटा  को  15-20 मिनिट के लिये ढककर रख दीजिये.\n\n•जब तक आटा  सैट होता है तब तक पिठ्ठा में भरने के लिये सब्जी  (फिलिंग ) बना लेते हैं. सब्जी  बनाने के लिये कढाई गैस पर  रख कर गरम कीजिये.\n\n•तेल डाल दीजिये और तेल गरम होने के बाद, हींग जीरा डाल दीजिये, जीरा भूनने के बाद हल्दी पाउडर, हरी मिर्च,अदरक डालिये और मसाले को  थोडा सा भूनिये, धनियां पाउडर डालकर मिलाइये और अब उबलते हुए  आलू  गाजर,मटर के दाने और नमक, लाल मिर्च डाल दीजिये, सारी चीज  को  मिलाते हुये.\n\n•सब्जी  को  2 मिनिट निये, 2-3 चमचा पानी  अतिरिक्त ,सब्जी को  ढककर आग  एर पकने दीजिये. सब्जी को  5 मिनिट बाद खोलकर चैक कर लीजिये.\n\n•सब्जी को  चमचे से चलाइये और देय लीजिये कि सब्जी में पर्याप्त यानी है सटजी को  ढककर धीमी जाग एर, नरम होने तक पका  लीजिये.\n\n•सब्जी  में गरम मसाला, अमचूर  पाउडर और हरा धनियां डालकर मिला दीजिये, पिठ्ठा  भरने के लिये सटजी (फिलिंग) तैयार हे.\n\n•सब्जी  को  प्याले में निकाल लेते है और थोडा ठंडा होने के बाद पिंद्वा बनाना शरू करतै हैं. चावल का आटा  फैला  कर\n\n•हाथ पर  थोडा सा तेल लगाकर फैला  को  थोडा और मसल कर नरम कर लेते हैं.पिठ्ठा उठाने के लिये स्टीमर के नीचे के बर्तन में 2 कप पानी  भर कर गरम होने रख दीजिये.\n\n•आटे  को  10-11 भागों में बांट कर गोल लोइया बना कर तैयार कर लीजिये, एक लोई हाथ में उठाकर, दोनों हाथ  को सहायता से बडा कर कटोरी को तरह बना\n\n•पिठ्ठा के लिये तैयार की  गई कटोरी में , 11/2 चम्मच सब्जी  रखिये और फिलिंग को  अच्छी  तरह बन्द कर दीजिये.\n\n•पिठ्ठा को  बन्द करते समये ये ध्यान रहे कि वह फटना नहीं चाहिये, पिठ्ठा को  गोल करके थाली में लगाकर रख लीजिये,सारे पिठ्ठा इसी तरह भर कर तैयार कर लीजिये.\n\n• स्टीमर में भरे पानी  में उबाल आने के बाद  जाली  के बर्तन लगाकर पिठ्ठा उठाने के लिये सारा सारा थोड़ी समय बाद   लगा\n\n•पिठ्ठा वाले बर्तन को  पानी  के बर्तन के ऊपर रख दीजिये ढककर पिठ्ठा को  12 - 14 मिनिट तक पकने दीजिये, और चैक कीजिये, पिठ्ठा पकने उसका कलर पहले की मुकाबले बदल जाते है \n\n चाचल के आटे  का नमकीन पिठ्ठा तैयार है. पिंठ्ठा को प्लेट में निकालिये,हरे धनिये को चटनी, टमाटर को चटनी या टोमेटो सॉस   के साथ परोसिये और खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b9);
                       txt = ("• छेना  250 गाम\n•चीनी - 400 गाम (2 कप )\n•दूध - 1 लीटर\n•केसर - 15-20 टुकडे (यदि आप  चाहें)\n• काजू - 15-30(छोटे छोटे टुकडे काट लीजिये)\n•चिरोंजी - 1 टेबल ट्यून (साफ कर लीजिये)\n•छोटीं इलाइची - 3-4(छील कर क्रूट लीजिये)");
                        txt2 = ("•छेना को  किसी थाली में डालिये और हाथ से मथ मथ कर  नरम कर लीजिये, इस तरह छेना का बहुत ही नरम गुथा हुआ आटा  जैसा बन जाता हैं. यह छेना रसमलाई बनाने के लिये तैयार हैं.\n\n•इस छेना से थोडा सा छेना निकलिये, गोल और चपटा करके प्लेट में रखिये. सारे गोले इसी तरह बनाकर प्लेट में रख लीजिये. 250 गाम छेना से 12 - 14 गोले बन जायेंगे .\n\n•चाशनी बनाइये :\n\n•किंसी बर्तन में 350 ग्राम चीनी और 3 कप यानी लेकर मिलाइये और गैस एर रख दीजिये. गैस तेज रखें ताकि यानी में जल्दी उबलने लगे.\n\n•जब पानी  उबलने लगे, चीनी पानी  में पूरी तरह धुल जाय तो छेना से बने सारे गोले इस उबलते पानी  में डालिये और 18- 20 मिनिट तक पकने दीजिये.\n\n•पानी में उबाल हमेशा आता  रहे, तेज गैस एर ही रसमलाई बनायेंगे, गोले उबल कर करीब आकार  में दुगुने हो जाते है .रसमलाई के लिये छेना के गोले पक कर तैयार हो गये हैं,इम्हें ठंडा होने के लिये रख दीजिये.\n\n• अब हम रस मलाई के लिये दूध तैयार करते है \n\n•दूध को  गाढा करने के लिये गैस एर रख दीजिये. उबाल आने  एर थोडी सी  देर में चमचे से चलाते  रहिये, दूध में केसर के टुकंड़े ओर मेवे डाल दीजिये.\n\n•जब दूध की मात्रा  आधा  या 40- 5 0 प्रतिशत के करीब हो जाय, बन्द कर दीजिये, दूध में चीनी और इलाइची मिला दीजिये. रसमलाई के लिये दूध तैयार हैं.\n\n•सुझाव: रसमलाई के लिये दूध तैयार कर रहे हैं, उसमें मेवा अपनी पसन्द के अनुसार कम ज्यादा और जो आपको पसन्द हो वह डाल सकते हैं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b10);
                       txt = ("•दूध  1 लीटर\n• नीबू का रस या सिरका - 2 -3 छोटी चम्मच या एक नीबू का रस");
                        txt2 = ("•पनीर  बनाने के लिये हमेशा फुल बीम दूध का ही प्रयोग करें. दूध को  किसी भारी तले वाले बर्तन में निकाल कर गरम कीजिये और इसे चलाते रहिये ताकि दूध तले से लग न जाये और इसमें थक्के  भी न पडें.\n\n•जच दूध में उबाल आ आ  जाय तो गैस बन्द कर दीजिये, इसमें नीब्रू नीचोड़ कर रस या सिरका डालते हुये चमचे से चलाइ .\n\n•दूध में यानी अलग और पनीर  अलग दिखाई  देने लगेगा.दूध में पनीर  और पानी  अलग दिरद्वाई देने लगे तब इसे मलमल सूती कपड़े में छानिये और इसमें थोडा ठंडा पानी  मिला दीजिये ताकि पनीर  एकदम मुलायम बने और नीब्रू का टेस्ट भी पनीर  में न रहे.\n\n•कपड़े को  हाथ से दबा दबा कर अतिरिक्त पानी निकाल दीजिये. पनीर  या छेना तैयार हैं.\n\n• यदिं आप इस पनीर का प्रयोग मिठाई के बजाय सब्जियां बनाने के लिये करना चाहें तो पनीर को  कपडे से निकालने के बजाय कपडे सहित किसी भारी वजनदार चीज से दबा कर 10 मिनिट के लिये रख दीजिये.\n\n• पनीर  और सख्त हो जायेगा. पनीर  कपडे से निकाल लीजिये, पनीर  तैयार हैं.\n\n•घर में बना पनीर  बाजार के पनीर  को अपेक्षा मुलायम और अधिक स्वादिष्ट होता हैं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b11);
                       txt = ("•दूध -1.5 लीटर (7 कप )\n•निम्बू  का रस या सिरका -२ टेबल स्पून\n•अखरोट -२ छोटी चम्मच\n•चीनी -800 ग्राम (4 कप)");
                        txt2 = ("•रसगुल्ला  बनाने के लिये मुख्य सामग्री छेना हैं, जिसे हम ताजा छेना कह कर डेयरी से ला सकते हैं या दूध से हम इसे घर एर बना सकते हैं.\n\n•यदि हमको छेना घर पर  बनाना हैं तो सबसे पहले  हम रसगुल्ले बनाने के लिये छेना बनायेगे.\n\n• छेना बनाने के लिये दूध को  किसी भारी तले वाले बर्तन में निकाल कर गरम कीजिये. दूध में उबाल आने के बाद, दूध को  गैस से उतार लीजिये,\n\n•दूध को  हल्कऱ सा ठंडा होने दीजिये, दूध को  ठंडा करने के लिये दूध में 1 कप पानी  भी डाल दे . दूध में थोडा थोडा नीबू का रस डालते  हुये चमचे से चलाइये, दूध जब पूरा फट जाय, दूध में छेना और पानी  अलग दिखाई देने लगे तो नीबू का रस डालना बन्द कर दीजिये.\n\n•छेना को  कपडे में छानिये और ऊपर से ठंडा पानी  डाल दीजिये ताकि साबू का स्वाद छेना में न रहे. कपडे को  चारों और से उठाकर हाथ से दबा कर अतिरिक्त पानी निकाल दीजिये. रसगुल्ला  बनाने के लिये छेना तैयार हैं.\n\n•छेना को  किसी थाली में निकाल लीजिये और 4-5 मिनिट छेना को  मसल मसल कर चिकना कर लीजिये, अब छेना में अरारोट  मिला कर फिर से छेना को  4- 5 मिनिट अच्छी  तरह मल मल कर चिकना करना  हैं.\n\n• छेना को  इतना गुंदिये कि वह चिकना गुंथे हुये आटे  को तरह दिखाई  देने लगे, रसोगुल्ला  बनाने के लिये छेना तैयार\n\n•छेने से थोडा थोडा छेना निकाल कर , एक इंच व्यास के छोटे छोटे गौल बना कर प्लेट में रख लीजिये. सारे रसगुल्ले के लिये गोले इसी तरह बना लीजिये और किसी गीले कपडे से ढक कर रख दीजिये.\n\n•चाशनी बनाइये :\n\n• चीनी और 2 कप पानी  किसी चौडे बर्तन में डाल कर गरम कीजिये, चाशनी में उबाल आने  के बाद, छेने से बने गोले चाशनी में डाल दीजिये. बर्तन को  ढक दीजिये, और छेना के गोलों  को  चैक करने हेतु  20 मिनिट तक तेज आंच  एर उबलने दीजिये.\n\n• 8-10 मिनिट बाद चाशनी गाढी होने लगती हैं, चाशनी में 1-1 चमचा करके पानी  डालिये, ध्यान रहे कि चाशनी में हमेशा  उबाल  आतां रहे…\n\n•रसगुल्ला पकते समय 1 - 2 कप तक पानी  डाल सकते हैं.रसगुल्ले फूल कर लगभग गने हो जाते हैं, रसगुल्ला पकने के बाद गैस बन्द कर दीजिदु. रसगुल्ले चीनी के पानी  में ही ठन्डे  होने दीजिये.\n\n•लीजिंये छेना के रसगुल्ले तैयार हैं, रसगुल्ले अभी खाये जा सकते हैं, लेकिन 10-12 घंटे बाद रसगुल्ले अच्छे मीठे और बहुत ही स्वादिष्ट हो जायेगे\n\n•इम्हें ठंडा होने के बाद, फ्रिज में रख दीजिये, रसगल्ले चाशनी में डूबे रहने दें, चाशनी में डूबे रसगुल्ले फ्रिज में रखकर 10-20 दिन तक खाये जा सकते हैं.ठन्डे रसोगुल्ला  षरीसिये और खाइये.\n\n• सावधानियां\n\n•छेना ताजा और फुल क्रीम  दूध से बनायें.\n\n• छेना से निचोड़ कर पानी  पूरी तरह निकाल दीजिये और वास कर लीजिये.\n\n• छेना को  इतना उबाल गुंदिये  कि छेना  आटे  तरह चिकना लगने लगे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b12);
                       txt = ("•सेम  300 गाम\n•आलू 1 मध्यम\n•हरी मटर (2 कप)\n•तेल 2 बडा चम्मच\n•जीरा 1 छोटा चम्मच\n•हींग 1 चुटकी पिसी\n•हल्दी ( छोटा चम्मच)\n•नमक 1 छोटा चम्मच\n•पिसी लाल मिर्च (2 छोटा चम्मच)\n•पिसा धनिया 1/2 छोटा चम्मच\n• अमचूर पाउडर 1/2 छोटा चम्मच\n•ज़रा सा गरम मसाला");
                        txt2 = ("•सेम के किनारे हटा कर , अगर इसमें कोई धागा हैं तो वो भी हटा दें. अब रोम की  फली को  अच्छे से धो लें और एक साफ कपडे से इसका पानी  पोंछ लें.\n\n• अब फली को  छोटे छोटे टुकडों में काट लें. आलू  को  छीलकर, धो लें और इसे लगभग आधा  इंच के में काट लें\n\n• कटी हुई सेम\n\n• एक कड़ाही में मध्यम आँच एर तेल गरम करें. अब इसमें जीरा डालें और 10 सेकेंड के लिए और फिर हींग डालें.आंच को धीमा करके  हल्दी डाले और  फिर सैम  और आलू के टुकड़े  डालें. सभी सामग्री को  अच्छे अच्छे से मिलाएँ और दो मिनट के लिए भूनें.. अब नमक, लाल मिर्च और धनिया पाउडर डालें, और फिर से सब्जी  को  एक मिनट के लिए भूनें.\n\n• सैम और  आलू को  ढक कर 8-10 मिनट के लिए गलने तक पकाए.\n\n•अब इसमें हरी मटर  डालें और  सभी सामग्री के अच्छे से गल जाने तक पकाए. इसमें तकरीबन  5-6 मिनट का समय लगता हैं .\n\n•जब सब्जी  गल जाए तो इसमें अमचूर पाउडर और जरा सा  गरम मसाला डालकर सब्जी को  दो मिनट के लिए भूने.\n\n• स्वादिष्ट और पौष्टिक सैम  मटर आलू  क्री सब्जी  अब तैयार हैं. इस सब्जी को  रोटी, पूरी, पराठा या फिर दाल चावल किसी के साथ भी सर्व कर सकते हैं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b13);
                       txt = ("•बासमती  राइस… 1 कप\n•मूंग दाल- 1 कप तेज पत्ता- 2\n•हरी इलायची… 2\n•लोंग- 2\n• दालचीनी- 1\n•सूखी लाल मिर्च… 1\n• प्याज- 1\n•अदरक- लहसुन पेस्ट… 2 चम्मच\n• टमाटर- 1\n•मटर- 1 /2 कप\n• गाजर- 1\n• आलू - 1\nहल्दी पाउडर… 1 चम्मच\n•नारियल- 1 /2 कप\n•चीनी- 1 कप\n•काजू- 1 चम्मच\n•क्रिशमिश- 1 चम्मच\n•नमक- स्वादअनुसार\n•गरम पानी… 4 कप\n•घी- 2 कप\n•मसाला पाउडर\n•सूखी लाल मिर्च… 2\n•हरी इलायची… 2\n•दाल चीनी- 2\n•जीरा- 1 /2 चम्मच\n•मेथी- 1 /2 चम्मच\n•सौंफ- 1 /2 चम्मच\n•राई- 1 /2 चम्मच\n•साब्रुत्त धनिया 1 चम्मच\n• हींग- चुटक्रीभर");
                        txt2 = ("•मूंग दाल को एक पैन में मध्यम आंच एर 5 मिनट के लिये भुने । फिर इसे ठंडा होने दें ।\n\n•चावल  को धोकर किनारे रखें ।\n\n•मसाला पाउडर बनाने के लिये सभी सूखे मसालों को एक साथ पैन में भून लें ओर ठंडा करके  के मिक्सी में पीस लें ।\n\n•अब पैन  में 1 चम्मच घी गरम कर के काजू को  दो मिनट भून लें । किनारे रख दें ।\n\n• इसके बाद प्रेशर कुकर में घी गरम करें, उसमें तेज पत्ता ,दालचीनी, लौग, इलायची, सूखी लाल मिर्च और प्याज डाल कर फ्राई  करें ।\n\n• अब प्रेशर कुकर में अदरक-लहसुन पेस्ट डाल कर 2 मिनट तक फ्राई  करें \n\n• फिर मटर, गाजर,आलू -छील  कर फ्राई  करें, थोड़ी  देर बाद टमाटर डाल कर 5 मिनट पकाएं ।\n\n•जब सारी सब्जियां भून जाएं तब गरम पानी  डाल कर फ्राई  करें। कुकर का ढचकन बंद करें और आंच को  धीमा कर ले  ।\n\n•तीन सीटी आने  तक पकाएं । एक बार हो जाने के बाद आंच बंद कर दें ।\n\n•आपकी बंगाली  खिचडी तैयार हैं ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b14);
                       txt = ("•250 गाम बासमती चावल\n• 2 मध्यम आकार  के आलू\n•100 गाम मूंग की  दाल\n• एक फूल गोभी (छोटे साइज में)\n• 100 गाम मटर के दाने\n•खिंचडी के लिए मसाला:\n• 1 टुकडा अदरक\n• 2 हरी मिर्च\n• आधा  चम्मच हल्दी\n• थोड़ी सी शक्कर \n•2 खडी लाल मिर्च\n•आधा चम्मच जीरा\n•चुटकी भर हींग \n• 1 टुकडा दालचीनी\n• 2-3 तेज पत्ते\n•3 लौग\n•2 छोटी इलायची\n• 1 बडा चम्मच देसी घी\n• नमक स्वादानुसार\n• 1 चम्मच, बारीक हरा धनिया");
                        txt2 = ("•सबसे पहले  चावल को अच्छी तरह धो लें.\n\n• अब आलू को  छीलकर लंबे टुकड़ो में काट लें और फूल गोभी को भी बड़े-बड़े टुकडों ' काट कर रख लें.\n\n• अदरक को कदूकस कर लें और हरी मिर्च काटकर रख लें.\n\n•अब एक कड़ाही को गैस एर गर्म करें और इसमें मूंग की  दाल को  धीमी आंच  एर गुलाबी होने तक भून लें.\n\n• अब इसमें जीरा , चावल, खडी लाल मिर्च, जीरा एवं हींग को  छोड़कर बाकी सारी सामग्री मिलकर आधा  लीटर गरम यानी में धीमी आंच  एर ढककर पका  लें. (पानी अपनी जरूरत के अनुसार कम-ज्यादा कर सकते हैं)\n\n•बीच-बीच में इसे चलाती रहें.\n\n• जब दाल और चावल गल जाएं तो गैस बंद कर दें.\n\n•खिचडी सर्व करने से पहले  एक अलग बर्तन में घी गर्म करके खडी लाल मिर्च, जीरा और हींग गर्म करें.\n\n• इसी छोक  को  खिचडी में ऊपर से डाल दें और इसे अच्छी तरह मिला दें.\n\n•हरा धनिया डालकर इस चटपटी खिचडी को  टमाटर धनिए की  चटनी और पापड़ के साथ सर्व करें.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.b15);
                       txt = ("• आलू  दम के लिये सामग्री- \n•आलू- 12 उबले और छिले हुए\n•प्याज- 2 पेस्ट\n•लहसुन की  कलियां… 8 पेस्ट\n•अदरक- 1 इंच पेस्ट\n•टमाटर- 2 प्यूरी\n•हरी मिर्च… 3\n•जीरा- 1/2 चम्मच\n•तेज पत्ता- 1\n• लाल मिर्च पावडर… 1 चम्मच\n•हल्दी- 1/2 चम्मच\n• धनिया पाउडर … 1 चम्मच\n•जीरा पाउडर - 1 चम्मच में\n•गरम मसाला पेस्ट… 2 चम्मच\n•घी- 1 चम्मच\n•सरसों का तेल…\n• 2 चम्मच शक्कर - 1/2 चम्मच\n•नमक- स्वादअनुसार\n•लुची बनाने के लिये सामग्री- -मैदा- 2 कप\n•पानी- 2/3 कप\n•घी- य2 चम्मच\n•नमक- 1 चुटकी\n•तेल- 3 कप");
                        txt2 = ("•एक गहरे पैन में तेल गरम करें, फिर उसमें तेज पत्ता , जीरा और हरी मिर्च डालें ।\n\n• फिर थोड़ी सी शक्कर  डाल कर 30 सेकेंड तक चलाएं ।इसके बाद इसमें प्याज, अदरक और लहसुन पेस्ट डाल कर 2-3 मिनट भूरा होने तक पकाएं ।\n\n• उसके बाद इसमें टमाटर को प्यूरी, नमक, लाल मिर्च पावडर, हल्दी, धनिया पावउर और जीरा पावडर ऊपर से डालें ।\n\n•इसे तब तक पकाएं जब तक कि तेल मसाले से अलग ना होना शुरु हो जाए ।\n\n• फिर उसमें उबले आलू  डाल कर चलाएं । उसके बाद  इसमें साधा कप पानी  डाले और 5 मिनट तक पकने दे  ।\n\n• आंच को  धीमा कर दें और ऊपर से घी और गरम मसाला  डाल कर आंच  को  बंद कर में और पैन  को  उतार लें ।\n\n•लुची बनाने को विधि-\n\n•लुची बनाने को सभी सामग्रियों को  एक साथ मिला लें और आटा  गूथ लें ।\n\n• उसके बाद इसमें टमाटर को प्यूरी, नमक, लाल मिर्च पावडर, हल्दी, धनिया पावउर और जीरा पावडर ऊपर से डालें ।\n\n•इसे तब तक पकाएं जब तक कि तेल मसाले से अलग ना होना शुरु हो जाए ।\n\n• फिर उसमें उबले आलू   डाल कर चलाएं । उसके बाद  इसमें आधा कप  पानी  डाले और 5 मिनट तक पकने दे \n\n• आंच को  धीमा कर दें और ऊपर से घी और गरम मसाला  डाल कर आंच को  बंद कर और यैन को  उतार लें ।\n\n•लुची बनाने को विधि-\n\n•लुची बनाने को सभी सामग्रियों को  एक साथ मिला लें और आटा  गूथ लें ।\n\n•उसके बाद आटा पर गीला कपड़ा डालें और 30 मिनट तक आटे  को  ऐसे ही रख दें ।\n\n•अब एक पैन   में तेल गरम करें, उसमें लूची बेल कर डालें और भूरा होने तक पकाएं ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                }
                break;
            }

            case "Biryani Receipes": {
                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw1);
                       txt = ("•बासमती चावल - 200 गाम या 2 छोटो कटोरी\n•निम्बू -1\n• देसी  घी या रिफाइन्ड तेल -एक बड़ी  चम्मच\n•जीरा- एक छोटो चम्मच\n•लोंग- 3-4 टुकडों में तोड़ ले\n•बड़ी  इलाइची - 1 -2 छील कर दाने निकाल लें\n•हरी मिर्च - 1 ( बारीक कतरी हुई)\n•-फ्रेन्च बीन्स - 50 गाम या 15-16\n•शिंमला मिर्च… 2 बारीक कटी  हुई\n•पत्ता गोभी - 50 गाम बारीक कटा छील हुआ\n•हरी ताजे मटर-एक कटोरी होने हुये\n•हरा धनियाँ- आधी कटोरी बारीक काटा हुआ\n•नमक- स्वादानुसार");
                        txt2 = ("•चावलों को अच्छी  तरह धोकर आधा घन्टे के लिये पानी में भिगो दे\n\n•यदिं माइक्रोवेव में बनाना हैं तो\n\n•माइक्रोवेव में रखने वाले बाउल में भीगे हुये चावल डाल दें और उसमें चावलों से दुगना पानी  मिला दें, और नीबू का रस और नमक मिला दें, जब चावलों क्रो ढक कर माइक्रोवेव में 12 मिनिट तक पकायें. चावल को आप देख कर जान लेगें कि चावल पक गये हैं. माइक्रोवेव से बाहर निकाल लीजिये,और दक्खन खोल दीजिये .\n\n•गैस पर कढाई रखिये. घी डाल कर गरम कीजिये, और अब  जीरा डालिये, जीरा ब्राउन होने के बाद लौग, इलाइची के दाने और हरी मिर्च डाल दीजिये, एक मिनिट भूनिये और जब सारी हरी सब्जी और नमक डाल दीजिये, 2-3 मिनिट तक कलछी  से वला कर भूनिये. जब 2-3 मिनिट के लिये सब्जियों को ढक दीजिये. दक्खन  हटाइये और देखिये कि सब्जिया  हल्की पक गयीं हैं. जब इन सब्जियों में चावल मिलाकर  2 मिनिट तक कलछी से चलाते हुये भुनिये .\n\n•यदि गैस पर  चावल बनाने है\n\n•तो कुकर में घी डाल कर गरम कीजिये, जब जीरा डाल दीजिये, जीरा भूनने के बाद लौग और इलाइची के दाने और हरी मिर्च डल कर 1 मिनिट भूनिये. जब सारी सब्जियँ डाल दीजिये. 2 मिनिट तक भूनिये, और जब चावल डाल कर 2 मिनिट तक फिर भूनिये. और चावल से दुगना पानी  डाल यदि गैस एर चावल बनाने है\n\n•तो कुकर में घी डाल कर गरम कीजिये, अब जीरा डाल दीजिये, जीरा भूनने के बाद लौग और इलाइची के दाने और हरी मिर्च  कर 1 मिनिट भूनिये. अब सारी सब्जियँ डाल दीजिये. 2 मिनिट तक भूनिये, और अब चावल डाल कर 2 मिनिट तक फिर भूनिये. और चावल से दुगना यानी डाल दीजिये अब नीबू का रस और नमक डाल दीजिये. कुकर बन्द कर दीजिये. जैसे ही कुकर में प्रेशर आए गैस बन्द कर दीजिये. 5 मिनिट बाद कुकर खोलिये .पुलाव तैयार हे.\n\n• पुलाव  को बाउल या बडे प्लेट में निकाल लीजिये. हरे धनिया  से सजाइये. अचार या हरी चटनी के साथ परोसिये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }

                    case 1: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw2);
                       txt = ("•बासमती  चावल … 1 कप ( 200 गाम) \n•घी… 2-3 बडे चम्मच\n•हरा धनिया- 2-3 बडे चम्मच (बारीक कटा हुदा)\n•हरी मिर्च… 2 लम्बाई में कटी हुई  हुई\n•अदरक… 1 इंच, लम्बे पतले टुकडों में कटा हुआ\n• अदरक पेस्ट … 1 छोटा चम्मच\n•किशमिश … 3 बडे चम्मच\n• काजू … 3 बडे चम्मच\n•बादाम … 3 बडे चम्मच\n•पिस्ते - 10-12\n•सौंफ पाउडर … 1 छोटी चम्मच\n•नमक … 1 छोटी चम्मच से थोडा ज्यादा या स्वादानुसार\n• अमीरी लाल मिर्च पाउडर … 1८८ छोटी चम्मच\n•जीरा … 1४2 छोटी चम्मच\n•बड़ी इलाइची 2\n•दालचीनी … 1 इंच\n•लौग … 4\n•काली मिर्च - 8-10\n•तेज पत्ता … 2");
                        txt2 = ("•चावलों को अच्छी  तरह धोकर आधा  घन्टे के लिये पानी  में भिगो दीजिए और बाद में अतिरिक्त पानी  निकल कर हटा\n\n•एक बादाम से 6-7 टुकडे के हिसाब से लम्बाई में काट लीजिए और एक काजू  को 3-4 टुकडों के हिसाब से काट लीजिए, पिस्ते को लम्बाई में बारीक काट कर तैयार कर लीजिए, किशमिश के डंठल  तोड लें और साफ कपडे से पोंछ लीजिए. घी गरम होने एर, जीरा डालिये, भूनिये, जीरा भूनने के बाद, साबुत मसाला, और तेज पत्ता डाल कर हल्का सा भून लीजिए अब इसमें कटा हुआ  अदरक और अदरक का घेस्ट,हरी मिर्च और ड्राई क्रूट डालकर भून लीजिए. सभी  चीज  के भून जाने और अच्छे  सी महक उठने एर इसमें सौंफ पाउडर, चावल, नमक और लाल मिर्च पाउडर डाल कर 2मिनिट अच्छे से मिक्स करते हुए भून लीजिए.\n\n• अब चावलों में 2 कप पानी  डाल कर मिक्स कर दीजिए और ढककर इन्हें 5 मिनिट के लिए धीमी आंच  एर पकने दीजिए और चैक क्रीजिए और अच्छी  तरह चला दीजिये,फिर से 5 मिनिट के लिए पकने दीजिए और अच्छी  तरह चला दीजिये, फिर से ढककर,\n\n• 3 मिनिट पकने दीजिये और चावल को चैक कीजिये, चावल पक कर तैयार हैं, गैस बन्द कर दीजिये और चावल को 10-15 मिनिट के लिए ढके रहने दीजिए और उसके बाद पुलाव को प्याले या प्लेट में निकाल लीजिये. हरे धनिये और ड्राई क्रूट से सजाइये और परोसिये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw3);
                       txt = ("•बासमती  चावल - 1 कप\n•ह्ररे चने - 1 कप\n• गाजर - 1 छोटे टुकडों में कटी हुई\n•हरा धनिया - 2-3 बडे चम्मच( बारीक कटा हुआ )\n•तेल - 3-4 बडे चम्मच\n• नींबू - 1\n•हरी मिर्च - 2 (लम्बाई में कटी  हुई)\n•अदरक - 1 इंच (पतला लम्बा कटा हुआ )\n•बड़ी  इलायची - 2\n• दाल चीनी - 1 इंच\n• लौग - 3-4\n•काली मिर्च - 8-10\n•जीरा - 1/2 छोटी चम्मच\n•नमक - 1.5 छोटा चम्मच या स्वादानुसार");
                        txt2 = ("•चावलों को अच्छी  तरह धोकर आधे घंटे के लिए पानी मे भिगो दीजिए. पेन में तेल डालकर गरम कीजिये, गरम तेल में हरे चने और गाजर को डाल कर होने दे और 2-3मिनिट धीमी आंच एर ढककर क्रिस्पी होने तक पका  लीजिए और अलग प्याले में निकल लीजिये.\n\n•बचे हुये तेल में जीरा डालिये, जीरा भून जाने एर तेल में बड़ी  इलायची के दाने, छोटे टुकडों में को दालचीनी, काली मिर्च और लौग डालकर हल्का सा भून लीजिए, हरी मिर्च और अदरक डालिये और हल्का सा भून लीजिए, अब भीगे हुये चावल डाल दीजिए, नमक डालकर 2 मिनिट तक चलाते हुए भूनिये, सारे मसालों को कोटिंग चावलों के ऊपर अन्टछी तरह आ  जाय. 2 कप पानी  डाल दीजिए और मिक्स कर दीजिए. पुलाव  को 5 मिनिट के लिए ढककर धीमी आंच एर पकने दीजिये \n\n•दक्खन खोलिये और भूने हरे चने और गाजर डाल दीजिए, नींबू का रस और थोड़ा सा कटा हुआ हरा धनिया भी डालकर मिला लीजिए, चावलों को फिर से ढककर धीमी आंच  एर ही पकने दीजिये. चावलों को हर पांच मिनिट बाद चैक कीजिये और अच्छी  तरह चला दीजिये, चावलों को पकने में लगभग 15 मिनिट का समय लग जाते हे.\n\n•गैस बंद कर दीजिए और चावलों को ढके रहने दीजिए. 10- 15 मिनट बाद छोलिया चावल पुलाव तैयार है हरे चने के लाव को दही, चटनी, दाल या सटजी किसी के भी साथ परोसिये  और खाइये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw4);
                       txt = ("•बासमती  चावल - 1 कप (200 गाम)\n• पनीर- 200 गाम\n•मटर के दाने-, 1/2 कप\n•घी- 2- 3 बडे चम्मच\n•हरा धनिया - 2-3 बडे चम्मच (बारीक कटा हुआ)\n•अदरक पेस्ट - 1 छोटा चम्मच\n•नमक - 1 छोटी चम्मच से थोडा ज्यादा या स्वादानुसार\n•जीरा - 1/2 छोटी चम्मच\n•बड़ी इलाइची 2\n•दालचीनी- 1-2 इंच\n• लोग 3-4\n•काली मिर्च - 8-10\n•नींबू … 1");
                        txt2 = ("•चावलों  को धोकर, आधे घंटे के लिए भिगोने के लिए रख दीजिए. चावलों को माइक्रोवेव में, कुकर में या एसे ही किसी बर्तन में एका कर तैयार कर लीजिए.\n\n•पनीर को 1/2 इंच के चौकोर टुकडों में काट लीजिए. पैन  में घी डाल कर गरम कर  दीजिये , घी के हल्कऱ गरम होने एर पनीर  के टुकडे पैन सेक  में सिलने के लिये लगा दीजिये और दोनों और पलट-पलट कर हल्के ब्राउन होने तक स्नेक कर निकाल लीजिये. लौग, काली मिर्च, इलाइची के दानों और दाल चीनी को क्रूटकर दरदरा कर लीजिये.\n\n• पैन  में बचे घी में जीरा और कुटा हुआ  मसाला डाल दीजिए और हल्कऱ सा भून लीजिए, जब अदरक का पेस्ट डालकर थोडा सा भूनिये. मटर के दाने डाल दीजिए, सभी चिजॉ को 1 मिनिट के लिए चमचे से चलाते हुये भून लीजिए और उसके बाद 1-2 मिनिट के लिए ढककर इसे पका  लीजिए.\n\n•भुने हुए मटर, मसाले में उबले हुए चावल, तले हुए पनीर  के टुकडे और नमक डाल कर इसे अच्छे से मिक्स कर दीजिए का रस भी डाल दीजिए और फिर से एक बार मिला,गैस को बंद कर दीजिए और पुलाव को किसी प्लेट में निकाल लीजिए, हरे धनिये को पत्तियों से गार्निश कर दीजिए पनीर  पुलाव बनकर तैयार हैं.\n\n•गरमा गरम एमीर पुलाव को, दही, चटनी या अचार के साथ परोसिये और खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw5);
                       txt = ("•बासमती चावल - 1 कप (पके हुए)\n•मैक्रोनी  - 1 कप पकी  हुई)\n• टमाटर - 2 (बारीक कटे  हुए)\n•शिंमला मिर्च - 1 (बारीक कटे  हुई)\n•हरी मटर - 1 /2 कप\n•काजू - 20-25\n•हरा धनिया - 2-3 टेबल म्पून (बारीक कटा हुआ )\n•तेल या घी - 3-4 टेबल स्पून \n• अदरक- 1 इंच ( पतला बारीक कटा हुआ )\n•साब्रुत्त गरम मसाले बड़ी  इलायची- 1, लोंग 4 काली मिर्च… 10-11, दालचीनी-,1/2 इंच टुकडा\n•जीरा- 1/2 छोटी चम्मच\n• नमक 1.5 छोटी चम्मच या स्वादानुसार\n• लाल मिर्च पाउडर - 1/4 छोटी चम्मच से कम\n•पिज़्ज़ा सॉस  - 2 टेबल म्पून");
                        txt2 = ("•पैन में तेल डालकर गरम कर लीजिये, तेल गरम होने एर इसमें जीरा डाल दीजिए. गैस धीमी कर दें. जीरा भून जाने एर इसमें पतला कटा हुआ अदरक, बड़ी  इलाइची को छील कर , उसके दाने, साबुत मसाले डाल दीजिए. इन्हें हल्का सा भून लेने के बाद, हरी मटर डाल दीजिये  और ढककर 1 से डेढ़ मिनिट तक भून लीजिए.\n\n• पैन को खोलिये , कटी हुई   शिमला मिर्च डाल दीजिए और इसे भी एक से डेढ़ मिनिट तक के लिए चलाते हुए भून लीजिए. सब्जियों के क्रंची हो जाने पर कटे हुए  डाल दीजिए और ढककर 2 मिनिट के लिए पकने दीजिये \n\n•  सब्जियों के पक जाने के बाद इसमें पिज़्ज़ा सॉस , लाल मिर्च पाउडर, नमक, कटे   हुए काजू के टुकडे और पका  कर रखी हुई मैकरोनी डाल कर अच्छे से मिक्स कर लीजिए.\n\n• अब पका  कर रखे हुए चावल भी कलछी से अलग अलग करते हुये डाल दीजिए और सभी पिज़्ज़ा  को अच्छे से मिक्स कर लीजिए. गरमा गरम मेकरोनी राइस पुलाव बनकर तैयार हैं. इसे किसी प्लेट में निकाल लीजिए और हरे धनिये से गार्निश क्रीजिए. बहुत ही स्वादिष्ट मेकरोनी राइस पुलाव बना हैं, परोसिये और खाइये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw6);
                       txt = ("•बासमती चावल - 200 गाम (एक कप)\n• काबुली  चना - 100 गाम या (1/2 कप 6 घंटे पानी में भीगे\n•जीरा - 1 /2 छोटी चम्मच\n•काली मिर्च - 10-12\n• लोंग - 4\n•दाल चीनी - एक इंच का टुकडा\n•बड़ी  इलाइची - 2-3\n•घी - 2-4 टेबल ट्यून\n• हल्दी पाउडर - 1 /4 छोटी चम्मच से कम\n• अदरक - 1 इंच का लम्बा टुकडा (कदूकस कर लीजिये)\n•हरी मिर्च - 1-2 (यदि जाए चाहें)\n•नमक - एक छोटी चम्मच ( स्वादानुसार)\n•नीबू - 1\n•हरा धनियां - एक टेबल स्पून  (बारीक कतरा  हुदा)");
                        txt2 = ("•चावल को साफ कीजिये और आधा  घंटे के लिये पानी  में भिगो दीजिये. काबुली चना रात भर  पानी में मिगीये \n\n•काली मिर्च, लोंग, दाल चीनी और बहीं इलाइची को दरादरा क्रूट लीजिये. अदरक को छीलिये और कदूकस  कर लीजिये . हरी मिर्च धोइये, डंठल तोड़कर, बारीक काट\n\n• क्रुकर में घी डालकर गरम कीजिये, गरम घी में जीरा डालकर कड़कने  दीजिये, कुटे मसाले डालिये, हल्कऱ सा भूनिये, अदरक, हरी मिर्च, हल्दी पाउडर, चावल और काबुली  वने डाल कर 2-3 मिनिट तक चमचे से चलावे हुये\n\n•चावल मे  दुगना पानी , नमक और नीबू डाल कऱ रस  मिलाइये. कुकर का ढवकन लगाकर एक सीटी आने तक पका  लीजिये. कुकर आधा  प्रेशर निकाल दीजिये, अब कुकर खोलिये चीनी का पुलाव को पकने दे\n\n•क्रुकर खोलिये काबुली चने का पुलाव बन चुका है पुलाव हरा धनियां डालकर मिला दीजिये.\n\n•काब्रुली चने  का पुलाव माइक्रोवेव में -\n\n• पुलाव बनाने की  तैयारी उपरोक्त तरीके से कर लेवे हैं.कढाई में घी डालकर गरम कीजिये, गरम घी में जीरा डालकर तड़कने  दीजिये, कुटे मसाले डालिये, हल्कऱ सा भूनिये, अदरक, हरी मिर्च, हल्दी पाउडर चावल और काबुली वने डाल कर 2-3 मिनिट तक चमचे से चलाते  हुये भूनिये.\n\n•भूने मसाले मिले चावल माइक्रोवेव में पकने  वाले प्याले में निकालिये, चावल से दुगना पानी , नमक और नीबू का रस डालकर मिलाये , प्याले का ढवकन लगाइये और माइक्रोवेव मे रखिये . 12 मिनिट के लिये माइक्रोवेव को सैट कर\n\n•माइक्रोवेव में चावल का पुलाव बन चुका हे.माइक्रोवेव से निकालिये 5 मिनिट ठंडा होने दीजिये  खिला काबुली चना पुलाव तैयार हे. पुलाव के ऊपर हरा धनियां डालकर सजाइये और गरमा गरम काबुली चना पुलाव परोसिये और खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 6: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw7);
                       txt = ("•2 कप चावल \n•-1/2 कप उबली हुई हरी मटर \1 चम्मच अदरक पेस्ट \n• 3-4 कटी हुई  हरी मिर्च\n•-1/2 कप टुकडी में पनीर  या टोफू\n• 1-2 तेज पत्ता\n• 2 चम्मच काजू\n• 2 चम्मच क्रिशकिश\n• 1 चम्मच जीरा\n•1 -2 दाल चीनी\n•3 लहसुन\n• 5-6 इलायची\n• 2 चुटकी केसर\n• 6 चम्मच  घी\n• 1 चम्मच   हरी धनिया\n•नमक");
                        txt2 = ("•सूखे चावल को साफ पानी से धो लें, उसके बाद इसे बडे बर्तन में पका कर इसका यानी निकल कर एक किनारे ठंडा होने के लिये रख दें । एक पेन लें, उसमें 1 चम्मच  घी गरम कर के काजू और किशमिश को 1 मिनट तक के लिये मध्यम आंच पर  फ्राई कर लें और किनारे रख दें । अब बचे हुए पेन घी डाल कर गरम करें और फिर उसमें तेज पत्ता , लहसुन, को हरी मिर्च, इलायची और जीरा डालें।\n\n• अगर आप  इसमें प्याज और अदरक को अभी डालना चाहती हैं तो डाल सकती हैं । जब यह सभी सामग्रियां अच्छे  से पक जाएं तब उसमें पनीर या टोफू, चावल और हरी मिर्च को डालें। इसको अच्छे से चलाएं जिससे चावल में घी अच्छी  तरह से पक जाए ।\n\n• इसके बाद स्वाद अनुसार नमक डालें। घी मिलने की वजह से चावल चमकदार हो जाना चाहिये और अगर ऐसा नहीं होता है तो और घी डाल सकती हैं\n\n• अब अलग से एक गरम पानी की  कटोरी में केसर भिगो दीजिये और जब वह लाल रंग का हो जाए तब उसे चावल के साथ मिला दीजिये।\n\n•दो मिनट तक चावल को पकाइये  और फिर गैस की  आंच को बंद कर दीजिये। अब पुलाव को काजू किशमिश और कटी  हुई धनिया को छिड़क कर परोसिये ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw8);
                       txt = ("•2 कप पुलाव के चावल\n• 1 कप ताजी मेथी\n• 1/2 कप मटर के दाने\n• 2 प्याज (लम्बाई में कटे  हुए)\n• 1 बडा चम्मच अदरक लहसुन का पेस्ट\n• 2 हरी मिर्च लम्बाई में कटे  हुए\n• 1 1/2 बडा चम्मच घी या तेल\n•2 हरी इलाइची\n• 4 लौग\n• 1 इंच का दालचीनी का टुकडा\n• 2-3 तेज पत्ते\n•-1/2 छोटा चम्मच जीरा\n• 2 बडे चम्मच हरी धनिया\n•4कप पानी");
                        txt2 = ("•मेथी  को पानी  से धोकर साफ करके निकल दे.फिर 1/2 चम्मच नमक डाल के 1 0-3 5 मिनट ढक के रख दे फिर हाती से दबा दबा के सारा यानी निचोड़ दे.चाचल को धोकर यानी मेंआधे घंटे के लिए भिगो दे.\n\n• एक गहरे बर्तन में घी या तेल डाल के गरम गो, जीरा, लोंड इलाइची, लौग, दालचीनी डाल के सारा देर भूने.\n\n• प्याज डाल के सुनहरा होने तक भूने. हरी मिर्च डाल दे.\n\n• अदरक लहसुन का पेस्ट डाल के 1 मिनट तक भुने.\n\n•हरी धनिया और मेथी डाल के 2 मिनट तक भूने.\n\n•हरी मटर और चावल डाल के 3-4 मिनट तक भूने.\n\n•पानी और नमक डाल के उबलने दे. धीमी आंच एर चावल के पकने तक पकाए.\n\n•गैस बंद  कर दे गरम गरम पुलाव हरी चटनी और रायते के साथ परोसे.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw9);
                       txt = ("•कप बासमती चावल\n• प्याज पतले और लम्बे स्लाइसेस  में कटे  हुए\n•हरी इलाइची \n•2-3 लौग\n• 6-8 काली मिर्च\n• 1/4 चम्मच हल्दी\n•2 इंच का टुकडा दाल चीनी\n• 1 हरी मिर्च लम्बाई में कटी  हुई\n•1 बडा चम्मच घी या तेल\n•कप  गरम यानी\n• स्वादानुसार नमक");
                        txt2 = ("•चावल को धोकर आधे घंटे के लिए भिगो दे.\n\n•एक गहरे बर्तन में तेल या घी डाल के गरम गो, जीरा और सारे खडे मसाले डाल के भूने.\n\n• फिर प्याज डाल के सुनहरा होने तक भूने.\n\n• हल्दी और चावल डाल के कुछ देर भूने.हल्दी और चावल डाल के कुछ देर भूने.\n\n• फिर गरम पानी  और नमक डाल के धीमी आंच पर  चावल पकने तक पकाए.\n\n•नीब्रू का रस डाल के गैस से उतार ले.\n\n•गरम गरम पुलाव  को राइता के साथ परोसे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                    case 9: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw10);
                       txt = ("•1 कप बासमती चावल\n• 200 गाम मशरूम (पतले पतले को हुए)\n• 1/2 कप मटर (ताजे या फ्रोजेन)\n•1 बडा प्याज (बारीक कटा हुआ )\n• 1-2 हरी मिर्च लम्बाई में कटी  हुई\n• 1 छोटा चम्मच अदरक (कदूकस करा हुदा)\n• 1 छोटा चम्मच लहसुन (कदूकस करा हुआ)\n• 1 छोटा चम्मच काला जीरा\n• 2 बहीं इलाइची\n• 2 इंच का टुकडा दालचीनी\n• 3-4 लौग\n• 2 तेजपत्ते\n• 1 /4 चम्मच हल्दी\n•1 /2 चम्मच गरम मसाला\n• 2 बडे चम्मच हरी धनिया बारीक को हुई\n• 2 बडे चम्मच पुदीना बारीक कटा हुआ\n• 2 बडे चम्मच घी या तेल\n•2 बडे चम्मच काजू (घी में भूने हुए)\n•स्वादानुसार नमक\n•2 1 /2 कप पानी ");
                        txt2 = ("•चावल को धोकर पानी में आधे घंटे के लिए भिगो दे. फिर पानी  निकाल के एक तरफ रख दे \n\n• मशरूम को पतले टुकडो में काट ले.\n\n• एक गहरे बर्तन में तेल या घी डाल के गरम करे , जीरा डाल भुनने के बाद , तेज पत्ता , इलाइची,दालचीनी,  डाल के भूने, फिर कटा हुआ प्याज डाल के सुनहरा होने तक भूने, अदरक, हरी मिर्च और लहसुन डाल कुछ देर और भूने.\n\n• फिर कटा हुआ मशरूम और हल्दी डाल को  भूने. मशरूम काफी पानी छोड़ता हैं, जब मशरूम का का सारा पानी   सूख जाये तब हरे मटर मिला के 2 मिनट तक और भूने.\n\n• भीगा हुआ चावल मिला के कुछ देर तक भूने, फिर नमक,गरम मसाला मिला दे.\n\n•कटीं हरी धनिया, पुदीना और यानी मिला के उबलने दे.फिर गैस धीमी करके चावल के पूरी तरह से पकने तक पकाए.\n\n•गैस बंद करके, भूने हुए काजू और धनिये से सजाये.\n\n•गरम पुलाव प्याज के रायते के साथ परोसे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw11);
                       txt = ("•2 कप बासमती चावल (धोकर भिगाए हुए)\n•कप अमेरिकन स्वीट कॉर्न (मकई)\n•हरी मिर्च\n• 1/2 कप दूध\n•बड़ा चम्मच पुदीना\n•बड़े चम्मच हरी धनिया\n• 1-2 तेज पत्ता \n•1 -2 हरी इलाइची\n•बड़े चम्मच घी\n•पेस्ट बनाने को सामग्री\n• 5-6 लहसुन छिले हुए\n• 1 छोटा टुकडा अदरक\n• 5-6 काजू\n• 1 छोटा चम्मच काली मिर्च\n• 2-3 लौग\n• 1 छोटा टुकडा दाल चीनी");
                        txt2 = ("•पेस्ट  बनाने की सामग्री को मिला के बारीक पेस्ट बना ले.\n\n•चावल को धोकर आधे घंटे के लिए भीगा दे.\n\n•अब एक कुकर में घी डाल के गरम करे,तेज पत्ता और छोटी इलाइची डाल के कुछ देर भूने फिर हरी मिर्च डाल के चलाये.\n\n•पिसा हुआ पेस्ट डाल के 2 मिनट तक फिर मकई के दाने और नमक डाल के कुछ देर और फिर पुदीना और धनिया डाले.\n\n•दूध और पानी  डाल के एक उबाल जाने दे.\n\n•चावल डाल के कुकर छंद कर दे. 12-15 मिनट या चावल के पकने तक पकाए.\n\n• गरमागरम कॉर्न पुलाव प्याज के रायता या अपनी मनपसंद करी के साथ परोसे.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw12);
                       txt = ("•कप बासमती चावल\n•इंच का दालचीनी का टुकडा\n• 4-5 लौग\n•-1/2 छोटा चम्मच कालीमिर्च\n• 2-3 हरी इलाइची\n•तेज पत्ता\n•बड़ा चम्मच काजू\n•बड़ा चम्मच बादाम\n• 1 बस्नेड़ा चदुहुँच किशमिश-1/2 ब बा क कटा जा\n•1/2 कप अनानास बाहुक को हुई\n•बड़ा चम्मच घी\n• 2 हरी मिर्च लम्बाई में को हुई\n•केसर के कुछ धागे\n• 1 बडा चम्मच गुनगुना दूध\n• 1 चम्मच चीनी\n• स्वादानुसार नमक");
                        txt2 = ("•चावल क्रो धोकर आधे घंटे के लिए भिगो दे.\n\n•  चावल क्रो दो कप पानी, इलाइची, लौग, तेजपत्ता,कालीमिर्च, दाल चीनी, और एक चम्मच घी डाल के पका  ले.चावल पकने के बाद खिला खिला होना चाहिए पानी चावल के हिसाब से कम ज्यादा कर सकते हैं.\n\n•चाचल पकने के बाद, कढाई में बचा हुआ घी डाल के गरम करे , हरी मिर्च डाल के भुने, फिर काजू बादाम, किशमिश डाल के भूने. फिर कटे  हुए फल और चावल डाल के मिला दे. नमक और केसर वाल दूध डाल के कुछ देर भूने. फिर गैस छंद कर दे.\n\n• गरमागरम फूट पुलाव अपने मनापसंद रायते के साथ परोसे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw13);
                       txt = ("•1 कप बिरयानी राइस\n• 8- 10 टुकडे फूलगोभी\n• 1/2 कप हरे मटर छिले हुए\n• 1/2 कप गाजर लंबे टुकडों में कटा हुआ\n• 1/2 कप बीन्स मध्यम आकार के टुकडों में कटा हुआ\n• 5 छोटी इलायची\n• 1 इंच का टुकडा दाल चीनी\n• 8 लौग\n• 1 /4 चम्मच शाहजीरा\n• 2 तेजघत्ता\n•केसर के कुछ धागे 2 चम्मच दूध में भीगे हुए\n• 2 प्याज बारीक कटे  हुए\n• 2 बडे चम्मच अदरक लहसुन का पेस्ट\n• 3/4 कप दही फेटा हुआ\n• 1 चम्मच पिसी लाल मिर्च\n •1 चम्मच गरम मसाला\n• 1 चम्मच धनिया पाउडर\n• कप पिसा हुआ टमाटर (प्यूरी)\n• नमक स्वादानुसार\n• 4 चम्मच घी या तेल\n• 2 चम्मच पुदीना पत्ती\n• 2 चम्मच बारीक कटा धनिया पत्ती");
                        txt2 = ("•सब्जियां काटकर और धोकर पानी  क्रो अच्छी  प्रकार से सुखा लें\n\n•चावल  क्रो धोकर एक घंटे के लिए भीगा दे\n\n• भीगने के बाद उसमे चार कप पानी , नमक एक छोटा चम्मच, दो छोटी इलाइची, साधा टुकडा दाल चीनी, दो लौग डालकर एक कनकी रह जाने तक पका ले  और पकने के बाद बचा हुआ पानी  निकल दे.\n\n•3 चम्मच घी गरम करके उसमे बची हुई इलाइची, लौग,सहजीरा , तेजपत्ता और दालचीनी डाल दे.\n\nप्याज डालकर सुनहरा होने तक भूने, फिर अदरक लहसुन का पेस्ट डालकर दो मिनट और भूने.\n\n•कटीं हुई सब्जियों क्रो इसमें डाल कर कुछ देर बाद , अब आधा  गरम मसाला बचाकर बाकी सारे मसाले भी मिला दे\n\n• टमाटर प्यूरी मिला के सूखने तक पकाए.\n\n•फेटा हुआ  दही मिलकर 2 मिनट और पकाए.\n\n•अब एक भारी पेंदे के भगोने या पतीले में एक चम्मच घी डाले फिर पके चावल से आधे  को एक परत बिछाए फिर उसके ऊपर हुई सारी सब्जियां बिछा दे फिर बाक्री बचे हुए चावल भी बिछा दे.\n\n•बचा हुआ  आधा  गरम मसाला और भीगी हुई केसर वाला दूध छिड़क दे, आधा  कटा हुआ  धनिया और साधा पुदीना डालकर बर्तन क्रो बंद करके 5 मिनट तक पकाए.\n\n• 5 मिनट के बाद बर्तन खोलकर चेक करे की चावल पूरी तरह से पक गया है या नहीं अगर पक गया है तो गैस बंद करदे नहीं तो थोडा और पका ले .\n\n•बचे हुए धनिये और पुदीने से सजा के गरमागरम वेजिटेबल बिरयानी प्याज के रायते के साथ परोसे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw14);
                       txt = ("•1/4 कप धुली मसूर की दाल\n•कप बिरयानी का चावल\n•-1/2 कप गोभी के टुकडे कटे  हुए\n• 1/4 कप हरे मटर के दाने\n• टमाटर कदूकस करे  हुए\n• प्याज लम्बाई में कटे  हुए\n•बड़ा चम्मच अदरक लहसुन का पेस्ट-1/2 छोटा चम्मच लाल मिर्च पाउडर\n•छोटे चम्मच धनिया पाउडर\n• 1 छोटा चम्मच गरम मसाला\n•छोटे चम्मच खसखस (पानी में भीगी हुई)\n• 1 चुटकी केसर\n•बड़े चम्मच घी या तेल\n• स्वादानुसार नमक");
                        txt2 = ("•खसखस को पानी  में भिगो के पीस ले. चावल और दाल को पानी  से धोकर अलग अलग भिगो के रख दे.\n\n•गोभी ओर मटर के दानों को थोडा पकने तक भाप  में पका  ले. चावल में 5 कप पानी  डाल के एक कनकी रह जाने तक पका  ले. पानी  निकल के अलग रख दे.\n\n•केसर क्रो 2 चम्मच गरम दूध में भिगो के रख दे.\n\n• अब एक कढाई में तेल या घी डाल के गरम करे , लम्बाई में कटा हुआ  प्याज डाल के सुनहरा होने तक भून के निकाल ले. हुए घी में अदरक लहसुन का पेस्ट डाल के भूने, टमाटर डाल के दो मिनट तक भूने. फिर धनिया पाउडर, लाल मिर्च पाउडर और खसखस का पेस्ट डाल के घी अलग होने तक भूने.\n\n• इस मसाले में भीगी हुई दाल और साधा कप पानी  डाल के गलने तक उठाए, पहले से  पकी हुई सब्जियां और गरम मसाला डाल के अच्छे से मिलाये केसर वाला दूध डाल के\n\n• कुछ सेकंड तक भूने.\n\n•अब माइक्रोवेव के बर्तन में नीचे भूना हुआ प्याज डाले,फिर साधा चावल फैला के डाल दे. अब दाल और सब्जियों का मिश्रण डाले फिर ऊपर से बाकी बचा हुआ \n\n•चावल  फैला दे. भूना हुआ प्याज डाल के ऊपर से दो चम्मच दूध डाल के ढचकन ढक के माइक्रोवेव में पांच-सात्त मिनट तक पकाए. बिरयानी तैयार हैं प्याज और पुदीने के रायते के साथ खाए और खिलाये. \n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }

                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.pw15);
                       txt = ("•कप बरसाती चावल(धोकर 30 मिनट भिगाये हुए )\n•कप बारीक कटी  हुई पालक\n•बड़ा प्याज बारीक कटी  हुआ\n•टमाटर बारीक कटा  हुए\n•1 बडा चम्मच अदरक लहसून  का पेस्ट\n• 1 -2 हरी मिर्च लम्बाई में कटी  हुई\n•1/2 चम्मच लाल मिर्च पाउडर\n•1/2 चम्मच गरम मसाला\n• स्वादानुसार नमक\n•1 /2 चम्मच निम्बू  रस\n• 1 बडा चम्मच तेल");
                        txt2 = ("•चावल  क्रो धोकर आधे घंटे के लिए भीगा दे. भीगने के बाद हल्का नमक डाल के पका  के अलग रख ले.\n\n• एक कढाई में तेल डाल के गरम करे , गरम तेल में जीरा डाले जीरा पकने के बाद प्याज डाल के धीमी आंच एर सुनहरा  होने तक उठाए, फिर अदरक लहसुन का पेस्ट और हरी मिर्च  डाल के कुछ मिनट और पकाये.\n\n •टमाटर डाल के गलने और तेल छोड़ने तक पकाए.\n\n•टमाटर के पकने के बाद बारीक कटा पालक और नमक डाल के पकाए पालक के पकने बाद, लाल मिर्च पाउडर और गरम मसाला मिला के पकने दे.\n\n• फिर पहले से पका हुआ  चावल मिला के अच्छे से मिक्स करे  जिससे सारा मसाला चावल में मिक्स हो जाये.\n\n• नीबू का रस मिलाये  अच्छे से मिक्स कर दे.\n\n•पालक राइस तैयार हैं गरमागरम पालक राइस प्याज के रायते के साथ परोसे. \n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;


                    }
                }
                break;
            }


            case "Children Food Receipes": {
                switch (Text3) {
                    case 0: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.ch1);
                       txt = ("•मैगी -2 पैकेट\n• प्याज -२\n• शिमला मिर्च 1 \n•गाजर 1 \n•टमाटर- 1\n•पनीर- 3-4 क्यूब में कटी \n•-हरी मिर्च… 4-5\nलहसुन- 6-7\n•जीरा- 1/2 चम्मच \n•नमक- स्वाद…अनुसार\n•तेल- 2 चम्मवच\n•पानी- 2 कप");
                        txt2 = ("•पैन  में तेल गरम करें, तेल गरम हो जाने के बाद उसमें जीरा, कटे  हुए प्याज , पिसा लहसुन डाल कर कुछ देर के लिये चटकाएँ । उसके बाद पैन  में कटी  हुई २ शिमला मिर्च और गाजर डालें । जब सब्जिया  गल जाए तब उसमें पनीर  के छोटे टुकडे, हरी मिर्च और टमाटर डालें और कुछ देर के लिये भूनें । फिर अपने हिसाब से नमक डालें और पकाएं ।\n\n• अब पैन  में पानी  और मैगी डालें तथा मैगी पकने तक उसे उबालें । इसके बाद मैगी में मैगी मसाला काट कर डालें और दो मिनट तक पकाएं और गैस बंद  कर दें । आपकी मैगी मसाला बिल्कुल तैयार हैं, इसे गरमा- गरम बच्चो  और बडों क्रो सर्व कीजिये ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 1: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.ch2);
                       txt = ("•गेहू का दलीया -200 ग्राम (एक कप )\n• घी या मक्खन -2 छोटी चम्मच\n• पानी -चार कप");
                        txt2 = ("•दलिया के पैकेट बाजार में किराने की दुकानों से  मिल जाते  हैं. दलिया क्रो पैकेट से किसी थाली में दाल  लीजिये उसमें कोई मिट्टी इत्यादि न हो, छिलके तिनके जो भी हो निकाल कर साफ कर दीजिये.\n\n•कुकर को गरम करने रखिये, घी या मक्खन कुकर में डाल दीजिये, घी पिघलने एर, दलिया डालिये और चमचे से चला चला कर हल्का गुलाबी होने तक भूनिये. दलिया भूनने के बाद, दलिया की  मात्रा का चार गुना यानी इस भूने दलिया में डाल दीजिये, कुकर बन्द कर दीजिये.\n\n•क्रुकर में एक सीटी आने  के बाद 2 मिनिट तक दलिया क्रो धीमी गैस पर  पकने दीजिये, गैस बन्द कर दीजिये. कुकर का प्रेसर खतम होने के बाद उसे खीलिये. लीजिये हल्का गुलाबी मोती जैसे दाने जैसा दलिया तैयार हैं.\n\n• दलिया को दाल, दूध, दही या किसी भी सब्जी  जो आपकी मनापसन्द हैं के साथ खाइये और परोसिये.\n\n•दलिया का पुलाव बनाने के लिये हम यही दलिया पहले  बनायेंगे.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 2: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.ch3);
                       txt = ("•छोटे बेबी कॉर्न -1/2 किलो (चाप)\n• हरी और पीली शिमला मिर्च -2 (स्लाइस )\n• टमाटर -1  चाप\n• काली मिर्च पाउडर -२ चम्मच\n• हल्दी पाउडर 1/2 चम्मच\n• हरी मिर्च 1 स्लाइस\n• नमक स्वादानुसार\n•तेल- 1 चम्मवच\n•पानी- 1 / 2 कप");
                        txt2 = ("•एक  पेन में तेल गरम करें, फिर उसमें कटी  हुई हरी मिर्च डाले  ।\n\n• थोड़ी  देर के बाद उसमें घिसी हुई प्याज डाल कर गोल्डन  ब्राउन करें ।\n\n•फिर उसमें को टमाटर डाल कर फ्राई करें। आंच क्रो धीमा कर दें जिससे सब्जिया  पक जाएं ।\n\n• अब इसमें काली मिर्च पाउडर  और हल्दी  डाल कर चलाएं ।\n\n• फिर स्लाइस  में कटी  शिमला मिर्च और बेबी कॉर्न डाल कर मसाले के साथ मिक्सज करें।\n\n• अब थोडा सा पानी पैन में डालें । जब सब्जी  लगभग तैयार होने वानी हो तब उसमें नमक डाले  ।\n\n• आप चाहें तो इसमें थोड़ा सा  हींग भी डाल सकती हैं ।\n\n• आपकी शिमला मिर्च बेबी कॉर्न फ्राई तैयार हो गई ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.ch4);
                       txt = ("•चावल- 2\n•मूंग दाल या तूअर दाल- 1 चम्मच \n•पानी- 1 कप\n•हल्दी पावडर- चुटक्री भर\n• नमक - चुटक्री भर\n•घी- 1 /4 चम्मच");
                        txt2 = ("•सबसे पहले  दाल और चावल क्रो धोकर आधे घंटे के लिये पानी में भिगो कर रखें ।\n\n•फिर दाल- चावल क्रो कुकर में हल्दी पावडर, चुटक्री भर नमक और पानी डाल कर खिचडी तैयार कर लें \n\n•जब कुकर का प्रेशर निवल जाए तब ठी, बत्ती खोल कर चावल और दाल क्रो अच्छी तरीके से  मैश कर लें ।\n\n•अब इसमें घी डालें और मिक्स करें।\n\n•गरमा गरम ही बच्चे क्रो खिंलाएं ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.ch5);
                       txt = ("•डार्क कंपाउंड -500  ग्राम\n• वाइट कंपाउंड  250  ग्राम \n•काजू 2-3 टेबल स्पून\n•बादाम 2-3 टेबल स्पून\n• किशमिश 2 टेबल स्पून\n• अखरोट 10-12 टेबल स्पून \n•चॉक्लेट मोल्डस ");
                        txt2 = ("•चॉकलेट डार्क कम्पाउन्ड और वाइट  कम्पाउन्ड क्रो पिघला कर बनाई जाती है . इसके लिये सबसे पहले हमे  डार्क कम्पाउन्ड और वाइट  कम्पाउन्ड के छोटे छोटे टुकडे करने होंगे सबसे पाले डार्क कम्पाउन्ड  और वाइट  कम्पाउन्ड  क्रो चाकू से काट कर बारीक कर लीजिये या पोलिथिन में रैप करके किसी भारी चीज से तोड़ कर बारीक लीजिये, और अलग अलग प्याले में रख लीजिये.\n\n•चॉकलेट को मैल्ट कीजिये \n\n•चॉकलेट क्रो 2 तरीके से मेल्ट कर करते हैं. डबल बायलर के द्वारा और माइक्रोवेव में. माइक्रोवेव में चॉकलेट बहुत जल्द मैल्ट हो जाती  है लेकिन डबल बायलर में चॉकलेट सारा देर से मेल्ट होती हैं.\n\n• डबल बायलर में चॉकलेट मेल्ट कर लीजिये \n\n• 2 भगोने इस तरह के ले लीजिये जिनके ऊपर 2 प्याले चॉकलेट भर कर मेल्ट करने रख सके, भगोने में  1/2 कप पानी  डालकर धीमी फ्लेम  एर गरम होने के लिये रख लीजिये  चॉकलेट  भरे प्याले पर  रख दीजिये,जैसे ही चॉकलेट पिघलना शुरु हो जाय चॉकलेट क्रो चम्मच से अच्छी  तरह चला दीजिये, आग  हमेशा धीमी ही रखें,\n\n• चॉकलेट बहुत ही सेंसिटिव  होती है थोडी सी भी अधिक हीट लगने चॉकलेट ओवर हीट हो जाती  हे. धीमी गैस पर चॉकलेट को   थोडी सी  देर में अच्छी  तरह चलाते हुये चॉकलेट क्रो पूरी तरह मेल्ट होने तक पिघला लीजिये.\n\n•मेल्ट  चॉकलेट गरम यानी के बर्तन से उतार कर किसी के ऊपर रख लीजिये, ताकि प्याले में नीचे की  और जो नमी है चह कपडा -शोक  लेगा. चॉकलेट क्रो थोडा सा ठंडा कर लीजिये. चॉकलेट क्रो चम्मच से लगातार चलाते हुये 1-2 मिनिट तक एसे ही रहने दें चॉकलेट ठंडी हो जायेगी या मेल्टेड चॉकलेट में थोडी सा अनमेल्टेड चॉकलेट डाल दें, चॉकलेट इस तरह से जल्दी ठंडी हो जाएगी .\n\n• चॉकलेट को मेल्ट  कीजिये चॉकलेट क्रो जिंस तरह के मोल्ड में डाल देंगे उसी तरह को चॉकलेट बन कर तैयार हो जायेगी. मोल्ड जिसमें चॉकलेट क्रो मोल्ड करना  चाहते हैं, उसे ले लीजिये चह एकदम सूखा होना चाहिये, मोल्ड एर किसी भी प्रकार की  नमी न हो.मेल्टेड चॉकलेट क्रो मोल्ड में चम्मच को सहायता से भर लीजिये… मोल्ड के सारे खांचे भर कर तैयार कर लीजिये \n\n• डार्क और वाइट  मिक्स चॉकलेट - \n\n• अपना  मनापसन्द  ले लीजिये, मोलड एक दम सूखा  होना चाहिये. पहले वाइट मेल्टेड चोकलेट थोडी थोडी मोलड के खाचों में डाल दीजिये, सारे मोलड के खाने मैं थोडी थोडी वाइट चॉकलेट भर लीजिये. अब वाइट चॉकलेट वापस गरम पानी  के ऊपर रख दीजिये और डार्क मेल्टेड चॉकलेट क्रो इन खानों में भरिये, खानों क्रो थोडा थोडा खाली रहने दीजिये, सारे खाने भर कर तैयार कर लीजिये.अब डार्क चॉकलेट क्रो वापस गरम पानी  के ऊपर रख दीजिये और वाइट  चॉकलेट थोडी थोडी खाचों में डालिये,खाचें पूरे भर जायं, सारे खानों में वाइट  चॉकलेट डालकर भर लीजिये. मोल्ड क्रो खटखटा कर चॉकलेट के नीचे को एअर निकल जाय, और चॉकलेट एक जैसी भी हो जायेगी.मोल्ड क्रो 5-10 मिनिट के लिये फ्रीजर में रख दीजिये,चॉकलेट जम कर सैट हो जायेगी. मोलड क्रो फ्रीजर से निकाले और प्लेट पर  उल्टा करके ऊपर से पैक  कर दीजिये,फिर  उसे पुश कर दीजिये. चॉकलेट प्लेट में निकल जायेगी. मिक्स्ड कलर चॉकलेट तैयार हैं.\n\n• ड्राई फूट चॉकलेट थोडा सा बडे खाने वाला  लीजिये, मोलड एकदम खा और साफ हो, डार्क मेल्टेड चॉकलेट मोलड में सारा डाल दीजिये, चॉकलेट साधा खाने से कम भरें, सारे खाने बनाकर  तैयार कर लीजिये. अब कुछ खानों में चॉकलेट के बीच में  आधा  अखरोट  और कुछ खानों में बादाम डाल दीजिये, ऊपर से और चॉकलेट डालकर खाने क्रो पूरा भर दीजिये, सारे खाने के ड्राई के ऊपर चॉकलेट भर कर तैयार कर लीजिये. मोल्ड खटखटा कर चॉकलेट के नीचे को एअर निकाल दीजिये, और चॉकलेट एक जैसी भी हो जायेगी. मोल्ड क्रो 5-10 मिनिट के लिये फ्रीजर में रख दीजिये, चॉकलेट जम कर सैट हो जायेगी. मोल्ड क्रो फ्रीजर से निकालिये और प्लेट एर उल्टा करके ऊपर से सेट  कर दीजिये, रबर के मोल्ड हो तो उसे पुश  कर दीजिये. चॉकलेट प्लेट में निकल जायेगी. अखरोट  हुए बादाम चॉकलेट तैयार हैं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 5: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.ch6);
                       txt = ("•घी 1 चम्मच \n•दलीया  1 /2 कप\n•इलाइची1 /2 चम्मच, पाउडर\n•ड्राईं  फ्रूट्स 1 चम्मच, सजाने के लिए\n•चीनी 2 चम्मच, स्वाद अनुसार\n•पानी1 1/2 कप");
                        txt2 = ("•एक नॉन स्टिक पैन  में घी गरम करे  और घी पिघल जाये फिर दलिया डाले और 4 से 5 मिनिट तक रंग बदलने तक उठाए\n\nगुनगुना पानी डाले और अच्छे से मिला ले.\n\n अब चीनी डालकर पानी में मिला ले.\n\nदलिया लापसी  क्रो धीमी आंच  एर पानी सूखने तक पकने दे. इसमें 10 से 20  मिनिट तक लग सकते हे.\n\nपानी सूखने को बाद इलाइची पाउडर डाले और अच्छे से मिला ले.\n\nदलिया  लापसी तैयार हे. ड्राई फ्रूट्स  डालकर गार्निश को और गरमा गरम सर्व करे.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 6: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.ch7);
                       txt = ("•मैदा - 200 गाम (2 कप )\n•बेकिंग पाउडर - 1/2 छोटी चम्मच\n•बादाम- 150 ग्राम( 1 व्य) -\n•मक्खन --200 गाम ( 1 कप )\n•पिसी चीनी - 200 गाम ( 1 कप )\n•दूध  - 2 टेबल म्पून");
                        txt2 = ("•मैदा और बैकिंग पाउडर मिलाकर, किसी थाली में छान कर निकल लीजिये.\n\n• थोडे से 20-25 बादाम साबुत बचा कर , सारे बादाम दरदरा पीस लीजिये. बचे  हुये बादाम साधा घंटे के लिये गुनगुने पानी  में डाल कर रखिये, पानी  से बादाम निकलिये और लम्बाई में 2 टुकडे में काट लीजिये.\n\n•किसी बडे बर्तन में मक्खन निकलिये, हल्का गरम करके पिघला लीजिये, चीनी मिलाइये और खूब फैट लीजिये.\n\n• मक्खन और चीनी के मिश्रण में मैदा डालिये, मिश्रण के एकसार होने तक मिलाते रहिये. अब इसमें पिसा हुआ बादाम और दूध डाल कर अच्छी  तरह मिला कर  आटा जैसा गूथ लीजिये\n\n• ट्रे को  घी लगाकर चिकना कीजिये. मिश्रण से थोडा थोडा मिश्रण निकालिये, हाथों से गोल कीजिये, एक हाथ एर रखकर, गोले की दूसरे हाथ से दबाइये, कुकीज के बीच में आधा  कटा हुआ बादाम रखिये और दबा कर लगा दीजिये.तैयार कुकीज  में लगाकर रखिये. कुकीज  में लगाते समय ध्यान रखिये कि एक कुकीज से दूसरी कुकीज सारा दूरी एर हो, ब्रेक होने एर कुकीज फूल कर जपना अपना  दूब डायेंगी, जितनी कुकीज इस  में है उतनी कुकीज बनाकर  लगा लीजिये.\n\n•ओवन की 180 डि. से. से ही गरम कीजिये.कुकीज  लगी हुई है  ट्रे ओवेन मे  लगाइये और ओवेन 15 के लिये सैट कर दीजिये. समय समाप्त होने के बाद कुकीज निकाल कर चैक कीजिये अगर किनारे से कुकीज हल्की ब्राउन हो गई है तब कुकीज ब्रेक हो गई है अगर नहीं तो ओवन को 5 मिनिट के लिये और सैट कीजिये. कुकीज ब्रेक हो गई हैं. बादाम को कुकीज ओवन से निकालिये, ठंडा होने के बाद  ट्रे  से कुकीज निकाल निकाल कर  .\n\n•इसी तरह बची हुई सारी कुकीज तैयार करके, कुकीज को  ब्रेक कर लीजिये.\n\n• बादाम कुकीज तैयार है ताजा ताजा स्वादिष्ट बादाम कुकीज आपके हाथों से बनी अपने बच्चो को  दीजिये और खाइये, बची हुई बादाम कुकीज  एअर टाइट कन्टेनर में भर कर रख लीजिये और जब भी आपका मन हो कन्टेनर से कुकीज निकालिये और खाइये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.ch8);
                       txt = ("• एक कप उरद दाल\n• 2 कप ओट्स \n• आधा कप चना दाल\n• कद्दूकस की हुई गाजर दो बड़े चम्मच\n• बारीक कटी हुई २ हरी मिर्च\n• 2 कप दही\n• एक चुटकी हल्दी \n•एक चुटकी बेकिंग सोडा\n•एक छोटा चम्मच राई दाना\n• बारीक कटा हरा धनिया स्वादानुसार  नमक\n•तेल");
                        txt2 = ("•गैस एर कडाही गर्म करें. इसमें ओट्स  डालकर हल्के ब्राउन होने तक भूनें.\n\n•अब ओट्स  क्रो मिक्सर में बारीक पीस लें.\n\n• पेन में तेल डालकर गैस पर गरम करें. इसमें राई दाना, चना दाल और उड़द दाल डालकर भूने.\n\n• इसके बाद हरी मिर्च, गाजर, हरी धनिया और हल्दी पाउडर डालकर 1 से 2 मिनट तक मध्यम आंच  एर पकाकर गैस छंद कर दें.\n\n• फिर इसमें आंट्स, दही, बैकिंग सोडा और नमक डालकर अच्छी  तरह फेटें. इस तरह इडली का घोल तैयार कर लें.\n\n• अब इडली मेकर में पानी  डालें और इसे गैस पर गर्म करने रख दें. फिर सांचे में थोड़ा थोड़ा  तेल लगाकर चिकना कर लें, और इनमें इडली का घोल भरें.\n\n•इसके बाद इडली मेकर क्रो बंद  करके कम से कम 15 मिनट तक इडली को पकाये. जब यह अच्छी  तरह फूलकर पक जाएं, तो इडली क्रो मेकर से निकल कर प्लेट रखें.\n\n• इसी तरह पूरे घोल को इडली बना लें. लीजिए तैयार हैं ओट्स  इडली. इन्हें नारियल चटनी और सांभर के साथ परीसें. हरी चटनी के साथ भी इनको सर्व क्रिया जा सकता हैं.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 8: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.ch9);
                       txt = ("•एक कप मैदा\n• 1 निम्बू  का रस \n•1 /२ कप कटे हुए  मावे  बादाम,पिस्ता काजू ,किशमिश\n• 1 पका हुआ केला 1/2 कप चीनी या सहद 1/2 टेबल स्पून वैनिला एसेंस  एक अंडा 1/2 कप पिघला हुआ मक्खन");
                        txt2 = ("•एक बाउल में मैदा और बैकिंग सोडा छान कर मिला लें\n\n•एक दूसरे बाउल में अंडा, मक्खन, ड्राई फ्रूट्स,नींबू का रस, वनिला एसेंस और चीनी डालकर अच्छी  तरह फैट लें.\n\n•इसे  तब तक फेंटते रहें जब तक कि पेस्ट. का रंग गोद और क्रीमी न हो जाए\n\n• अब इसमें मैदे को इस तरह मिलाएं कि उसमें कोई गांठ नहीं रहे.\n\n• अगर पेस्ट ज्यादा गाढा लग रहा हो तो इसमें थीड़ा-सा दूध मिला दे.\n\n•बैकिंग ट्रे में थोडा ट्रे आयल या घी  लगा कर तैयार पेस्ट  को उसमें डाल दें.\n\n•इसे जीवन में रख कर 180 डिग्री सैल्सियस एर 30 से 40 मिनट तक सेक  करें.\n\n• जब केक बनकर तैयार हो जाए तो इसे काट लें.\n\n• चाय या कॉफी के साथ इसे सर्व.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 9: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.ch10);
                       txt = ("•एक कप साबुत चावल \n•आधा कप पोहा \n• एक कप दही\n•चार कप गुड़\n•1/4 चम्मच हल्दी\n•चार छोटी चम्मच कसा हुआ नारियल\n•दो छोटी चम्मच तेल\n• स्वादानुसार नमक");
                        txt2 = ("•चावल को चार से पांच घंटे के लिए भिगो कर रख दें और फिर पानी  से निकल लें.\n\n•पोहा , दही, लगभग एक कप पानी, गुड़, हल्दी च नमक क्रो मिलकर मिक्सी में पेस्ट  कर लें.\n\n• इस मिश्रण क्रो थोडा गाढा रहने दें और रात  भर के लिए ढक कर रख दें.\n\n• सुबह मिश्रण चेक करें और इसमें पानी  और नारियल मिलाएं.\n\n• गैस एर तवा रखें और गर्म होने के बाद इस पर हल्का  तेल लगाएं .\n\n• तवे एर मिश्रण के दो बडे चम्मच बिना फैला डालें.\n\n•अब इसे ढक दें और धीमी आंच पर सिकने  दें.\n\n•जब पैन केक  सुनहरा हो जाए तो इसे तवे से उतार लें.\n\n• बचे हुए मिश्रण से ऐसै ही पैन केक बनाएं और फिर लें स्वाद मजेदार पेन केक्स का.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 10: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.ch11);
                       txt = ("•2 कप (240 गाम) मैदा\n• 2 छोटे चम्मच बैकिंग पाउडर\n• एक कप ( 120 गाम) ब्राउन शुगर (ब्राउन चीनी)\n• एक कप ( 120 गाम) नमक्रीन मक्खन (सॉल्टेड बटर)\n• एक चुटकी दालचीनी पाउडर\n• 5 बडे चम्मच \n• 50 गाम चिप्स\n 2 छोटे चम्मच चॉक्लेट  एसेंस");
                        txt2 = ("•मैदे में बैकिंग पाउडर मिक्स करके एक बर्तन में छान ले.\n\n• ओवन को 180 डिग्री सैल्सियस या 356 डिग्री फेरनहाइट एर प्री-हीट कर ले.\n\n• एक कटोरे में बटर और ब्राउन शुगर डालकर, चीनी के घुलने तक अच्छी तरह फैट ले.\n\n• फिर मक्खन के मिक्सर में दूध, चॉक्लेट  एसेंस और दालचीनी पाउडर डालकर अच्छी  तरह मिक्स करें.\n\n• इसके ब्राद अच्छी  चिप्स क्रो पिघला कर , दूध-बटर मिश्रण में डालकर मिलाएं.\n\n• अब छाना हुआ  मैदा मिक्सर में मिक्स करके गूंध  ले.\n\n•एक ओवन ट्रे पर मक्खन लगाकर उसे चिकना कर ले.\n\n•अब मैदा मिक्सचर के छोटे-छोटे बॉल  बनाकर दोनों हाथों से दबाएं और ऊपर से 2-3 चॉकलेट चिप्स रखकर हल्के दबा दें, इसी तरह सब कुकीज तैयार करके चिकनी ट्रे  में रखते जाए\n\n•फिर ट्रे  की प्री… हीटेड ओवन  में रखकर ब्राउन होने तक बेक करके, जीवन से कुकीज को ट्रे ले.\n\n•बनकर तैयार हैं एगलेस चॉकलेट चिप्स कुकीज. ठंडी करके जब चाहे सर्व करें\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 11: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.ch12);
                       txt = ("•एक कप गेहू का आटा \n• 1 /4 कय नारियल का बुरादा (कदूकस क्रिया हुदा\n• 1 /4 चम्मच ब्रेकिंग सोडा\n•3 से 4 बडे चम्मच नारियल का तेल, मक्खन या घी(पिघला हुदा)\n•आधा छोटा चम्मच इलायची पाउडर\n• साधा कय गुड़ कदूकस क्रिया हुआ\n•साधा कय काजू\n• 2 से 3 बडे चम्मच यानी या नारियल दूध");
                        txt2 = ("•एक बर्तन में गेहूं का आटा  छान लें. आटे में ब्रेकिंग सोडा,इलायची पाउडर और नारियल तेल, मक्खन या घी डालकर एक चम्मच से चलाकर अच्छी  तरह मिक्स करें.\n\n•ओवन  क्रो 180 डिग्री सेल्सियस या 356 डिग्री फेरनहाइट यर प्री-हीट कर लें.\n\n• इसके बाद जाते में नारियल का बुरादा और कदूकस क्रिया हुआ गुड़ डालकर मिक्स करें.\n\n• अब आटे में पानी  या दूध  डालकर सारी सामग्री क्रो हाथ से अच्छी  तरह मिक्स कर ले  और आटे की  एक बड़ी  बाल बनाएं .फिर एक ट्रे को घी या मचखन से चिकना कर लें और आटे के मिश्रण में से थोडा भाग लेकर गोल करके दोनों हाथों से थोडा दबा दें. इसके ऊपर एक काजू रख हल्कऱ दबा दें. इसी तरह सारे आटे को कुकीज बनाकर  रखें.\n\n• इसके बाद  प्री-हीटेड ओवन  में रखकर 20 से 25 मिनट तक कुकीज को  सुनहरा होने तक बेक करें.\n\n•अब ट्रे ओवन से निकालकर कुकीज  ठंडी होने तक एक चपटी चम्मच की  मदद से है से निकाल लें.\n\n•जब ये अच्छी  तरह ठंडी हो जाएं तो इनको एक जार में रखकर स्टोर करें और जरूरत के हिसाब से सर्व करें.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 12: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.ch13);
                       txt = ("•कप मैदा\n•1/2 कप घी\n• 2कप पिसी चीनी\n• 1 छोटा चम्मच बैकिंग पाउडर\n• 1/2 कप बादाम पिसा हुआ\n•2-3 बूंदे वनीला ऐसेंसे \n•आइर्सिग की  सामग्री-\n• 4 बडे चम्मच बादाम शरबत\n• 4 चम्मच पानी \n• 250 ग्राम  ठंडी क्रीम \n• 5 बडे चम्मच पिसी चीनी\n• 1 छोटा चम्मच बादाम एसेंस");
                        txt2 = ("•मैदे और बैकिंग पाउडर क्रो छान लें. चीनी के साथ फेटें. इसमें थोड़ा थोड़ा  करके घी मिलाएं और फेंटते जाए\n\n• अब इसमें मैदा डालें फिर फेंटें. एसेंस डालकर इस घोल दुनी बैकिंग टिन में मक्खन लगाकर और मैदा बुरककर डाल\n\n• उपर से पिसा बादाम पिसा डालें. गरम जीवन में 45मिनट तक बेक करें. हल्का ब्राउन होने एर निकल लें. आइर्सिग की  विधि-\n\n•क्रीम , चीनी और एसेंस को  फैट लें. फ्रिज में रखकर  ठंडा करे  .\n\n•अब इस क्रीम  क्रो केक एर लगाए\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.ch14);

                       txt = ("•8 ब्रेड स्लाइसेस  \n•2 केले\n• 1 सेव \n• आधा  कप मक्खन \n•4-5 स्ट्रॉबेरी \n•आधा  कप पाइनएप्पल  जैम\n• स्वादानुसार काला नमक\n• 1 चम्मच चाट मसाला\n• 1 चम्मच मिर्च पाउडर");
                        txt2 = ("•ब्रेड के स्लाइसेस क्रो चारों और से काट लें.\n\n• अब एक स्लाइसेस पर  बटर लगाएं और दूसरी स्लाइसेस पर  पाना/ध्यान जैम लगाए\n\n• सारे स्लाइसेस  क्रो इसी तरह तैयार करके प्लेट रखें.\n\n• अब बटर लगे स्लाइसेस पर  सारे फलों को स्लाइसेस काट कर लगाए फिर उस एर काला नमक, चाट मसाला और काली मिर्च पाउडर छिडक दें.\n\n•अब  जैम लगी हुई ब्रेड क्रो उसके ऊपर रख दें और तैयार सैंडविच क्रो दो पीस में काट लें.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 14: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.ch15);
                       txt = ("•आधा  कप मकई के दाने यानी कॉर्न कर्नल्स\n• एक बडा चम्मच मक्खन\n• एक चौथाई चम्मच हल्दी\n• आधा  चम्मच लाल मिर्च\n• आधा  चम्मच जीरा पाउडर (भून कर पीस लें)\n• एक चौथाई चम्मच अमचूर\n•एक चौथाई चम्मच गरम मसाला\n• नमक स्वादानुसार");
                        txt2 = ("•भारी तले के एक बडे बर्तन क्रो गैस पर  रखें और मक्खन डालकर पिघलने दें.\n\n•जैसे  ही मक्खन पिघले, मकई के दाने और सारे मसाले डाल दें.\n\n•कलछी  से अच्छी  तरह मिक्स कर लें और आंच कम कर के पेन क्रो ढक दें. थोडा सी जगह इतनी रखें कि स्टीम बाहर निकलती रहे.\n\n•आपकी मकई के दानों के फूटने  की  आवाज जाएगी और इसके कम होने तक पेन  पर  रहने दें. इसमें दो से पांच - मिनट तक का टाइम लगेगा.\n\n•आवाज़ कम होने एर गैस बंद करें और पैन  का ढवकन हटा दें. एक बाउल में पलट कर मजेदार मसाला पॉपकॉर्न का मजा लें.\n\n• माइक्रोवेव में\n\n•माइक्रावेव सेफ  एक बर्तन में मक्खन डालें और 30 सेकेंड तक माइक्रोवेव चलाएं. मक्खन पिघल जाएगा.\n\nइसे बाहर निकाल कर इसमें मकई के दाने और सारे मसाले डालकर अच्छी  तरह मिक्स कर दें.\n\n•इस बर्तन क्रो ढककर माइक्रोवेव में हाई सेटिंग एर 2 मिनट तक चलाएं.\n\n•बर्तन बहुत गर्म होगा. लिहाजा दस्ताने पहनकर इसे बाहर निकालें और एक बाउल में पलट कर   मजेदार मसाला पॉपकॉर्न का मजा लें.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }

                }
                break;
            }

            case "Sharbat Receipes": {
                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.t1);
                       txt = ("•चीनी - 5 कप\n•पानी- 21/2कप)\n•बादाम - 1 /2 कप से थोडे अधिक (100 ग्राम)\n•सोंफ - 1 /2 कप ( 50 ग्राम)\n•काली मिर्च - 2 छोटी चम्मच\n• खसखस  - 1 /2 कप (50 ग्राम)\n•खरबूजे के बीज - 1 /2 कप ( 50 ग्राम)\n•छोटी इलाइची - 30 - 35 (छील कर बीज निकाल लीजिये)\n•गुलाब जल - 2 टेबल स्पून  (यदि आप चाहें  )");
                        txt2 = ("•किसी बर्तन में चीनी और पानी मिलाइये और उबाल आने के बाद 5 -6 मिनिट तक उबालिये और ठंडा कर लीजिये, चीनी का घोल बन कर तैयार हो गया.\n\n•सोंफ, कालीमिर्च, बादाम, खरबूजे के बीज, इलाइची के दाने और खसखस को साफ कीजिये और धो कर पानी में अलग अलग घंटे के लिये भिगो दीजिये (रात भर भी भिगोया जा सकता हैं) \n\nसभी चीजों से अतिरिक्त पानी निकाल दीजिये. बादाम को छील कर छिलका अलग कर दीजिये.\n\n•सभी चीजों को बारीक पीस लीजिये. इन चीजों को पीसने के लिये पानी की जगह चीनी के घोल का प्रयोग करिये.\n\n•बारीक पिसे मिश्रण को चीनी के घोल में मिलाइये और छान लीजिये. बचे हुये मोटे मिश्रण में घोल मिला कर फिर से बारीक होने तक पीस कर छान लीजिये.\n\n ठंडाई बन चुकी है ठंडाई को एअर टाइट बोतल में भरिये और फ्रिज में रख लीजिये. इसको आप फ्रिज में 1 महिने से भी अधिक रख सकती हैं.\n\n•जब भी आपको ठंडाई पीनी है आप इसमें आवस्यकतानुसार बर्फ एवं दूध मिलाइये, और ठंडी ठंडी ठंडाई पीजिंये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 1: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.t2);
                       txt = ("• तरबूज - 2- 21 /2 किग्रा.\n•नीब्रू - 1\n•बर्फ के क्यूब्स - 1 कप");
                        txt2 = ("• तरबूज को धोइये, काटिये, मोटा हरा भाग छील कर निकाल दीजिये, लाल वाले भाग के इतने छोटे टुकडे कीजिये जो आपकी मिक्सर में आसानी से चल पायें.\n\n•मिक्सर में तरबूज के टुकडे डालकर मिक्स कीजिये. थोड़े ही देर में गुदा और रस एकदम धुल जायेगा. अब इस रस को चलनी में छान लीजिये\n\nजूस में स्वाद बडाने के लिये एक नींबू निचोड़ लीजिये और गिलास में डालिये बर्फ के क्यूबस डालकर ठंडा कीजिये.आप चाहें तो गिलास में शरबत के ऊपर 1 -2 पोदीना पत्तियां भी सजा सकते हैं और इसे अपने स्वादानुसार चीनी डालकर अधिक मीठा भी कर सकते हैं, लेकिन मुझे तो यह बिना अतिरिक्त चीनी डाले हुये अपने वास्तविक स्वाद में ही पसंद जाता हैं.\n\nठंडा ठंडा तरबूज का शरबत तैयार हैं और अब पीजिये ये ठंडा ठंडा तरबूज का लाल शरबत \n\n•इसे पीने के बाद आप बाजार में बिकने वाले बनाबटीं रंग और स्वाद वाली रंगीन पानी की बोतलों को छुयेंगे भी नहीं\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.t3);
                       txt = ("• बेल फल - 2\n•चीनी - 4 --5 टेबल स्पून \n•भुना जीरा - 1 छोटी चम्मच\n• काला नमक - 1 चम्मच");
                        txt2 = ("•बेल को  धोइये, काटिये और गूदा निकाल लीजिये. एक भगोने में गूदे से दो गुना पानी डालकर अच्छी तरह मसल लीजिये. इतना मसलिये  कि सारा गूदा और पानी एक लगने लगी\n\n•इस मसले गूदे को  मोटे छेद वाली चलनी में छान लीजिये,चमचे से दबा दबा कर सारा रस निकाल लीजिये.\n\n•निकाले हुये रस में चीनी मिला लीजिये. जब चीनी अच्छी तरह धूल जाय तो इसमें ठंडा पानी या बर्फ के क्यूब मिलाइये नमक और भूना जीरा भी मिलाईंये. एक किलो बेल  के फल से लगभर चार पांच गिलास शरबत बन जाता है\n\n• ठंडा मीठा बेल का शरबत तैयार हे.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.t4);
                       txt = ("•लाल गुलाब के फूल - लगभग 30 गुलाब)\n•चुकन्दर - 1\n• तुलसी के पत्ते - 20-25 पत्तियां\n• पोदीना के पत्ते - 20-25 पत्तियां\n• धनियां के पत्ते - एक बडी चम्मच कटा हुआ \n•छोटी इलाइची- 5-6\n•चीनी - 1 किलोग्राम. (5 कप )\n•नीबू - 4");
                        txt2 = ("• गुलाब की पंखुड़ियों को 2 बार अच्छी तरह धोकर साफ कर लीजिये, धुली पंखुड़ियों को छलनी में रखकर अतिरिक्त पानी निकाल दीजिये, अब गुलाब की पंखुड़ियों को सूती साफ कपडे पर फैलाइये, दूसरे कपडे से भी पोंछ कर पानी हटा दीजिये.\n\n• एक कप पानी उबालिये, हल्का गरम रहने पर ,गुलाब पंखुड़ियों को मिक्सर में डालिये, उबला पानी डाल कर ,गुलाब पंखुड़ियों को पीस लीजिये.\n\n•पिसे गुलाब पंखडियों को छलनी में डालिये, किसी प्याले में गुलाब रस को छान कर अलग कर लीजिये.\n\n•चुकंदर को धोइये, छीलिये, टुकडों में काटिये  तुलसी, धनियां और पुदीना के पत्ते धोइये और इन सबको मिलकर बारीक पीस लीजिये. पिसा हुआ मिश्रण और एक कप पानी किसी बर्तन में डालिये और उबलने रखिये. उबाल जाने के बाद धीमी आग पर 3-4 मिनिट तक उबलने दीजिये. आग बन्द कर दीजिये और इस मिश्रण को ठंडा होने दीजिये. मिश्रण के ठंडा होने के बाद, छलनी से छानिये और इस रस को प्याले में रख लीजिये.\n\n•600 ग्राम चीनी को किसी बर्तन में डालिये, 200 ग्राम या 1कप पानी मिलाइये , उबलने के लिये रखिये, चीनी घुलने के बाद, 1 -2 मिनिट उबालिये और आग बन्द कर दीजिये और इस चाशनी को ठंडा होने दीजिये.\n\n बची हुई चीनी में इलाइची छील कर दाने मिलाइये और पीस लीजिये \n\nनीबू का रस भी एक प्याले में निकाल लीजिये.\n\nचीनी की चाशनी में गुलाब की पंखुड़ियों का रस, चुकन्दर इत्यादि के मिश्रण का रस और नीबू का रस मिलाइये. पिसी हुई चीनी भी इसी चाशनी में डाल दीजिये, सारी चीज़ो को अच्छी तरह मिलाइये. शरबत को 4-5 घंटे ढक कर रखे रहने दीजिये, ताकि सारे स्वाद मिलकर अच्छी तरह महकने लगे.\n\n गुलाब का गाड़ा शरबत  तैयार है गुलाब के शरबत को कांच की बोतल में भर कर फ्रिज में रख लीजिये. और जब भी आप शरबत बनाना चाहें तब 1 गिलास ठन्डे पानी  में 2 बडी चम्मच गुलाब शरबत डालिये और मिलाइये. गुलाब शरबत को अधिक ठंडा करने के लिये, थोड़ी सी 1 -2 क्यूब बर्फ डाली जा सकती हे. गुलाब का शरबत बहुत ही स्वादिष्ट बना हे.\n\nइस गुलाब शरबत को 1 महिने तक फ्रिज में रख कर प्रयोग में ला सकते हैं\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.t5);
                       txt = ("•फालसे -250 ग्राम (11 /2कप) \n• चीनी - आधा कप से थोड़ा कम \n• काला नमक- आधा छोटी चम्मच \n• बर्फ के क्यूब्स (एक कप )");
                        txt2 = ("•पहले तो फालसे के फलों को कपडे में रखकर हाथ से मसल कर पानी में इसका रस निकालते थे लेकिन वह तरीका समय के साथ पुराना हुआ. मिक्सर में इसका रस बनाना बहुत ही आसान हो गया हैं.\n\nफालसे धोइये कर छलनी में रखिये और अतिरिक्त पानी हटने तक सुखा लीजिये, मिक्सर में चीनी और आधा कप पानी डाल कर , चीनी घुलने तक फैट लीजिये, अब इसमें फालसे डालिये और बिलकुल थोडा चला दीजिये, इस तरह फालसे का गूदा बीजो के ऊपर से निकल कर पानी में मिक्स हो जाता हैं, बीज साबुत ही रह जाते हैं.\n\n• अब मिक्सर में 3 कप ठंडा पानी मिलकर आधा मिनट और चलाईंये. फालसे के रेशे और रस इस पानी में मिल जायेगे शरबत को मिक्सर से निकाल कर छान लीजिये,लीजिये फालसे का शरबत तैयार हैं, आप चाहें तो इसमें एक नींबू और निचोड़ सकते हैं\n\n•फालसा शरबत को गिलास में डालकर सर्व कीजिये, शरबत को और अधिक ठंडा करने के लिये,बर्फ के क्यूब्स डालिये और पीजिंये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.t6);
                       txt = ("• ताजी स्ट्रॉबेरी - 1 कप कटी हुई\n•नींबू रस - 2 चम्मच\n•चीनी- 1 चम्मच\nठंडा पानी-कप\n•आइस क्युबेस- 4 से 5");
                        txt2 = ("• सभी स्ट्रॉबेरी को धो लें और पोछ लें । फिर उन्हें काट लें\n\n•अब जूसर में स्ट्रॉबेरी सहित अन्य सामग्रियों को मिला कर चलाएं ।\n\n•इसे गिलास में निकालें और ऊपर से आइस क्युबेस डालें ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 6: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.t7);
                       txt = ("• नींबू - 14-15 मीडियम आकार के ( 1 /2 किग्रा.)\n•चीनी-5 कप  किग्रा.)\n•पोदीना - 1 बन्च (पत्तियां 1 कप)\n•अदरक - 1 इंच लम्बा टुकडा\n•काला नमक - 1 छोटी चम्मच");
                        txt2 = ("• चीनी को किसी बर्तन में डालिये, चीनी से तीसरे हिस्से का पानी डाल कर मिलाइये( 1 किग्रा. चीनी में 300 ग्राम. पानी या 11 /2 कप पानी ) मिला दीजिये.\n\n•इस चीनी पानी के घोल को आग पर पकने के लिये रखिये.घोल में चीनी घुलने और उबल जाने के बाद 5-6 मिनिट और पका लीजिये, ये घोल अगर आप अपने हाथ के उंगली और अंगूठे के बीच लेकर देखे तो थोडा चिपकता हैं. चीनी का घोल बन गया हैं आग बन्द कर दीजिये और घोल को  ठंडा होने के लिये रख दीजिये.\n\n•नीबू को धोइये और सारे नीबू रस निचोड़ लीजिये. पोदीना की पत्तियों को साफ पानी से 2 बार धो लीजिये, अदरक को छील कर धो लीजिये.\n\n• पोदीना और अदरक को मिक्सर से बारीक पीस लीजिये. पोदीना पीसते समय पानी का प्रयोग मत कीजिये बल्कि थोडा चीनी का घोल ही डालकर पीस लीजिये.\n\n•चीनी के ठन्डे घोल में पोदीना और अदरक का पिसा हुआ पेस्ट मिलाइये, नीबू का रस, काला नमक भी डालिये और मिला दीजिये. शरबत को छानिये. लीजिये नीबू पोदीना शरबत तैयार हे. जाए इस शरबत को कांच या प्लास्टिक की सूखी साफ बोतल में भर कर अपने फ्रिज में रख सकते हैं. ये नीबू पोदीना शरबत आप पूरे महिने तक पिया जा सकता है.\n\n•पीने के लिये शरबत तैयार कीजिये: बोतल से कंसन्ट्रेट शरबत निकालिये और 6 गुना पानी मिलाइये , 2-3 आइस क्यूब डालिये, ठंडा ठंडा नीबू पोदीना शरबत तैयार हे. ये ठंडा नीबू पोदीना शरबत पीजिये और बताइये कि कैसा लगा आपको ये शरबत.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.t8);
                       txt = ("•पका हुआ आम -1 (300ग्राम)\n•नीबू- 1 \n•चीनी -1/2 कप चीनी (100ग्राम )\n•बरफ के क्यूब्स -1कप ");
                        txt2 = ("• पके हुये आम धोइये, छीलिये और पल्प निकाल लीजिये.पल्प और चीनी को मिक्सर में डालकर बारीक पीस लीजिये,नीब्रू का रस और बर्फ के क्यूब्स भी मिक्सर में डालिये और एक बार फिर से अच्छी तरह फैट लीजिये.\n\n• 2-3 गिलास ठन्डे पानी  के डालिये और फिर से फैट लीजिये. आम का शर्बत तैयार हैं.\n\n• अभी हम आम का शर्बत ताज़े आम के पल्प से बना रहे हैं,आम का शर्बत आम के फ्रीजन पल्प से भी बनाया जा सकता हैं, यदि घर में ज्यादा आम जा जाय तब जाए उनका पल्प निकाल कर थोड़ी सी चीनी डालकर, पिसकर, एअर टाइट कन्टेनर में भर कर , फ्रीजर में रख दीजिये और 2 महिने से भी अधिक दिन तक जब भी आपका मन हो फ्रीजर से फ्रोजन पल्प निकालिये और आम का शर्बत बनाकर पीजिंये.\n\n• आम का कंसन्ट्रेट शर्बत बनाकर भी फ्रिज में रखा जा सकता हैं : -\n\n• 2 कप चीनी किसी बर्तन में निकालिये, 1 /2 कप से थोडा सा अधिक पानी मिलाइये और उबालने रख दीजिये, उबल जाने के बाद 3-4 मिनिट तेज गैस पर उबलने दीजिये, इस तरह 1 तार को चाशनी बना कर तैयार कर लीजिये.चासनी को ठंडा होने दीजिये \n\n3 या 4 आम का पल्प पीसकर तैयार कीजिये और 4 नीबू का रस भी निकाल लीजिये.\n\n• चाशनी ठंडी हो चुकी है आम का पल्प और नीबू का रस इस चाशनी में मिलाइये और छान लीजिये, किसी बोतल में भरकर फ्रिज में रखिये, 1 महिने तक, जब भी आपका मन करे, 1 भाग कंसन्ट्रेट आम का शरबत और 6 गुना पानी मिलाइये और थोडे से बर्फ के क्यूब्स  मिलाइये लीजिये ,पीजिये आम  का शर्बत तैयार है आम का कंसन्ट्रेट \n\n•शरबत फ्रिज में 1 माह तक रख कर यूज किया, जा सकता है\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 8: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.t9);
                       txt = ("•इमली का गूदा -4 बडे चम्मच\n•काला नमक - 1 -1/2 चम्मच\n•काली मिर्च पाउडर - 1/3 चम्मच\n•हरी इलायची पाउडर- 1/3 चम्मच\n• भुना हुआ जीरा पाउडर - 1 चम्मच\n भुना हुआ अजवाइन पाउडर - 3 चम्मच\n•चीनी - 6 बडे चम्मच\n•नमक - स्वादानुसार\n• कटी पोदीने की पती 9-10");
                        txt2 = ("•सबसे पहेले इमली का गूदे में 5 कप अच्छी तरह मिला ले\n\n• अब काली मिर्च पाउडर + हरी इलायची पाउडर + भुना हुआ जीरा पाउडर + काला नमक + अजवाइन पाउडर +चीनी + सादा नमक को मिला कर मिक्सी में पीस ले और इन मसालों के मिश्रण को किसी कटोरी में निकाल ले\n\nअब इन मसालों को  इमली के पानी में मिला दे और ठंडा करने के लिये फ्रिज में रख दे\n\n• आप का इमली का शरबत तैयार है इसमें बर्फ के क्यूब्स पोदीने को पत्ती डाल कर दे\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 9: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.t10);
                       txt = ("•चाय की पत्ती - 1 छोटी चम्मच\n•चीनी - 2- 3 छोटी चम्मच\n•छोटीं इलाइची - 2 छील कर पाउडर बना लीजिये  \n•मेंगो  क्रस 3-4 टेबल स्पून\n•नीबू- 1 /2 नीबू का रस निकाल लीजिये और 4 नीबू के पतले कटे वेजेज़");
                        txt2 = ("•किसी बर्तन में 2 कप पानी डालकर उबलने रख दीजिये.पानी में उबाल आने पर चीनी, चाय  पत्ती, और इलाइची पाउडर डालिये, गैस बन्द कर दीजिये. ढककर 2-3 मिनिट चाय को बर्तन में ही रख कर, चाय को ब्राउन कर लीजिये. अब चाय को किसी बर्तन में छान कर निकाल लीजिये और फ्रिज में रखकर ठंडी कर लीजिये\n\n•चाय ठंडी हो जाने एर, चाय में आधा नीबू का रस मिला लीजिये. 2 लम्बे गिलास लीजिये, प्रत्येक गिलास में 7- 8 टुकड़े बर्फ के डालिये, 1. 5-2 टेबल स्पून मेंगो क्रस डाल दीजिये, ठंडी की हुई चाय को दोनों गिलास में आधा आधा डाल दीजिये. नींबू के वेजेज़ 2 प्रत्येक गिलास में डाल दीजिये, तैयार है टी. ठंडी चाय पीजिये और तराबट लीजिये.\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.t11);
                       txt = ("• चीनी या पोलो (पेपर मिंट की   गोली) - स्वादानुसार\n•नींबू- 4 लिम्का या स्प्राइट या सोडा -1बोतल \n• पुदीना -10 पत्ते\n•बर्फ - कुचली बर्फ\n•नमक - 1 पिंच");
                        txt2 = ("•नींबू को छोटे टुकडो में काट लीजिये और बीज वाला भाग निकाल दीजिये ।\n\n•जग में चीनी या पोलो या पेपर मिंट की गोलीया, नींबू और पुदीने की पत्तिया डालकर अच्छे से कुठ लीजिये।\n\n•अब कुचली हुई बर्फ और नींबू का रस डाल दीजिये ।\n\n•उपर से sprite या limca या सोडा डाल दे और नमक डालकर अच्छे से मिक्स कर लीजिये। (चाहे तो आप और पुदीना डाल सकते हैं)\n\n• जग में बर्फ के टुकडे डाल लीजिये।\n\n• आपका विर्जिन मोजिंटो बनकर तैयार है इसे ठड़ा पीये ।\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 11: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.t12);
                       txt = ("•पपीता -2 छोटी कटोरी ( पका  हुआ )\n• चीनी - 8 छोटे चम्मच \n•दूध - 4 गिलास\n• बर्फ की   क्यूब - 1 ट्रे");
                        txt2 = ("•पपीता धो लीजिए, फिर उसका छिलका और बीज निकाल कर पपीते को छोटे टुकड़ो में काट लीजिए ।\n\n•कटे हुये टुकड़ो और चीनी को मिक्सर में डाल लीजिए,और अच्छी तरह से मैश कर लीजिए। मैश की हुई पपीते में बर्फ क्यूब और दूध डाल कर मिक्सर में फिर से,अच्छी तरह से मैश कर लीजिए।पपीता मिलक शेक बन कर तैयार हैं ठंडा - ठंडा गिलास में डाल कर पिलाइये ।\n\n");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.t13);
                       txt = ("•आनर -1\n•सेब-1 \n•संतरा-1 \n•अमरुद-1\n•चिन्नी-स्वादानुसार \n•काला नमक- स्वादानुसार\n• नींबू -1\n•पानी-1/2 कप \n•बर्फ -3 से 4 बर्फ की टुकड़े ");
                        txt2 = ("•अनार, अमरूद, सेब, संतरा को छील कर काट लीजिये,अब फलो को एक बर्तन में डाल लीजिये। (आप कोई भी फल का उपयोग कर सकते हैं)\n\n• फलो को मिक्सर ग्रिदर या जूसर में डाल दीजिये, उपर से पानी और चीनी डाल दे फिर मिक्सर को चला दीजिये,जिससे पतला सा ज्यूस बन जाये । (रंग के लिये आप orange syrup खाने वाला डाल सकतें हैं)\n\n• ज्यूस को छलनी से छान कर एक बर्तन में निकाल लीजिये और फ्रीज़ में रख दीजिये जिससे ठड़ा हो जाए\n\n•जब भी आपकी ज्यूस पीना हो उसमे काला नमक और नीबू का रस डाल दे और अच्छे से मिक्स कर लीजिये \n\n ज्यूस गीलास में डाल ले और बर्फ के टुकडे डाल लीजिये \n\n• आपका मिक्स फलो का ज्यूस तैयार हैं, इसे ठड़ा पीये। बहुत ही अच्छी वनीला आइसक्रीम  जमकर तैयार हैं, फ्रिजर से निकल लीजिए और ठंडी ठंडी वनीला आइसक्रीम को ड्राईंक्रूट से सजाकर कर सर्व कीजिये और खाइये.\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.t14);
                       txt = ("•नमकीन लस्सी के लिये\n•ताजा दही -500ग्राम (2 1/2 कप)\n• पानी 500 ग्राम (ठंडा) (2 1/2 कप)\n•बर्फ के क्यूब्स -- 1 कप\n• पोदीना या भूना हुआ जीरा - 1 छोटी चम्मच\n•काला नमक - 1 छोटी चम्मच\n•काली मिर्च - 1 /4 छोटी चम्मच (यदि आप चाहें तो )");
                        txt2 = ("• दही, नमक, बर्फ के टुकडे और जीरा या पोदीना, मिक्सर जार, में डाल कर फैट लीजिये.\n\n•पानी मिला कर एक बार फिर से मिक्सी चला कर फैट लीजिये.\n\n•दही को नमकीन लस्सी तैयार हे\n\n");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 14: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.t15);
                       txt = ("•खरबूजा - 1 मीडियम साइज़ के\n•चीनी -8 छोटे चम्मच \n•दूध - 4 गिलास \n• बर्फ  की  क्यूब -1 ट्रे ");
                        txt2 = ("•खरबूजे  को धो लीजिए, फिर उसका छिलका और बीज निकाल कर खरबूजे को छोटे टुकड़ो में काट लीजिए।\n\n•कटे हुये टुकड़ो और चीनी को मिक्सर में डाल लीजिए,और  अच्छी तरह से मैश कर लीजिए । फिर इसमे बर्फ की क्यूब और दूध डाल कर मिक्सर से अच्छी तरह से मैश कर लीजिए।\n\n•खरबूजे का शेक बन कर तैयार हैं ठंडा - ठंडा गिलास में डाल कर परोसिये ।\n\n");
                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                }
                break;

            }

            case "Fast Food Receipes": {
                switch (Text3) {
                    case 0: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.v1);
                       txt =("•साबूदाना - 150 ग्राम\n•तेल या घी - 1.5 टेबल स्पून\n•जीरा - आधा छोटी चम्मच\n•हींग - 1 पिंच (यदि आप चाहें)\n•हरी मिर्च - 2 ( बारीक कतरी हुई)\n•मूंगफली के दाने - 1 टेबल स्पून\n•पनीर - 70 ग्राम (यदि आप चाहें)\n•आलू - 1 मीडियम आकार का\n•अदरक - 1 इंच का टुकड़ा (कद्दूकस किया हुआ)\n•नमक - स्वादानुसार\n•कसा हुआ नारियल - 1 टेबल स्पून (यदि आप चाहें)\n•हरा धनियां - 1 टेबल स्पून (बारीक कतरा हुआ)");
                        txt2=("•साबूदाने को धो कर, 1 घंटे के लिये पानी में भीगने दीजिये. भीगने के बाद अतिरिक्त पानी निकाल दीजिये. यदि आप बड़े साबूदाना प्रयोग कर रहे हैं तो इसे 1 " +
                                "घंटा भिगोने के बजाय लगभग 8 घंटे भिगोये रखें.\n\n•आलू को छील कर धीइये और छोटे छोटे क्यूब्स में काट लीजिये. पनीर को भी छोटे छोटे क्यूब्स में काट लीजिये.\n\n•भारी तले की कढ़ाई में घी डाल कर गरम कीजिये. आलू के क्यूब्स गरम घी में डाल कर हल्के ब्राउन होने तक तल कर निकाल कर प्लेट में रख लीजिये. आलू के क्यूब्स तलने के बाद पनीर के क्यूब्स डाल कर हल्के ब्राउन तल कर उसी प्लेट में निकाल कर रखिये.\n\n•मूंगफली के दाने को मोटा चूरा कर लीजिये इसे दरेरा करें एकदम बारीक चूरा न करें\n\n•बचे हुये गरम घी में जीरा और हींग डाल दीजिये. जीरा  भुनने के बाद, हरी मिर्च और अदरक डाल दीजिये, और चमचे से मसाले को चलाइये, इस मसाले मे मुंगफली का चूरा डाल कर एक मिनिट तक भूनिये. अब साबूदाना, नमक और काली मिर्च डाल कर अच्छी तरह 2 मिनिट चमचे से चला कर भूनिये. 2 टेबल स्पून पानी डाल कर धीमी गैस पर 7-8 मिनिट तक पकाइये.\n\n•ढक्कन खोलिये और देखिये कि साबूदाने नरम हो गये है. यदि नहीं हुये हैं, और आपको मह्सूस हो कि अभी साबूदाने पकने के लिये और पानी चाहिये, तब 1 या 2 टेबल स्पून पानी डाल कर 4-5 मिनिट धीमी गैस पर और पकने दीजिये. आलू और पनीर के क्यूब्स मिला दीजिये. और चलाकर कढ़ाई को गैस से उतार लीजिये साबूदाना की खिचड़ी को प्याले |");
                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 1: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.v2);
                       txt =("•साबूदाने1 कप\n•  आलू2 कप उबले और मशले हुए\n•शिंग दाना1/2 कप सेक कर आधा पिस्सा हुआ\n•अदरक1 चम्मच पीसा हुआ\n•हरी मिर्ची1/2 चम्मच बारीक़ कटा हुआ\n•निम्बू का रस2 चम्मच\n•धनिया पत्ता2 चम्मच\n•नमक1 छोटा चम्मच या स्वादानुसार\n•तेल4 कप तलने के लिए.");
                        txt2=("•साबूदाना को धो कर उसमे दुगना पानी दल कर रात भर या फिर 4 से ५ घंटे तक भिगोकर रख दीजिये.\n\n•आलू को उबल कर उसका छिलका उतर ले. उसे कद्दूकस करके बाजु पर रख दे.\n\n•शिंग डेन को हल्का सकेक कर उसकी परत या छिलके उतर ले. और उसे दरदरा पिसले.\n\n•एकबार साबूदाना भीग जाये तो उसे छलनी में छल ले और अतिरिक्त पानी को निकाल दे. उसके लिए साबूदाने को छलनी में १० मिनट तक रखिए.\n\n•भीगे हुए साबूदाने को एक बड़े कटोरे में लेकर उसमे कदुकास किया हुआ आलू और दरदरा पीसा शिंग दाना भी मिला ले.\n\n•इस मिक्षर में हरी मिर्ची,अदरक और निम्बू का रस मिला दे. स्वादानुसार नमक मिला कर अच्छे से सभी सामग्री को मिक्स कर ले.\n\n•अब साबूदाना मिक्षर में से थोडा हिस्सा ले कर उसे वडा या पेटिस का आकार प्रदान करे. बाकि के मिक्षर का भी इसीतरह वडा या पेटिस बना ले.\n\n•एक कढाई में तेल गरम करे और तेल अच्छे से गरम हो जाये तब साबूदाना वडा या पेटिस को हलके सुनहरे रंग का होने तक तल ले.\n\n•अब साबूदाना वडा या पेटिस को तेल से बहार निकाल कर पेपर नेपकिन पर रख दे ताकि अतिरिक्त तेल को पेपर नैपकिन सोंख ले.\n\n•साबूदाना वडा परोसने के लिए तैयार है.उसे गरमा गरम हरी चटनी या टमाटर सोस के साथ परोसे. ");
                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 2: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.v3);
                       txt =("•साबूदाना - 250 ग्राम ( 2 कप)\n•पानी - 2 लीटर ( 10 कप )\n•नमक - स्वादानुसार ( 2/3 छोटी चम्मच)");
                        txt2=("•साबूदाना पापड़ के लिये छोटा साइज का साबूदाना लिया जाता है.साबूदाने को धो कर, साबूदाने की मात्रा से दुगना पानी यानी (चार कप) डालकर, 2 घंटे के लिये भिगो रख दीजिये.\n\n•किसी बड़े और भारे तले के बर्तन में छह कप पानी डालकर उबलने रख दीजिये. पानी में उबाल आने के बाद, भीगा हुआ साबूदाना और नमक डालिये, साबूदाना को थोड़ी थोड़ी देर में चमचे से चलाते हुये पकाइये, ताकि वह तले में न लगे. \\n•साबूदाना का घोल गाड़ा पारदर्शक हो जाने तक घोल को पका लीजिये, घोल को पकने में आधा घंटा लग जाता हैं, आग बन्द कर दीजिये. साबूदाने का गाड़ा पारदर्शल घोल साबूदाना पापड़ बनाने के लिये तैयार है.\n\n•पापड़ बनाइये -\n\n•साबूदाना पापड़ आप स्टील की प्लेट या थाली में भी सुखा सकते हैं या पालीथीन पर भी. पालीथीन के बड़े साइज में इन्हें अधिक संख्या में सुखाया जा सकता है.\n\n•पापड़ बनाने के लिये कोई पारदर्शक बड़ी पोलिथिन शीट किसी चादर के ऊपर बिछा लीजिये.\n\n•साबूदाने के गरम घोल को पोलिथिन शीट या स्टील की थाली के पास ले जाइये और चमचे से एक बड़ा चमच्च भर कर साबूदाना घोल निकालिये,पोलिथिन शीट पर डालिये और उसी चमचे से गोल, 2 1/2 इंच या 3 इंच के व्यास में चपाती के जैसा मोटा फैला दीजिये. दूसरा चमचा घोल भर कर निकालिये और पहले पापड़ से एक इंच की दूरी रखते हुये दूसरापापड़ उसी तरीके से फैलाइये, इसी तरह एक पापड़ से दूसरे पापड़ में दूरी रखते हुये, सारे घोल से पापड़ बना लीजिये.\n\n•पापड़ बनाने के 4-5 घंटे के बाद एक एक पापड़ को उठाकर पलट दीजिये, ज्यादा सूखने पर पापड़ पोलिथिन शीट से चिपक जाने के कारण पलटने पर टूट सकते हैं.\n\n•साबूदाने के पापड़ 2 दिन की धूप में सूख जाते हैं, तीसरे दिन पापड़ कुछ गीले लग रहे हों तो और सुखा लीजिये.\n\n•साबूदाने के पापड़ सूख कर तै");
                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 3: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.v4);

                       txt =("•साबूदाना- 1कप\n•दूध- 2 कप\n•चीनी- 1 कप\n•इलायची पाउडर- 1 चम्मयच \n•किशमिश- 10\n•बादाम- 10\n•काजू- 10\n•केसर- 1 चुटकी");
                        txt2=("•बडे़ साबूदाने को कम से कम 6 घंटों के लिये पानी में भिगो दें। \n\n•गैस पर दूध को भारी तले बर्तन में उबालें। आंच को तेज रखें।\n\n•जब दूध उबलना शुरु हो जाए तब गैस धीमी कर दें और दूध को गाढा होने दें। \n\n•अब इसमें चीनी मिलाएं और 10 मिनट के बाद साबूदाने डालें। \n\n•अब दूध को धीमी आंच पर कुछ देर पकने दें, फिर इसमें केसर डालें और आंच बंद कर के इसे सर्व करें। ");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 4: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.v5);
                       txt =("•बड़ा साबुदाना - 200 ग्राम ( 1 कप)\n•मूंगफली के दाने - 200 ग्राम (1 कप)\n•बादाम - 20 - 25\n•रिफाइन्ड तेल  या घी - तलने के लिये\n•नारियल - पतला कतरा हुआ (आधा कप)\n•सेंधा नमक - आधा छोटी चम्मच\n•काली मिर्च - 1/4  छोटी चम्मच");
                        txt2=("•बड़े साबूदाने को किसी बर्तन में निकालिये, 2 छोटी चम्मच पानी डालिये और अच्छी तरह मिलाइये, 5- 10 मिनिट के लिये रख दीजिये ताकि ये थोड़े से नम हो जांय. मूगफली के दाने साफ कर लीजिये.\n\n•भारी तले की कढ़ाई में एक कप तेल डाल कर गरम कीजिये, तेल जब अच्छा गरम हो जाय तब गरम तेल में चमचा पूरा भर हुआ साबूदाना डालिये, आग बिलकुल धीमी कर दीजिये, साबूदाना फूलने दीजिये, बीच बीच में कलछी सेचला दीजिये, अगर साबूदाने फूल कर उचट रहे हों तो कढ़ाई के ऊपर थाली ढकी जा सकती है, पूरे साबूदाने फूलने के बाद, साबूदाने को अन्दर तक सिकने के बाद, इन्हैं प्लेट में निकाल लीजिये. साबूदाने को तोड़कर या खाकर देख लीजिये कि वह अन्दर तक भून गया है.  बचे हुये साबूदाने इसी तरह फिर से डालिये और तल कर निकाल लीजिये.  सारे साबूदाने इसी तरह तल कर तैयार कर लीजिये.\n\n•अब आप मूंगफली के दाने तेल में डालिये और धीमी आग पर कलछी से चलाते हुये हल्के ब्राउन होने तक भून लीजिये ये बड़ी जल्दी 3-4 मिनिट में भून जाते हैं\n\n•बादाम भी तेल में डाल कर भून कर निकाल लीजिये और नारियल के टुकड़े भी हल्के से भून कर निकाल लीजिये.\n\n•इन सभी भुनी हुई चीजों को मिलाइये, पिसा हुआ सेंधा नमक और पिसी हुई काली मिर्च भी डाल कर मिला  दीजिये. लीजिये तैयार हो गई आपके लिये व्रत की स्वादिष्ट नमकीन. ये नमकीन आप ठंडा होने पर अभी आज के व्रतमें खाइये और बची हुई नमकीन कन्टेनर में भर कर रख लीजिये दूसरे दिन व्रत में या 2 महिने तक कभी भी खाइये.");



                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 5: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.v6);

                       txt =("•राजगिरा - 1 कप (150 ग्राम)\n•गुड़ - 1 कप ( 250 ग्राम)\n•घी - 2-3 छोटे चम्मच\n•किशमिश - 2 टेबल स्पून (यदि आप चाहें)\n•काजू - 2 टेबल स्पून (यदि आप चाहें)");
                        txt2=("•भारे तले की कढ़ाई को अच्छी तरह गरम कीजिये, 1 छोटा चम्मच राजगिरा के दाने डालिये और लगातार हिलाते हुये उन्हैं भूनिये, तुरन्त ही राजगिरा के दाने फूलने लगते हैं, जैसे ही सारे दाने फूल जायें, उन्हैं प्याले में निकाल लीजिये और इस प्रक्रिया को दुहराते हुये सारे राजगिरा को भून लीजिये. भुने हुये राजगिरा को छलनी में छान लीजिये, भुने हुये राजगिरा 3 कप हो जाते हैं, जो राजगिरा फूले नहीं हैं वह छलनी से नीचे आ जायेंगे उन्हैं अलग कर लीजिये, लड्डू बनाने के लिये फूले हुये राजगिरा यूज कीजिये.\n\n•गुड़ को बारीक तोड़ लीजिये. काजू बारीक काट लीजिये. किशमिश के डंठल तोड़ लीजिये और कपड़े से पोंछ लीजिये.\n\n•कढ़ाई में 2 छोटे चम्मच घी डाल दीजिये, घी को पिघलने पर गुड़ डाल दीजिये, 1-2 टेबल स्पून पानी डाल दीजिये, और गुड़ को पिघलने दीजिये, गुड के पूरी तरह से मेल्ट होने के बाद, 1-2 मिनिट पका लीजिये, गुड़ में झाग दिखाई देने लगते हैं, चाशनी बन कर तैयार है, गुड़ में अगर कुछ गंदगी दिखाई दे रही हैं तो चाशनी को छान लीजिये, और राजगिरा में मिला दीजिये, काजू और किशमिश भी डाल दीजिये, सारी चीजें अच्छी तरह से मिला दीजिये. लड्डू बनाने के लिये मिश्रण तैयार है.\n\n•गरम गरम मिश्रण से लड्डू बनाइये, हाथों पर थोड़ा सा पानी लगाकर गीला कीजिये, थोड़ा सा मिश्रण उठाइये और दोनों हाथों से गोल करके लड्डू बनाइये और प्लेट में लगा दीजिये, फिर से हाथ गीला कीजिये, और मिश्रण उठाइये और लड्डू बनाकर प्लेट में रख लीजिये, हर लड्डू बनाने से पहले हाथ गीला कर लीजिये, इसी तरह सारे लड्डू बना कर तैयार कर लीजिये.\n\n•राजगिरा के लड्डू 3-4 घंटे हवा में खुले रहने दीजिये, अब इन्हैं कन्टेनर में भर कर रख लीजिये");

                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 6: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.v7);
                       txt =("•साबूदाना एक कप\n•पिसी हुई शक्कर एक कप\n•50 ग्राम नारियल का बूरा\n•8 से 10 कटे हुए बादाम\n•10 से 15 कटे हुए काजू\n•3 से 4 चुटकी इलाइची पाउडर\n•2 से 3 बड़े चम्मच घी");
                        txt2=("•एक कढ़ाई में धीमी आंच पर सूखा साबूदाना डालकर भून लें, जब साबूदाना थोड़ा फूल के बड़ा और हल्का सुनहरे रंग का कुरकुरा हो जाए, तो गैस बंद कर दें और साबूदाने को ठंडा होने दें. ठंडा होने के बाद मिक्सी में साबूदाने को पीसकर बारीक पाउडर बना ले.\n\n•एक कढ़ाई में नारियल का बूरा डालकर भून लें, जब नारियल हल्का सुनहरा हो जाए, तब उसमें साबूदाना पाउडर, शक्कर मिला के गैस बंद कर दें.\n\n• एक छोटे पैन में घी डाल के गर्म करें, फिर उसमें कटे हुए मेवे डाल कर 2 से 3 मिनट तक भून लें.\n\n•अब भुने हुए मेवे, घी और इलाइची पाउडर साबूदाने के मिक्सचर में डालकर सब को अच्छे से मिला लें.\n\n• जब मिक्सचर हल्का गर्म हो उसी समय मिक्सचर के लड्डू बना लें.\n\n• ठंडे होने के बाद एयरटाइट डिब्बे में भर के रख दे.");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 7: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.v8);
                       txt =("•एक कप राजगिरा या रामदाना\n•2 कप दूध\n•10 से 15 काजू कटे हुए\n•एक छोटा चम्मच इलायची पाउडर\n•स्वादानुसार चीनी");
                        txt2=("•राजगिरा या रामदाने बारीक छलनी में डालकर पानी से अच्छी तरह धो लें.\n\n•अब बर्तन में दूध और आधा कप पानी डालकर गैस पर गर्म होने के लिए रखें.\n\n• जब दूध में उबाल आ जाए तो गैस धीमी करके दूध में राजगिरा डालकर पकाएं.\n\n• राजगिरा नर्म होकर पक जाएं तो इसमें काजू और चीनी डालकर 5 मिनट मध्यम आंच पर पकाएं.\n\n•इसके बाद खीर में इलायची पाउडर डालकर 2 मिनट तेज आंच पर पकाएं.\n\n•अब गैस बंद कर दें. लीजिए तैयार है राजगिरा की खीर. इसे कटे हुए मेवों से गार्निश करके गर्मागर्म सर्व करें.");



                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 8: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.v9);
                       txt =("•१/२ कप सामा\n•१/२ कप राजगीरा आटा\n•१/२ कप खट्टी छास/मठ्ठा\n•१ टेबल-स्पून अदरक-हरी मिर्च का पेस्ट\n•सेंधा नमक, स्वादअनुसार\n•तेल , पकाने के लिए");
                        txt2=("•सामा को साफ और धोकर उपयुक्त पानी में २ घंटे के लिये भिगो दें।\n\n•पानी छानकर २ टेबल-स्पून पानी के साथ मिक्सर में पीसकर मुलायम पेस्ट बना लें।\n\n•मिश्रण को एक बाउल में डालें, राजगीरा आटा, छास/मठ्ठा, अदरक-हरी मिर्च का पेस्ट और सेंधा नमक डालकर अच्छि तरह से मिलाऐं। ढ़ककर रातभर खमीर आने के लिये रख दें।\n\n•घोल को ८ बराबर हिस्सो में बाँटे और एक तरफ रख दें।\n\n•एक नॉन-स्टिक तवा गरम करें, घोल के एक हिस्से को डालकर १२५ mm (५'') व्यास के गोल आकार में फैलाकर पतला दोसा बनाऐं।\n\n•किनारों पर थोड़ा तेल और दोनो तरफ से सुनहरा होने तक पकाऐं। मोड़कर चंद्र या त्रिकोन आकार बनायें।\n\n•बचे हुए घोल का प्रयोग कर ७ और दोसे बनाऐं।\n\n•मूँगफली दही चटनी या हरी चटनी के साथ गरमा गरम परोसें।");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 9: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.v10);
                       txt =("•१ कप सामा\n•१/२ कप कुट्टु\n•१ कप कसा हुआ नारीयल\n•१/२ कप कसा गुड़\n•१/२ कप मसले केले\n•एक चुटकी सेंधा नमक\n•१/४ टी-स्पून इलायची पाउडर\n•घी पकाने के लिये");
                        txt2=("•सामा और कुट्टु को साफ और धोकर उपयुक्त पानी में १ घंटे के लिये भीगो दें। पानी से छानकर एक तरफ रख दें।\n\n•सामा और कुट्टु को अलग-अलग २ टेबल-स्पून पानी के साथ मिक्सर में पीसकर मुलायम बना लें।\n\n•सामा का पेस्ट, कुट्टु का पेस्ट, नारीयल, गुढ़, केला, सेंधा नमक और इलायची पाउडर को एक बाउल में अच्छि तरह से मिला लें।\n\n•एक नॉन-स्टिक तवा गरम करें, चम्मच भर घोल डालकर ७५ mm (३'') व्यास के गोल आकार में फैलायें।\n\n•थोड़े से घी का प्रयोग कर, दोने तरफ से सुनहरा होने तक पकाऐं।\n\n•बचे हुए घोल का प्रयोग कर १४ और पॅनकेक बनायें।\n\n•मीठे दही के साथ गरमा गरम परोसें।");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 10: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.v11);
                       txt =("•काजू - 250 ग्राम (एक कप)\n•चीनी या गुड़ - 250 ग्राम (एक कप)\n•घी - 2 छोटी चम्मच");
                        txt2=("•काजू को 2 टुकड़ों में काट लीजिये.\n\n•कड़ाई में 1 छोटी चम्मच घी डाल कर गरम कीजिये, घी में चीनी डालिये और मिला दीजिये, तेज या मीडियम आग पर चीनी को पिघलने दीजिये. चीनी को चमचे से लगातार चलाते रहिये, चीनी तले में लगनी नहीं चाहिये.\n\n•जैसे ही चीनी पूरी तरह पिघल जाय, आग बन्द कर दीजिये, कटे हुये काजू डाल कर अच्छी तरह मिलाइये,    चिकनी की गई थाली या समतल जगह को चिकना करके, काजू मिश्रण को उसके ऊपर रखिये, बेलन को घी लगाकर चिकना कीजिये, चिक्की के मिश्रण को जितना पतला या मोटा आप चाहें बेलिये.\n\n•चिक्की के गरम ही रहने तक जिस आकार में आप चिक्की के टुकड़े करना चाहते हैं यदि चाकू से निशान डाल दे, टुकड़े उसी आकार में तोड़े जा सकते हैं. ठंडा होने पर चिक्की के टुकड़े चाकू से नहीं हाथ से ही अपने पसन्द अनुसार टुकड़े कर लीजिये.\n\n•काजू की चिक्की तैयार है. काजू चिक्की (Cashew Brittle - Cashewnut Chikki) को एअर टाइट कन्टेनर में भर कर रख लीजिये और जब भी आपका मन करे महिने से भी अधिक दिन, काजू चिक्की कन्टेनर से निकालिये और खाइये.");



                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 11: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.v12);
                       txt =("•आलू - 300 (4या 5 मध्यम साइज केआलू)\n•चीनी - 100 ग्राम(आधा कप)\n•घी    -   4 टेबल स्पून\n•दूध   -  एक कप\n•किशमिश  -  1 टेबल स्पून (डंठल तोड़िये और धो लीजिये)\n•काजू   -   1 टेबल स्पून ( काजू के 5-6 टुकड़ों में काट लीजिये)\n•इलाइची  -  5-6 (छील कर कूट लीजिये)\n•बादाम - 6-7 (बारीक कतर लीजिये)");
                        txt2=("•आलू को धो कर, उबाल लीजिये, ठंडा कीजिये, छील कर तोड़ लीजिये.\n\n•कढ़ाई में 2 चम्मच घी डालिये, गरम होने दीजिये.  घी में आलू डाल कर कलछी से चलाते हुए धीमी आग पर 7-8 मिनिट तक कलछी से भुनिये.  भुने हुये आलू में दूध और चीनी, किशमिश और काजू डाल दीजिये.   इस समय आप हलवा को लगातार कलछी से चलाते रहें, 6-7 मिनट में  आलू का हलवा बनकर तैयार हो जायेगा.  \n\n• आग बन्द कर दीजिये.  आलू के हलवे में इलाइची पाउडर डाल कर मिला दीजिये. बचा हुआ घी भी डाल दीजिये, लीजिये आपका आलू का हलवा तैयार है.\n\n•आलू के हलवा को प्याले में निकालिये.   कतरे हुये बादाम ऊपर से डालकर सजाइये.   गरमा गरम आलू का हलवा परोसिये और खाइये. ठंडा होने पर भी यह हलवा बहुत अच्छा लगता है.\n\n•आलू के हलवा (Alu ka Halwa) में आप अपनी पसन्द से कोई भी मेवा हटा सकते हैं और अपनी पसन्द की मेवा डाल भी सकते हैं.");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 12: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.v13);

                       txt =("•1 कप साबूदाना\n•2 बड़े आलू उबले और मैस करे हुए \n•1/2 कप भूने और दरदरे पिसे मूंगफली के दाने \n•1/2 चम्मच जीरा पाउडर \n•2 हरी मिर्च बारीक कटी हुई\n•2 बड़े चम्मच हरी धनिया बारीक कटी हुई \n•1 चम्मच नीबू का रस\n•1 छोटा चम्मच अदरक कद्दूकस करा हुआ \n•सेंधा नमक (रॉक साल्ट) स्वादानुसार\n•घी सकने के लिए");
                        txt2=("•साबूदाना को साफ करके अच्छे से पानी से तब तक धोये जबतक साफ पानी न आने लगे और साबूदाने का सारा पाउडर बह जाये.\n\n•धुले हुए साबूदाने को 4-5 घंटे या फिर रातभर के लिए भीगा के रख दे.\n\n•भीगे हुए साबूदाने में मैश करा हुआ आलू, दरदरी पिसी मूंगफली, हरी मिर्च, हरी धनिया, अदरक, जीरा पाउडर, नमक, मिला के आटे की तरह गूँथ ले.\n\n•फिर उसके नीबू के आकार के टुकड़े कर ले.\n\n•अब दो प्लास्टिक सीट ले ले. उस के ऊपर थोडा घी लगा ले. अब एक टुकड़ा लेकर उसके बींच में रखे फिर दूसरी प्लास्टिक सीट से ढक दे. और हाथ से या फिर बेलन से बेल के गोल आकार का बना ले.\n\n•अब एक तवा या पैन गरम करे उसके ऊपर थोडा तेल लगा के चिकना करले.\n\n•फिर बेला हुआ थालीपीठ सावधानी से उठा के तवे के ऊपर डाल दे.\n\n•एक तरफ सिंकने के बाद दूसरी तरफ से पलट के सेक ले किनारे से थोडा तेल डाल के कुरकुरा होने तक सेक ले.\n\n•इसी तरह से सारे थालीपीठ बना ले.\n\n•गरम गरम थालीपीठ हरी चटनी या रायते के साथ परोसे.");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 13: {
                        textView3.setText(Text2);img.setImageResource(R.drawable.v14);
                       txt =("•आलू 4 माध्यम आकार के उबले हुए\n•2 हरी मिर्च बारीक कटी हुई\n•अदरक 1 छोटा टुकड़ा कद्दूकस करा हुआ \n•जीरा 1 छोटा चम्मच\n•भुनी मूंगफली का पाउडर 1 बड़ा चम्मच \n•दही या छाछ 1 कप\n•सेंधा नमक स्वादानुसार\n•2 चम्मच हरी धनिया \n•घी 2 चम्मच");
                        txt2=("•उबले आलू को छोटे छोटे टुकडो में तोड़ ले. \n\n•एक कढाई में घी गरम करे जीरा डाल दे जीरा तड़क जाने के बाद हरी मिर्च और अदरक डाले. \n\n•आलू और मूंगफली का पाउडर डालकर भूने सेंधा नमक और छाछ डाले, धीमी आंच करके 4-5 मिनट पकने दे. \n\n•पांच मिनट के बाद गैस बंद कर दे और हरी धनिया से सजा के गरमा गरम कुट्टू या सिंघाड़े की पूरी के साथ खाए और खिलाये ");


                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;

                    }
                    case 14: {

                        textView3.setText(Text2);img.setImageResource(R.drawable.v15);
                       txt =("•केला - 1 (मोटे गोल टुकड़े में काट लीजिये)\n•सेब - 1 ( छील कर छोटे छोटे टुकड़े में काट लीजिये)\n•अंगूर - 40-50 (डंठल तोड़ लीजिये)\n•खरबूजा -  1 कप ( छोटे छोटे टुकड़े कटे हुये)");
                        txt2=("•400 ग्राम (2 कप) दही को 100 ग्राम  मलाई और 2 -3 टेबल स्पून चीनी मिला कर फैट लीजिये.\n\n•सारे तैयार फल दही में मिलाइये.  2 इलायची छील कर बारीक कूट लीजिये रायते में मिला दीजिये. रायते को ठंडा होने के लिये फ्रिज में रख दीजिये.\n\n•फलों का रायता तैयार है, ठंडा खुशबू दार रायता परोसिये और खाइये.फलों का रायता बनाने के लिये आप अपने मन पसन्द कोई भी फल ले सकते हैं और कोई भी हटा सकते हैं");
                        
                        textView1.setText(txt);
                        textView2.setText(txt2);
                        break;
                    }
                }
                break;

            }



        }

            FloatingActionMenu fab = (FloatingActionMenu) findViewById(R.id.main);

           FloatingActionButton fab_1 = (FloatingActionButton) findViewById(R.id.fab3);
           FloatingActionButton fab_2 = (FloatingActionButton) findViewById(R.id.fab2);
           FloatingActionButton fab_3 = (FloatingActionButton) findViewById(R.id.fab1);

            fab_1.setOnClickListener(new View.OnClickListener() {
                @Override
                public void onClick(View v) {

                    Intent intent = new Intent(Intent.ACTION_SEND);
                    intent.setType("text/plain");
                    String send = "Ingredients\n\n" + txt + "\n\nRequirement\n\n" + txt2 + "\n\n";
                    intent.putExtra(Intent.EXTRA_TEXT, send);
                    startActivity(Intent.createChooser(intent, "My Application"));
                }
            });


        fab_2.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {

                Intent intent =new Intent(subhome.this,Main2Activity.class);
                startActivity(intent);
            }
        });

        fab_3.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {

                Intent intent = new Intent(Intent.ACTION_VIEW, Uri.parse("https://play.google.com/store/apps/details?id="+getPackageName()));
                 startActivity(intent);
            }
        });

        }


    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        getMenuInflater().inflate(R.menu.main, menu);
        return super.onCreateOptionsMenu(menu);
    }


    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        int id = item.getItemId();

        if(id==android.R.id.home);
        finish();



        if (id == R.id.fav) {
            Intent intent=new Intent(subhome.this,Main2Activity.class);
            startActivity(intent);

        }

        if (id == R.id.share) {
            Intent share = new Intent(Intent.ACTION_SEND);
            share.setType("text/plain");
            // share.setPackage("com.google.android.gm\n\n");
            String shareSub = "Receipe";
            share.putExtra(Intent.EXTRA_SUBJECT, getPackageName());
            startActivity(Intent.createChooser(share, "Hindi Receipes"));
        }

        if (id == R.id.fee) {
            Intent intent = new Intent(Intent.ACTION_SEND);
            intent.setType("text/plain");
            intent.setPackage("com.google.android.gm");

            intent.putExtra(Intent.EXTRA_SUBJECT,"Feedback");
            intent.putExtra(Intent.EXTRA_EMAIL,new String[]{"info@inforises.com"});
            intent.putExtra(Intent.EXTRA_TEXT,"Share your experience");
            startActivity(intent);
        }

        if (id == R.id.exit) {
            finish();
        }
        return super.onOptionsItemSelected(item);
    }

    }

